{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Motorbeam.com"},"author":"Ben Raja","title":"Upcoming Royal Enfield Bullet 350 Spied For The 2nd Time, Subtle Changes Seen - MotorBeam.com","description":"2023 Royal Enfield Bullet 350 Spotted Again With Black Seat. It Shares Its Engine With The New Classic 350 And Meteor 350","url":"https://www.motorbeam.com/2023-royal-enfield-bullet-350-spotted-again-with-black-seat/","urlToImage":"https://www.motorbeam.com/wp-content/uploads/2023-Royal-Enfield-Bullet-350.jpg","publishedAt":"2022-07-12T16:15:17Z","content":"The bike sports a new thicker seat\r\nRoyal Enfield is gearing up to launch the 2023 Bullet 350 and a test mule of the bike has been spied testing for the second time undisguised. It would be a generat… [+2332 chars]"},{"source":{"id":"bloomberg","name":"Bloomberg"},"author":null,"title":"Oil Sinks on Demand Concerns as IEA Sees Energy Crisis Enduring - Bloomberg","description":null,"url":"https://www.bloomberg.com/tosv2.html?vid=&uuid=2e1e0e55-01f3-11ed-9210-4f707a52466e&url=L25ld3MvYXJ0aWNsZXMvMjAyMi0wNy0xMS9vaWwtZXh0ZW5kcy1kcm9wLWFzLWNvbmNlcm5zLW92ZXItZWNvbm9taWMtc2xvd2Rvd24tZ3JpcC1tYXJrZXQ=","urlToImage":null,"publishedAt":"2022-07-12T12:48:42Z","content":"To continue, please click the box below to let us know you're not a robot."},{"source":{"id":null,"name":"CNBCTV18"},"author":"CNBCTV18.com","title":"Stock Market Highlights: Sensex ends 509 pts lower and Nifty50 gives up 16,100 — rupee hits record closing low - CNBCTV18","description":"Stock Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 fell around one percent on Tuesday amid weakness across global markets as nervousness persisted among investors on steep hikes in interest rates and their impact on economic growth. …","url":"https://www.cnbctv18.com/market/stock-market-news-live-update-nifty-sensex-hcl-tech-share-price-rupee-crude-gold-covid-14102902.htm","urlToImage":"https://images.cnbctv18.com/wp-content/uploads/2022/07/July-12-closing.png","publishedAt":"2022-07-12T12:32:25Z","content":"Market At Close | Sensex and Nifty50 near day's lows as global currencies depreciate vs US dollar\r\nHere are some highlights: \r\n--Financial and IT shares biggest drags on market\r\n--Infosys, ICICI Bank… [+581 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Livemint","title":"HCL Tech Q1 PAT at ₹3,283 cr, declares dividend of ₹10 per share | Mint - Mint","description":"Consolidated revenue stood at  ₹23,464 crore rising by 16.9% yoy and 3.8% qoq. In dollar terms, revenue was at $3,025 million up by 1.1% qoq and 11.2% yoy. The constant currency revenue growth stood at 2.7% qoq and 15.6% yoy in the Q1 of this fiscal.","url":"https://www.livemint.com/news/india/hcl-tech-q1-pat-at-rs-3-283-cr-declares-dividend-of-rs-10-per-share-11657605237467.html","urlToImage":"https://images.livemint.com/img/2022/07/12/600x338/hcl_tech_1657595479605_1657605290081_1657605290081.jpg","publishedAt":"2022-07-12T12:31:07Z","content":"IT service provider HCL Technologies posted a sequential drop of 8.6% in the consolidated net profit to 3,283 crore for the quarter ending June 30, 2022 (Q1FY23) period. However, the PAT recorded a g… [+2577 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Jayprashanth Mohanram","title":"Maruti Grand Vitara: New teaser drops ahead of the SUV’s official unveiling - CarToq.com","description":"On the 20th of July, 2022, Maruti Suzuki will take yet another stab at the mid-size SUV market in India with the all-new Grand Vitara. The automaker has just dropped another teaser for the new Grand Vitara, which shares its platform and engines with the recen…","url":"https://www.cartoq.com/maruti-grand-vitara-new-teaser-drops-ahead-of-the-suvs-official-unveiling/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/maruti-suzuki-grand-vitara-featured.jpg","publishedAt":"2022-07-12T12:26:10Z","content":"On the 20th of July, 2022, Maruti Suzuki will take yet another stab at the mid-size SUV market in India with the all-new Grand Vitara. The automaker has just dropped another teaser for the new Grand … [+2744 chars]"},{"source":{"id":null,"name":"Kitco NEWS"},"author":"http://www.facebook.com/kitconews","title":"Powerful greenback keeping strangle-hold on gold, silver - Kitco NEWS","description":"Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments","url":"https://www.kitco.com/news/2022-07-12/Powerful-greenback-keeping-strangle-hold-on-gold-silver.html","urlToImage":"https://www.kitco.com/news/2022-07-12/images/goldchart_0712_am.png","publishedAt":"2022-07-12T12:19:00Z","content":"Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+2453 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Indigo announces salary change as mass sick leaves hamper airline operations | Details - Hindustan Times","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DEG9o4rqPk1s","urlToImage":null,"publishedAt":"2022-07-12T12:06:56Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"Favourable base propels IIP growth to 19.6% in May - Moneycontrol","description":"Industrial growth jumped as the base year data for May 2021 was adversely affected by the second wave of the coronavirus pandemic.","url":"https://www.moneycontrol.com/news/business/economy/favourable-base-propels-iip-growth-to-19-6-in-may-8816281.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2020/02/INDUSTRY-770x433.jpg","publishedAt":"2022-07-12T12:06:49Z","content":"India's industrial growth, as per the Index of Industrial Production (IIP), surged to 19.6 percent in May from 7.1 percent in April, data released on July 12 by the Ministry of Statistics and Program… [+2624 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"June CPI inflation comes in at 7.01%, RBI one quarter away from failure - Moneycontrol","description":"The latest number means headline retail inflation has now spent 33 consecutive months above the medium-term target of 4 percent and six straight months above the 6 percent upper-bound of the 2-6 percent tolerance range.","url":"https://www.moneycontrol.com/news/business/economy/june-cpi-inflation-comes-in-at-7-01-rbi-one-quarter-away-from-failure-8815851.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/02/Inflation_shutterstock_336372560-770x433.jpg","publishedAt":"2022-07-12T12:03:49Z","content":"India's headline retail inflation rate, as measured by the Consumer Price Index (CPI), was largely unchanged at 7.01 percent in June from 7.04 percent in May, data released on July 12 by the Ministry… [+3831 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Sunil Shankar Matkar","title":"Mutual funds buy afresh into one stock, but completely exit four in June - Moneycontrol","description":"Overall, the equity segment remained the favourite among mutual funds in June, and saw more buying than other segments. AMCs bought a net Rs 15,498 crore of equity and equity-oriented schemes during the month.","url":"https://www.moneycontrol.com/news/business/markets/mutual-funds-buy-afresh-into-one-stock-but-completely-exit-four-in-june-8815461.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/07/stocks_sensex_nifty_stockmarket5-770x433.jpg","publishedAt":"2022-07-12T10:57:36Z","content":"Domestic asset management companies bought afresh into one stock, but completely exited four in June 2022, when foreign institutional investors (FIIs) remained net sellers of Indian equities for anot… [+5543 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"Tata Nexon EV owner replaces battery under warranty: Told battery costs Rs 7 lakhs - CarToq.com","description":"Tata Nexon EV has become the largest selling electric car in the Indian market by a big margin. Tata even introduced the new Nexon EV Max with a longer driving range. People wanting to buy Tata Nexon always have the cost of battery replacement in their heads.…","url":"https://www.cartoq.com/tata-nexon-ev-owner-replaces-battery-after-2-years-reveals-humungous-cost-of-battery-replacement/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/tata-nexon-ev-battery-cost-featured.jpg","publishedAt":"2022-07-12T10:22:09Z","content":"Tata Nexon EV has become the largest selling electric car in the Indian market by a big margin. Tata even introduced the new Nexon EV Max with a longer driving range. People wanting to buy Tata Nexon… [+2431 chars]"},{"source":{"id":null,"name":"Cardekho.com"},"author":"Rohit","title":"Tata Nexon, Hyundai Venue, Kia Sonet: Top Finishers In Sub-4m SUV June 2022 Sales - CarDekho","description":"While the segment registered total sales of over 50,000 units, only two models could breach the 10,000-unit sales mark  The sub-4m SUV segment has once again witnessed healthy demand from buyers, as indicated by the June 2022 sales numbers. With eight models …","url":"https://www.cardekho.com/india-car-news/tata-nexon-hyundai-venue-kia-sonet-top-finishers-in-sub4m-suv-june-2022-sales-29373.htm","urlToImage":"https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29372/1657620278192/GeneralNews.jpg","publishedAt":"2022-07-12T09:43:00Z","content":"Renault-Nissans sub-4m SUV duo, the Kiger and Magnite, took the last two places, as they failed to cross the 3,500 unit sales mark. That said, the Kiger registered a massive jump of nearly 150 per ce… [+20 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Livemint","title":"Lessons for Gautam Adani’s 5G play from Mukesh Ambani’s 2010 telecom entry | Mint - Mint","description":"Apart from Adani, Airtel, Jio and Vodafone Idea are also in fray for 5G auction","url":"https://www.livemint.com/news/india/lessons-for-gautam-adani-s-5g-play-from-mukesh-ambani-s-2010-telecom-entry-11657606630660.html","urlToImage":"https://images.livemint.com/img/2022/07/12/600x338/india_5g_1657609862449_1657609862659_1657609862659.jpg","publishedAt":"2022-07-12T08:28:23Z","content":"Gautam Adanis plan to bid for 5G airwaves is possibly a larger telecommunications play by Asias richest person, according to analysts at Jefferies Financial Group Inc., who see uncanny similarities\" … [+2922 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Soumyarendra Barik","title":"Why Unacademy is ending IPL sponsorship ahead of future IPO listing - The Indian Express","description":"The party has begun to wind down for many startup companies and Unacademy wants to turn cash flow positive ahead of an IPO within two years.","url":"https://indianexpress.com/article/explained/unacademy-initial-public-offering-ipl-sponsorship-8024338/","urlToImage":"https://images.indianexpress.com/2022/07/unacademy-1.jpeg","publishedAt":"2022-07-12T08:28:21Z","content":"In a bid to achieve profitability ahead of a potential public listing at some point over the next two years, edtech startup Unacademy has announced a slew of cost-cutting measures, including the disc… [+2782 chars]"},{"source":{"id":null,"name":"News18"},"author":"Business Desk","title":"RBI's Decision On Cross-Border Trade in Rupee: What Is The New System, How Will It Help? - News18","description":"Banks will need RBI's approval from the RBI's foreign exchange department to use the new system","url":"https://www.news18.com/news/business/rbis-decision-on-cross-border-trade-in-rupee-what-is-the-new-system-how-will-it-help-5537917.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/rbi1-165467249616x9.jpg","publishedAt":"2022-07-12T08:19:00Z","content":"The Reserve Bank of Indias (RBI) latest decision to allow rupee transactions in international trade will help in subsiding price pressures and strengthen Indias presence in the global market. Herere … [+3061 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET CONTRIBUTORS","title":"As Covid sales spike ebbs, what lies ahead for pharma companies? - Economic Times","description":"Indian pharmaceutical market flattened after the pandemic led to a massive upsurge in demand for drugs. The industry saw a rise in sales during the Covid spike but that settled down as the number of coronavirus cases came down, except for Q1FY2022, where the …","url":"https://economictimes.indiatimes.com/markets/stocks/news/can-pli-china-plus-one-keep-indias-pharma-sector-in-pink-of-health/articleshow/92797725.cms","urlToImage":"https://img.etimg.com/thumb/msid-92798141,width-1070,height-580/photo.jpg","publishedAt":"2022-07-12T07:48:00Z","content":"SynopsisIndian pharmaceutical market flattened after the pandemic led to a massive upsurge in demand for drugs. The industry saw a rise in sales during the Covid spike but that settled down as the nu… [+185 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Rupee Plunges To 79.65 Per Dollar In New Low, Whisker Away From 80 - NDTV Profit","description":"The rupee weakened sharply to 79.65 against the dollar as the US currency jumped to a near two decade high driven by increased safety bets on global recession fears.","url":"https://www.ndtv.com/business/rupee-today-3149218","urlToImage":"https://c.ndtvimg.com/2021-06/db8gkdio_rupee_625x300_29_June_21.jpeg","publishedAt":"2022-07-12T07:10:54Z","content":"Rupee weakens to record low of 79.57/$\r\nThe rupee weakened sharply to 79.65 against the dollar, a new intra-day record low, as the US currency jumped to a nearly two-decade high driven by increased s… [+2551 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"Vauld discloses shortfall of $70 million in letter to creditors - Moneycontrol","description":"The crypto lender has said the main factors for the shortfall are mark-to-market losses on bitcoin, ether, and Polygon trades as well as exposure to the collapsed algorithmic stablecoin terraUSD, The Block has reported","url":"https://www.moneycontrol.com/news/business/vauld-discloses-shortfall-of-70-million-in-letter-to-creditors-report-8813511.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/05/Crypto-770x433.png","publishedAt":"2022-07-12T06:54:34Z","content":"Troubled crypto lender Vauld in a letter to its creditors has disclosed a shortfall of around $70 million, news website The Block has reported. The letter comes a few days after the platform stopped … [+2245 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"Ola’s Bhavish Aggarwal reveals made-in-India Li-ion cell - CarToq.com","description":"Ola Electric CEO Bhavish Aggarwal shared an image of a Li-ion battery cell. Bhavish says that it is the brand’s first indigenously developed Li-ion battery cell. However, he did not reveal any details of the new product. Our first indigenously made Li-ion cel…","url":"https://www.cartoq.com/olas-bhavish-aggarwal-reveals-made-in-india-li-ion-cell/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/03/ola-five-minute-charge.jpg","publishedAt":"2022-07-12T06:31:19Z","content":"Ola Electric CEO Bhavish Aggarwal shared an image of a Li-ion battery cell. Bhavish says that it is the brand’s first indigenously developed Li-ion battery cell. However, he did not reveal any detail… [+2734 chars]"},{"source":{"id":null,"name":"News18"},"author":"Business Desk","title":"PM Modi to Inaugurate SGX Nifty Futures Trading At GIFT City; Know Details - News18","description":"The trading of the Nifty futures contracts on the Singapore Exchange (SGX) will begin at International Financial Service Centre (IFSC) in Gandhinagar. Know details","url":"https://www.news18.com/news/business/markets/pm-modi-to-inaugurate-sgx-nifty-futures-trading-at-gift-city-know-details-5536909.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/07/untitled-design-2022-07-10t173106.713-165745451516x9.jpg","publishedAt":"2022-07-12T06:22:00Z","content":"The Nifty futures contracts trading on the Singapore Exchange (SGX) will begin at International Financial Service Centre (IFSC) in Gandhinagar from Friday onwards. Prime Minister Narendra Modi will l… [+3626 chars]"}]}