{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Livemint"},"author":"Livemint","title":"HDFC-HDFC Bank merger gets a thumbs up from stock exchanges | Mint - Mint","description":"Earlier on April 4, HDFC Bank announced that parent HDFC will merge with the bank to enable seamless delivery of home loans and leverage on the large base of over 68 million customers of HDFC Bank and inter alia improve the pace of credit growth in the econom…","url":"https://www.livemint.com/companies/news/hdfchdfc-bank-merger-gets-a-thumbs-up-from-stock-exchanges-11656840849272.html","urlToImage":"https://images.livemint.com/img/2022/07/03/600x338/HDFC_1656618642184_1656840939063.jpg","publishedAt":"2022-07-03T09:36:43Z","content":"HDFC Bank and parent HDFC inched closer to the merger process as stock exchanges give thumbs up to their amalgamation scheme. The companies received 'observation letters' from stock exchanges, BSE, a… [+2575 chars]"},{"source":{"id":null,"name":"GaadiWaadi.com"},"author":"Surendhar M","title":"2022 Suzuki Hayabusa Gains Minor Updates With 21 Colour Options - GaadiWaadi.com","description":"Suzuki has released 18 special colours for the flagship Hayabusa in Japan and customers can choose the option based on their liking","url":"https://gaadiwaadi.com/2022-suzuki-hayabusa-gains-minor-updates-with-21-colour-options/","urlToImage":"https://gaadiwaadi.com/wp-content/uploads/2022/07/2022-suzuki-hayabusa-special-colours-1.jpg","publishedAt":"2022-07-03T09:27:25Z","content":"Suzuki Motor has announced a mild update for the flagship Hayabusa as new colour schemes can now be had as an option. The famed Peregrine falcon is already sold with three paint choices as standard: … [+1972 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Cartoq Hindi","title":"Custom built Royal Enfield Classic 350 from Neev Motorcycles is called 'Divine' - CarToq.com","description":"Royal Enfield motorcycles are quite popular among motorists in India and around the world. These retro looking modern motorcycles have a large fan base and over the years, Royal Enfield has improved the motorcycle in terms of build quality, refinement and eve…","url":"https://www.cartoq.com/custom-built-royal-enfield-classic-350-from-neev-motorcycles/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/royal-enfield-divine-featured.jpg","publishedAt":"2022-07-03T08:58:19Z","content":"Royal Enfield motorcycles are quite popular among motorists in India and around the world. These retro looking modern motorcycles have a large fan base and over the years, Royal Enfield has improved … [+3100 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Sunil Shankar Matkar","title":"Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol","description":"Participants should focus on identifying stock-specific opportunities but also keep a check on leveraged trades, Ajit Mishra of Religare Broking has said","url":"https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-37-8772091.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2018/08/Sensex_Nifty_BSE_Stock-Market_traders-770x433.jpg","publishedAt":"2022-07-03T06:39:09Z","content":"The market managed to eke out moderate gains amid volatility and rangebound trade in the week ended July 1, continuing the uptrend for yet another week. Tepid global cues and caution ahead of June qu… [+7879 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Ajeesh Kuttan","title":"Tata Nexon compact SUV XZ+ (HS) variant in a detailed walkaround video - CarToq.com","description":"Tata Nexon is one of the popular sub-4 meter SUV in the segment. Tata updated the Nexon SUV couple of years ago and it now looks a lot more premium than before. In order to retain customer interest, Tata has been updating the Nexon with new features and colou…","url":"https://www.cartoq.com/tata-nexon-compact-suv-xz-hs-variant-detailed-walkaround/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/06/nexon-hs-featured.jpg","publishedAt":"2022-07-03T06:26:23Z","content":"Tata Nexon is one of the popular sub-4 meter SUV in the segment. Tata updated the Nexon SUV couple of years ago and it now looks a lot more premium than before. In order to retain customer interest, … [+2913 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"PTI","title":"Windfall tax to recoup most of Rs 1 lakh cr revenue lost in excise cuts - Economic Times","description":"For the remaining nine months of the current fiscal, the levy would get the government almost Rs 52,000 crore if the tax remains in place till March 31, 2023.On top of this, the new tax brought in on the export of petrol, diesel and ATF would bring in additio…","url":"https://economictimes.indiatimes.com/news/economy/finance/windfall-tax-to-recoup-most-of-rs-1-lakh-cr-revenue-lost-in-excise-cuts/articleshow/92629748.cms","urlToImage":"https://img.etimg.com/thumb/msid-92629791,width-1070,height-580,imgsize-38874,overlay-economictimes/photo.jpg","publishedAt":"2022-07-03T05:44:00Z","content":"The windfall tax on oil produced within India and fuel exported overseas will make up for more than three-fourths of the revenue that the government lost when it cut excise duty on petrol and diesel … [+5810 chars]"},{"source":{"id":null,"name":"Greatandhra.com"},"author":"IANS","title":"Over 22K techies lose jobs in US, more than Indian.. - Greatandhra","description":"As the tech and startup sector gets hammered by economic meltdown, more that 22,000 workers in the sector have lost jobs in 2022, along with more than 12,000 in the Indian startup ecosystem.","url":"https://www.greatandhra.com/articles/special-articles/over-22k-techies-lose-jobs-in-us-more-than-indian-122121","urlToImage":"https://www.greatandhra.com/newphotos10/jobs11656826681.jpg","publishedAt":"2022-07-03T05:38:01Z","content":"As the tech and startup sector gets hammered by economic meltdown, more that 22,000 workers in the sector have lost jobs in 2022, along with more than 12,000 in the Indian startup ecosystem.\r\nStartup… [+1664 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"Mahindra compares Scorpio N features to Fortuner features - CarToq.com","description":"Mahindra is promoting the all-new Scorpio-N as the ‘big daddy’ among all the SUVs. The Scorpio-N has all the similarly-priced compact and midsize SUVs in its crosshairs, but with the ‘big daddy’ claim, Mahindra is also eyeing pricier midsize and full-size SUV…","url":"https://www.cartoq.com/mahindra-compares-scorpio-n-features-to-fortuner-features/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/06/new-mahindra-scorpio-vs-toyota-fortuner.jpg","publishedAt":"2022-07-03T05:06:26Z","content":"Mahindra is promoting the all-new Scorpio-N as the big daddy among all the SUVs. The Scorpio-N has all the similarly-priced compact and midsize SUVs in its crosshairs, but with the big daddy claim, M… [+3047 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Online and Agencies","title":"Now, Ola Electric’s head of charging network quits; 32nd resignation in last two years - Economic Times","description":"The high-profile exits come at a time when Ola is reportedly planning its IPO this year at a lower valuation than planned earlier as several startups' IPOs have proved to be a nightmare for the investors. Ride-hailing platform Ola recently shut down its used …","url":"https://economictimes.indiatimes.com/industry/renewables/now-ola-electrics-head-of-charging-network-quits-32nd-resignation-in-last-two-years/articleshow/92628834.cms","urlToImage":"https://img.etimg.com/thumb/msid-92628847,width-1070,height-580,imgsize-359506,overlay-economictimes/photo.jpg","publishedAt":"2022-07-03T04:41:00Z","content":"Another top executive at Ola Electric has resigned from his position - the 32nd resignation from the firm in the last two years. According to ETAuto, Yashwant Kumar, Senior Director and Business Head… [+1635 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Now","title":"ITC among Siddhartha Khemka’s top picks for next 12-18 months - Economic Times","description":"“The best way to participate in the market is to accumulate at every fall and on larger falls and specifically days when markets are down by 3-4%. We saw that in the previous week where markets were down 5.6% in one week and the next week it recovered almost …","url":"https://economictimes.indiatimes.com/markets/expert-view/itc-among-siddhartha-khemkas-top-picks-for-next-12-18-months/articleshow/92622210.cms","urlToImage":"https://img.etimg.com/thumb/msid-92622220,width-1070,height-580,imgsize-22936,overlay-etmarkets/photo.jpg","publishedAt":"2022-07-03T04:30:00Z","content":"There is still risk to earnings not only from the policies, but also from the impact of inflation as well as the demand, which can remain slower or lower compared to expectations. Monsoon was one big… [+7116 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"China's Great Wall Motor fires Indian employees; Forced to abandon Rs 7895 cr project - Hindustan Times","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dizsmb7k4J9E","urlToImage":null,"publishedAt":"2022-07-03T04:15:01Z","content":null},{"source":{"id":null,"name":"Bitcoin.com"},"author":null,"title":"Meta Ending Crypto Project Novi After Mark Zuckerberg Unveiled Metaverse Digital Wallet – Featured Bitcoin News - Bitcoin News","description":"Meta, formerly Facebook, has announced the ending of its crypto project Novi. Users are advised to withdraw funds as soon as possible.","url":"https://news.bitcoin.com/meta-ending-crypto-project-novi-after-mark-zuckerberg-unveiled-metaverse-digital-wallet/","urlToImage":"https://static.news.bitcoin.com/wp-content/uploads/2022/07/meta-ending-novi.jpg","publishedAt":"2022-07-03T03:01:53Z","content":"Meta Platforms, formerly Facebook, has announced the end of its crypto project Novi. Users are advised to withdraw funds as soon as possible. The announcement followed the introduction of a digital w… [+3012 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"Transport Minister Nitin Gadkari not happy with safety “double standards” of major automakers in India - CarToq.com","description":"Amidst the Union Government’s call for safer cars and making 6 airbags and Bharat NCAP safety rating tests mandatory for new cars, a few manufacturers voiced their opinions. Nitin Gadkari, Minister of Road Transport and Highways, called out the double standar…","url":"https://www.cartoq.com/transport-minister-nitin-gadkari-not-happy-with-safety-double-standards-of-major-automakers-in-india/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2021/08/Nitin-Gadkari-ethanol-featured.jpg","publishedAt":"2022-07-03T02:16:12Z","content":"Amidst the Union Government’s call for safer cars and making 6 airbags and Bharat NCAP safety rating tests mandatory for new cars, a few manufacturers voiced their opinions. Nitin Gadkari, Minister o… [+2655 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Sunil Shankar Matkar","title":"Daily Voice | Sonam Srivastava of Wright Research sees slowdown in IT, infra, but bets on auto, FMCG - Moneycontrol","description":"The mood in the market has improved in the last couple of weeks, but this could be a short-term rebound. We did see a slight easing in European inflation. While the recession in the west is more of a reality, many expect the pain to be over sooner. Neverthele…","url":"https://www.moneycontrol.com/news/business/markets/daily-voice-sonam-srivastava-of-wright-research-sees-slowdown-in-it-infra-but-bets-on-auto-fmcg-8771691.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/11/Sonam_Srivastava1280-770x433.jpg","publishedAt":"2022-07-03T02:15:36Z","content":"Sonam Srivastava, founder of Wright Research, expects some early signs of a slowdown in the quarterly earnings from next week with margin pressure intensifying in IT and infrastructure. She, however,… [+5208 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Asit Manohar","title":"Q1 results to US job data: Top 5 triggers that may dictate market next week | Mint - Mint","description":"Stock market next week: Q1FY23 earnings will start trickling next week, and everyone will be watching for any downgrades or negative commentary","url":"https://www.livemint.com/market/stock-market-news/q1-results-to-us-job-inflation-top-5-triggers-that-may-dictate-stock-market-next-week-11656750688214.html","urlToImage":"https://images.livemint.com/img/2022/07/02/600x338/PTI14-11-2020_000103B_1605496217265_1605496235680_1656750813328.jpg","publishedAt":"2022-07-03T01:55:28Z","content":"Stock market next week: In the week gone by, the Nifty consolidated within a narrow range till the expiry day. However, post-expiry a sharp cut in the heavyweight Reliance Industries resulted in a di… [+3541 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Gold rate remains same for 24 carat and 22 carat in India - Kalinga TV","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8va2FsaW5nYXR2LmNvbS9idXNpbmVzcy9nb2xkLXJhdGUtaW4taW5kaWEtcmVtYWlucy1zYW1lLWZvci0yNC1jYXJhdC1hbmQtMjItY2FyYXQtdG9kYXktOC_SAQA?oc=5","urlToImage":null,"publishedAt":"2022-07-03T01:38:34Z","content":null},{"source":{"id":null,"name":"The Indian Express"},"author":"Mohamed Thaver","title":"IT audit firm linked to ex-Mumbai CP didn't red-flag NSE server breach: CBI - The Indian Express","description":"The CBI’s investigation over the course of the last four years long had led to the arrest of former NSE managing director Chitra Ramkrishna and its former group operating officer Anand Subramanian.","url":"https://indianexpress.com/article/cities/mumbai/it-audit-firm-linked-to-ex-mumbai-cp-didnt-red-flag-nse-server-breach-cbi-8005825/","urlToImage":"https://images.indianexpress.com/2022/07/CP-3col.jpg","publishedAt":"2022-07-03T01:28:32Z","content":"The CBI, which registered a case in 2018 in the NSE co-location scam, is probing how an audit company incorporated in 2001 by Sanjay Pandey, who last week retired as Commissioner of Police, Mumbai, d… [+4094 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Ajeesh Kuttan","title":"Toyota Fortuner neatly modified to look like Legender [Video] - CarToq.com","description":"Toyota Fortuner has been present in the Indian market for almost a decade. It has created a space for itself in the segment that no other SUV has ever been able achieve. Fortuner is a 7-seater SUV which competes with cars like MG Gloster in the segment. Toyot…","url":"https://www.cartoq.com/toyota-fortuner-neatly-modified-legender/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/06/fortuner-to-legender-featured.jpg","publishedAt":"2022-07-03T01:26:31Z","content":"Toyota Fortuner has been present in the Indian market for almost a decade. It has created a space for itself in the segment that no other SUV has ever been able achieve. Fortuner is a 7-seater SUV wh… [+2790 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Rakesh Patil","title":"These 49 small-cap stocks clock 10-57% gain as market continues to consolidate - Moneycontrol","description":"In the month of June, Sensex lost 4.5 percent and Nifty50 shed 4.8 percent. While FIIs sold equities worth Rs 58,112.37 crore, DIIs bought equities worth Rs 46,599.23 crore during the month","url":"https://www.moneycontrol.com/news/business/markets/these-49-small-cap-stocks-rise-10-57-as-market-stays-into-consolidation-mode-8769571.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/07/stocks_market-stock_stock-770x433.jpg","publishedAt":"2022-07-03T01:14:00Z","content":"The Indian benchmark indices made marginal gains in a highly volatile week ended on July 1. Investors, however, remained a worried lot with the rupee plunging to historic lows, foreign investors cont… [+4623 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Bloomberg","title":"US jobs report shows resilient labour demand, policymakers brainstorm in Asia, Europe - Moneycontrol","description":"The European Central Bank will release minutes of its June deliberations, Brazil’s double-digit inflation may have ticked up again, and Canada also publishes jobs data. Monetary officials in Australia, Israel, Peru and Poland are among those forecast to keep …","url":"https://www.moneycontrol.com/news/business/economy/us-jobs-report-shows-resilient-labour-demand-policymakers-brainstorm-in-asia-europe-8771731.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/07/388867874-1-653x435.jpg","publishedAt":"2022-07-03T01:09:08Z","content":"Employers in the US probably added workers at a more moderate yet still healthy pace last month as the jobless rate held near its lowest level in decades, suggesting resilient labour demand even as t… [+5892 chars]"}]}