{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Ola And Uber In Merger Talks: Report - NDTV","description":"Indian cab aggregator Ola and Uber Technologies Inc are considering a potential merger, the Economic Times reported on Friday, citing sources familiar with the matter.","url":"https://www.ndtv.com/india-news/ola-and-uber-in-merger-talks-report-3206892","urlToImage":"https://i.ndtvimg.com/i/2016-09/ola-cabs-650-400_650x400_61473270137.jpg","publishedAt":"2022-07-29T15:43:59Z","content":"ola and Uber are in merger talks, said a media report.\r\nIndian cab aggregator Ola and Uber Technologies Inc are considering a potential merger, the Economic Times reported on Friday, citing sources f… [+185 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"Honda City, Jazz and WR-V to discontinue soon - CarToq.com","description":"Honda is one carmaker which has recently been struggling a lot, due to its outdated portfolio and lack of a potent SUV in its Indian lineup. Apart from the fifth-generation City and Amaze, the other offerings from Honda are struggling to find their foothold d…","url":"https://www.cartoq.com/honda-city-jazz-and-wr-v-to-discontinue-soon/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/honda-city-sedan-discontinue.jpg","publishedAt":"2022-07-29T15:22:30Z","content":"Honda is one carmaker which has recently been struggling a lot, due to its outdated portfolio and lack of a potent SUV in its Indian lineup. Apart from the fifth-generation City and Amaze, the other … [+2425 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Meghna Sen","title":"Yes Bank to sell 10% stake to Carlyle, Advent for ₹8,898 crore | Mint - Mint","description":"Yes Bank will raise  ₹8,898.47 crore worth equity from the two investors – Carlyle Group and Advent International","url":"https://www.livemint.com/industry/banking/yes-bank-to-sell-10-stake-in-bank-to-carlyle-advent-11659100800819.html","urlToImage":"https://images.livemint.com/img/2022/07/29/600x338/Yes_Bank__1659101130995_1659101131331_1659101131331.jpg","publishedAt":"2022-07-29T13:26:59Z","content":"Private sector lender YES Bank considered and approved proposals for private equity investment at its board meeting held on Friday. The lender will sell 10% of its stake to the Carlyle Group and Adve… [+3605 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Jayprashanth Mohanram","title":"Maruti Grand Vitara prices leak online: To be cheaper than the Hyundai Creta - CarToq.com","description":"Maruti Suzuki unveiled the Grand Vitara mid-size SUV a week ago, and is expected to officially reveal prices sometime in early September, when the actual launch will take place. Even before the official launch, prices of the Maruti Grand Vitara seem to have b…","url":"https://www.cartoq.com/maruti-grand-vitara-prices-leak-online-to-be-cheaper-than-the-hyundai-creta/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/2022-maruti-grand-vitara-colors-fb.jpg","publishedAt":"2022-07-29T12:19:44Z","content":"Maruti Suzuki unveiled the Grand Vitara mid-size SUV a week ago, and is expected to officially reveal prices sometime in early September, when the actual launch will take place. Even before the offic… [+3123 chars]"},{"source":{"id":null,"name":"Investing.com"},"author":"Investing.com","title":"Amazon, Apple, Exxon, Chevron Rise Premarket; Roku, Intel Fall By Investing.com - Investing.com","description":"Amazon, Apple, Exxon, Chevron Rise Premarket; Roku, Intel Fall","url":"https://www.investing.com/news/stock-market-news/amazon-apple-exxon-chevron-rise-premarket-roku-intel-fall-2858119","urlToImage":"https://i-invdn-com.investing.com/news/LYNXNPEC1412T_L.jpg","publishedAt":"2022-07-29T12:03:00Z","content":"Investing.com -- Stocks in focus in premarket trade on Friday, July 29th. Please refresh for updates.<li>Amazon (NASDAQ:AMZN) stock rose 11.1% after the world’s largest online retailer forecast a jum… [+1552 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"I see clearest bull market in small-cap stocks: Shankar Sharma - Moneycontrol","description":"As regards new-age stocks such as Zomato, Sharma termed them as “reverse compounders” who will keep halving one's investment after every interval.","url":"https://www.moneycontrol.com/news/business/markets/i-see-clearest-bull-market-in-small-cap-stocks-shankar-sharma-8915481.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2020/07/Shankar_Sharma-770x433.jpg","publishedAt":"2022-07-29T11:12:43Z","content":"Veteran investor Shankar Sharma believes the worst is over for stock markets in India and said the real money-making opportunity is in the smallcap segment. Stocks from this space will soon make new … [+2787 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"HDFC Q1 Result | Net profit rises 22% to Rs 3,668.82 crore, AUM grows 17% - Moneycontrol","description":"HDFC Q1 Result: The home loan lender reported loan growth of 16%, driven by individual loans that grew 19%t year-on-year on an AUM basis","url":"https://www.moneycontrol.com/news/business/earnings/hdfc-q1-result-net-profit-rises-22-to-rs-3668-82-crore-aum-grows-17-8913761.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/02/HDFC-Ltd6-770x433.jpg","publishedAt":"2022-07-29T10:29:44Z","content":"Housing Development Finance Corporation Ltd missed street estimates by a whisker, reporting a net profit of Rs 3,668.82 crore for the June quarter, an increase of 22 percent from the year-ago period,… [+2377 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"NTPC Q1 Result | Net profit rises 16% to Rs 3,444 crore; revenue jumps 44% - Moneycontrol","description":"Revenue from operations came in at Rs 43,177.14 crore, up 44.46 percent from Rs 29,888.02 crore registered in the corresponding quarter of the previous fiscal.","url":"https://www.moneycontrol.com/news/business/earnings/ntpc-q1-result-net-profit-rises-16-to-rs-3444-crore-revenue-jumps-44-8915531.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/07/NTPC-770x433.png","publishedAt":"2022-07-29T10:23:06Z","content":"Thermal power generator NTPC on July 29 reported a 15.50 percent rise in its consolidated net profit at Rs 3,977.77 crore for the quarter ended June 2022 (Q1FY23). The company had posted a profit of … [+1056 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Meghna Sen","title":"Indian Oil reports net loss of ₹1,992 crore in Q1, revenue jumps 63% | Mint - Mint","description":"Indian Oil Q1 update: The government-owned oil and gas company's revenue from operations rose 62.47% to  ₹2.51 lakh crore in the quarter under review from  ₹1.55 lakh crore in the same quarter last fiscal","url":"https://www.livemint.com/companies/company-results/indian-oil-reports-net-loss-of-1-992-in-q1-revenue-jumps-63-11659089022167.html","urlToImage":"https://images.livemint.com/img/2022/07/29/600x338/Indian_Oil_1659089135410_1659089135641_1659089135641.JPG","publishedAt":"2022-07-29T10:07:11Z","content":"State-owned Indian Oil Corporation (IOC) on Friday reported a 66.46% decline in its net profit at 1,992.53 crore for the quarter ended 30 June, 2022, as the country's top refiner sold fuel at a disco… [+26 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Jayprashanth Mohanram","title":"Ola Electric pauses scooter production citing annual maintenance - CarToq.com","description":"Ola Electric is said to have paused production at its Future Factory in Krishnagiri, Tamilnadu, citing annual maintenance. Ola Electric’s spanking new Future Factory commenced production only 8 months ago. The electric vehicle maker is said to have ceased pro…","url":"https://www.cartoq.com/ola-electric-pauses-scooter-production-citing-annual-maintenance/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2021/11/Ola-scooter-delivery-featured.jpg","publishedAt":"2022-07-29T08:59:34Z","content":"Ola Electric is said to have paused production at its Future Factory in Krishnagiri, Tamilnadu, citing annual maintenance. Ola Electric’s spanking new Future Factory commenced production only 8 month… [+2838 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Meghna Sen","title":"Sun Pharma Q1 results: Net profit jumps to ₹2,060 crore, shares surge | Mint - Mint","description":"Sun Pharma Q1 Results: Total revenue from operations increased 10.73 % year-on-year (YoY) to  ₹10,761.76 crore from  ₹9,718.74 crore","url":"https://www.livemint.com/companies/company-results/q1-results-sun-pharma-in-the-black-posts-rs-rs-2-061-crore-profit-11659083685531.html","urlToImage":"https://images.livemint.com/img/2022/07/29/600x338/Sun_Pharma_1659083903974_1659083904121_1659083904121.JPG","publishedAt":"2022-07-29T08:39:24Z","content":"India's largest drugmaker Sun Pharmaceutical Industries on Friday reported a net profit of 2,061 crore for the quarter ending 30 June, 2022 (Q1FY23), beating average profit estimate of 1,718 crore ba… [+2223 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Sunil Shankar Matkar","title":"Ashok Leyland Q1 result |Profit at Rs 68 crore, revenue up 145% - Moneycontrol","description":"Ashok Leyland Q1 result: The domestic medium and heavy commercial vehicle volume grew at 189 percent and the company's market share expanded from 27 percent to 30 percent in the June quarter","url":"https://www.moneycontrol.com/news/business/earnings/ashok-leyland-q1-result-profit-at-rs-68-crore-revenue-up-145-8914411.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2018/07/Ashok_Leyland_Logo-770x433.jpg","publishedAt":"2022-07-29T08:36:23Z","content":"Commercial vehicle maker Ashok Leyland on July 29 reported a standalone profit of Rs 68 crore for the quarter ended June 2022, against a loss of Rs 282.3 crore in the corresponding period of the last… [+1609 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"Swiggy now allows most of its employees to work from anywhere - India Today","description":"Swiggy has announced new work from anywhere policy. The company took the decision to introduce a flexible work policy analysing the team needs and taking feedback from several managers and employees.","url":"https://www.indiatoday.in/technology/news/story/swiggy-s-new-work-policy-will-force-you-to-apply-for-a-job-in-the-company-1981420-2022-07-29","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/swiggy-647x363.png?KJEg.sXLiIyvfkXAJqYOAxvtWpKEJQv_","publishedAt":"2022-07-29T08:32:55Z","content":"The last two years have been difficult for everyone because of the Covid pandemic. However, the only good thing about the pandemic was that people all around the world were allowed to work from home.… [+2141 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"ED files money laundering case against Dilip Chhabria of DC Motors - CarToq.com","description":"The Enforcement Directorate (ED) on Thursday conducted searches at premises linked to the DC Motors owner Dilip Chhabria. The searches were conducted at six premises located in Mumbai and Pune. Post the searches, the ED has registered a money laundering case …","url":"https://www.cartoq.com/ed-files-money-laundering-case-against-dilip-chhabria-of-dc-motors/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/dilip-chhabria-with-the-dc-avanti-sportscar.jpg","publishedAt":"2022-07-29T07:18:45Z","content":"The Enforcement Directorate (ED) on Thursday conducted searches at premises linked to the DC Motors owner Dilip Chhabria. The searches were conducted at six premises located in Mumbai and Pune. Post … [+2367 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Pawan Nahar","title":"Tata Steel extends gains after stock split, rises another 9% - Economic Times","description":"Investors who had the delivery of shares in their account as of June 28 were eligible for the equity dilution of the shares and the number of shares increased by 10 times, without changing the amount invested.","url":"https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-extends-gains-after-stock-split-rises-another-9/articleshow/93205201.cms","urlToImage":"https://img.etimg.com/thumb/msid-93205292,width-1070,height-580,imgsize-22530,overlay-etmarkets/photo.jpg","publishedAt":"2022-07-29T07:15:00Z","content":"New Delhi: extended its gains on Friday as it rallied another 9 per cent after the stock of the country's largest steel producer turned ex-split on the bourses.\r\nTata Steel had fixed July 29 as the r… [+1236 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"More Oil Middlemen Muscle In To Supply India With Russian Crude - NDTV","description":"India is set to get more channels to buy cheap Russian oil, with a new wave of smaller, international traders muscling into its vast market by offering barrels shunned by rivals after the invasion of Ukraine.","url":"https://www.ndtv.com/india-news/indias-new-source-of-cheaper-russian-oil-are-small-traders-3204619","urlToImage":"https://c.ndtvimg.com/2022-07/gsaf6al4_russian-oil-bloomberg_625x300_29_July_22.jpg","publishedAt":"2022-07-29T07:06:00Z","content":"The new crop of merchants was offering supplies of Russian Urals crude at discounts of about $8 a barrel\r\nIndia is set to get more channels to buy cheap Russian oil, with a new wave of smaller, inter… [+3147 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Online","title":"Reliance, Ola & Rajesh Exports sign program agreement under PLI scheme for battery manufacturing - Economic Times","description":"Reliance New Energy Limited, Ola Electric Mobility Private Limited and Rajesh Exports Limited, the three selected bidders, signed the Program Agreement under Production Linked Incentive (PLI) scheme for Advanced Chemistry Cell (ACC) Battery Storage on Thursda…","url":"https://economictimes.indiatimes.com/industry/renewables/reliance-ola-rajesh-exports-sign-program-agreement-under-pli-scheme-for-battery-manufacturing/articleshow/93204643.cms","urlToImage":"https://img.etimg.com/thumb/msid-93204712,width-1070,height-580,imgsize-85182,overlay-economictimes/photo.jpg","publishedAt":"2022-07-29T06:47:00Z","content":"Reliance New Energy Limited, Ola Electric Mobility and , the three selected bidders, signed the Program Agreement under Production Linked Incentive (PLI) scheme for Advanced Chemistry Cell () Battery… [+1708 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Priyanka Iyer","title":"PhonePe acquires Indus OS, says amicable settlement reached with Affle Global - Moneycontrol","description":"The closure of the deal comes after a long-winding legal wrangle between PhonePe and IndusOS shareholders Affle and Ventureast Fund on the valuation of IndusOS.","url":"https://www.moneycontrol.com/news/business/announcements/phonepe-acquires-indus-os-says-amicable-settlement-reached-with-affle-global-8913411.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/08/PhonePe-770x433.jpg","publishedAt":"2022-07-29T06:45:26Z","content":"Digital payments and financial services player PhonePe said on July 29 that it has completed the long pending acquisition of mobile platform OSLabs after reaching an amicable settlement with the comp… [+2635 chars]"},{"source":{"id":null,"name":"Cardekho.com"},"author":"Tarun","title":"Here Are The Top Upcoming Cars Of August 2022 - CarDekho","description":"Some important launches and EV concept unveilings are scheduled for this month  Last month we saw many important launches and unveils, and August won’t be any different. This month, we’ll be getting the prices of two new SUVs. Maruti’s also ready to launch th…","url":"https://www.cardekho.com/india-car-news/here-are-the-top-upcoming-cars-of-august-2022-29455.htm","urlToImage":"https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29454/1659060108461/GeneralNews.jpg","publishedAt":"2022-07-29T06:18:00Z","content":"Last month we saw many important launches and unveils, and August wont be any different. This month, well be getting the prices of two new SUVs. Marutis also ready to launch the new generation of its… [+4231 chars]"},{"source":{"id":null,"name":"Team-BHP"},"author":"Tushar Kelshikar","title":"Production-spec Mahindra XUV400 electric SUV spied - Team-BHP","description":"The all-electric version of the Mahindra XUV300 has been spotted in its close-to-production form. The electric SUV is expected to be called XUV400 and could be launched in early 2023. While the electric version looks similar to the XUV300, it will have a few …","url":"https://www.team-bhp.com/news/production-spec-mahindra-xuv400-electric-suv-spied","urlToImage":"https://www.team-bhp.com/sites/default/files/styles/large/public/77C012C815784C5DA61D4FDC0E4853CE.jpeg","publishedAt":"2022-07-29T06:12:18Z","content":"The all-electric version of the Mahindra XUV300 has been spotted in its close-to-production form. The electric SUV is expected to be called XUV400 and could be launched in early 2023.\r\nWhile the elec… [+796 chars]"}]}