{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Moneycontrol"},"author":"Rakesh Patil","title":"Closing Bell: Nifty ends below 16,000, Sensex falls 372 pts; FMCG, pharma, metals shine - Moneycontrol","description":"Among sectors, FMCG, metal and pharma indices ended with nearly a percent gain, while oil &amp; gas and power index down 1 percent each.","url":"https://www.moneycontrol.com/news/business/markets/share-market-live-updates-stock-market-today-july-13-latest-news-bse-nse-sensex-nifty-covid-coronavirus-mindtree-tata-metaliks-hcl-technologies-delta-corp-care-ratings-lesha-industries-anand-rathi-8818391.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/07/sensex_nifty_sensexdown-770x433.jpg","publishedAt":"2022-07-13T10:27:59Z","content":"July 13, 2022 / 03:35 PM IST\r\nMarket Close: Benchmark indices ended lower for the third consecutive session on July 13 with Nifty closing below 16,000.\r\nAt close, the Sensex was down 372.46 points or… [+546 chars]"},{"source":{"id":null,"name":"Carandbike.com"},"author":null,"title":"2022 Hyundai Tucson Unveiled In India, Launch On August 4, 2022 - carandbike","description":"India-spec new-gen Tucson will be available with a pair of 2.0-litre petrol and diesel engines paired with automatic gearboxes as standard.","url":"https://www.carandbike.com/news/2022-hyundai-tucson-unveiled-in-india-3200460","urlToImage":null,"publishedAt":"2022-07-13T10:16:29Z","content":"Hyundai has unveiled the India-spec new-gen Tucson ahead of its launch on August 4, 2022. Like its predecessor the new Tucson is available with both petrol and diesel engine options and also gets the… [+3676 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Bloomberg","title":"Front-running Scandal rocks a $31 billion Indian investing giant - Moneycontrol","description":"Axis Asset Management Co., which is India’s seventh largest mutual fund manager and partly owned by Schroders, in May sacked two employees, including its chief dealer, amid an ongoing internal probe.","url":"https://www.moneycontrol.com/news/business/front-running-scandal-rocks-a-31-billion-indian-investing-giant-8821041.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/08/rupee_dollar-770x433.jpg","publishedAt":"2022-07-13T08:22:04Z","content":"A sprawling regulatory probe thats ensnared the Indian partner of Schroders Plc is roiling one of the nations largest asset managers and is poised to shake up Indias $465 billion mutual fund industry… [+8083 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Online","title":"DRI detects customs duty evasion of Rs 4,389 cr by Oppo India - Economic Times","description":"According to a PIB press release, during the course of investigation, searches were conducted by DRI at the office premises of Oppo India and residences of its key management employees. This led to the recovery of incriminating evidence indicating wilful mis-…","url":"https://economictimes.indiatimes.com/industry/cons-products/electronics/dri-detects-customs-duty-evasion-of-rs-4389-cr-by-oppo-india/articleshow/92846953.cms","urlToImage":"https://img.etimg.com/thumb/msid-92846979,width-1070,height-580,imgsize-28632,overlay-economictimes/photo.jpg","publishedAt":"2022-07-13T07:31:00Z","content":"The Directorate of Revenue Intelligence (DRI) on Wednesday detected Customs duty evasion of nearly Rs 4,389 crore by Oppo India. \r\nAccording to a PIB press release, during the course of investigation… [+760 chars]"},{"source":{"id":null,"name":"Team-BHP"},"author":"Tushar Kelshikar","title":"Nissan Magnite Red Edition launched at Rs. 7.87 lakh - Team-BHP","description":"Nissan has announced the launch of the Magnite Red Edition. The crossover is available with 1.0-litre petrol and turbo-petrol engines with prices starting at Rs. 7,86,500 (ex-showroom). The Magnite Red Edition gets red accents on the front grille, front bumpe…","url":"https://www.team-bhp.com/news/nissan-magnite-red-edition-launched-rs-787-lakh","urlToImage":"https://www.team-bhp.com/sites/default/files/styles/large/public/Nissan India commences bookings for Nissan Magnite RED Edition (1).jpg","publishedAt":"2022-07-13T07:11:43Z","content":"The Magnite Red Edition is available in three variants - XV MT, XV Turbo MT and XV Turbo CVT.\r\nNissan has announced the launch of the Magnite Red Edition. The crossover is available with 1.0-litre pe… [+1124 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Jash Kriplani","title":"Edelweiss NFO Review | Fund to focus on brands, market share leaders and gainers, innovators - Moneycontrol","description":"The focused equity fund will invest in 25-30 stocks and take concentrated exposures within three investment themes","url":"https://www.moneycontrol.com/news/business/personal-finance/edelweiss-nfo-review-fund-to-focus-on-brands-market-share-leaders-and-gainers-innovators-8820001.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/07/sensex_nifty_stocknew1-770x431.jpg","publishedAt":"2022-07-13T06:59:05Z","content":"Edelweiss MF has launched a focused equity fund, which is first equity fund by the fund house after a gap of around two years. It will be managed by Edelweiss MF Chief Investment Officer Trideep Bhat… [+3576 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Ajeesh Kuttan","title":"Maruti teases front-end of Grand Vitara in a new teaser video - CarToq.com","description":"Maruti Suzuki is all set for the launch of their brand new mid-size SUV Grand Vitara in India. The manufacturer has been teasing us with several videos and images recently. Pre-bookings for the upcoming Grand Vitara has already started and customers can pre-b…","url":"https://www.cartoq.com/maruti-teases-front-end-of-grand-vitara-in-a-new-teaser-video/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/grand-vitara-front-featured.jpg","publishedAt":"2022-07-13T06:28:38Z","content":"Maruti Suzuki is all set for the launch of their brand new mid-size SUV Grand Vitara in India. The manufacturer has been teasing us with several videos and images recently. Pre-bookings for the upcom… [+3183 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":null,"title":"Euro clings to parity as markets await U.S. inflation data - Reuters","description":"The euro hovered a whisker above parity to the dollar on Wednesday, with traders wary of the single currency being forced to levels unseen for decades if U.S. inflation data, due to be released later in the global day, shows a sky-high reading.","url":"https://www.reuters.com/markets/europe/euro-clings-parity-traders-wait-us-inflation-2022-07-13/","urlToImage":"https://www.reuters.com/resizer/1sgX70dvHVRLXY3oIbyVQqoXqgc=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/JBBWVPJPJJMMBOZ5GVJUXYY5GQ.jpg","publishedAt":"2022-07-13T05:37:00Z","content":"SINGAPORE, July 13 (Reuters) - The euro hovered a whisker above parity to the dollar on Wednesday, with traders wary of the single currency being forced to levels unseen for decades if U.S. inflation… [+3333 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Ajeesh Kuttan","title":"Mahindra Scorpio Classic compared with all-new Scorpio N on video - CarToq.com","description":"Mahindra launched their brand new SUV Scorpio N recently. Mahindra launched the SUV at an attractive price tag and the price for all the automatic variants will be announced soon. Mahindra Scorpio N will be sold along with the original Scorpio or the Scorpio …","url":"https://www.cartoq.com/mahindra-scorpio-classic-compared-vs-all-new-scorpio-n/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/07/scorpio-comparison-featured.jpg","publishedAt":"2022-07-13T05:12:18Z","content":"Mahindra launched their brand new SUV Scorpio N recently. Mahindra launched the SUV at an attractive price tag and the price for all the automatic variants will be announced soon. Mahindra Scorpio N … [+2861 chars]"},{"source":{"id":null,"name":"Gadgets Now"},"author":null,"title":"Read CEO Sundar Pichai's letter to employees on Google slowing down hiring - Gadgets Now","description":"Google CEO Sundar Pichai has reportedly told employees that the company is \"slowing down the pace of hiring for the rest of the year.\" Pichai said this in a company-wide email addressed to all Googlers, as Google employees are called. The internal memo first …","url":"https://www.gadgetsnow.com/tech-news/read-ceo-sundar-pichais-letter-to-employees-on-google-slowing-down-hiring/articleshow/92843325.cms","urlToImage":"https://static.toiimg.com/thumb/resizemode-4,msid-92843325,imgsize-48034,width-800/92843325.jpg","publishedAt":"2022-07-13T05:06:00Z","content":"Google CEO Sundar Pichai has reportedly told employees that the company is \"slowing down the pace of hiring for the rest of the year.\" Pichai said this in a company-wide email addressed to all Google… [+3113 chars]"},{"source":{"id":null,"name":"Analytics Insight"},"author":null,"title":"Dogecoin is Trading 78,000% Above its All-Time Lows Amidst the Crypto Bloodbath - Analytics Insight","description":null,"url":"https://www.analyticsinsight.net/dogecoin-is-trading-78000-above-its-all-time-lows-amidst-the-crypto-bloodbath/","urlToImage":null,"publishedAt":"2022-07-13T04:56:27Z","content":null},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Anand JC","title":"Nomura slashes India 2023 GDP forecast to 4.7% as it expects a growth slowdown - Economic Times","description":"As worries of recession pick up across the world in an inflationary environment, analysts at Nomura have cut India's 2023 growth forecast to 4.7% from 5.4% earlier as it expects growth to slow down over the next year. For FY23, they see GDP growth at 7.0% and…","url":"https://economictimes.indiatimes.com/news/economy/indicators/nomura-slashes-india-2023-gdp-forecast-to-4-7-as-it-expects-a-growth-slowdown/articleshow/92842552.cms","urlToImage":"https://img.etimg.com/thumb/msid-92842882,width-1070,height-580,imgsize-43050,overlay-economictimes/photo.jpg","publishedAt":"2022-07-13T04:50:00Z","content":"As worries of recession pick up across the world in an inflationary environment, analysts at Nomura have cut India's 2023 growth forecast to 4.7% from 5.4% earlier as it expects growth to slow down o… [+2621 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Auto Desk","title":"New-gen Royal Enfield Bullet 350 spotted fully undisguised - HT Auto","description":"The new-gen Royal Enfield Bullet 350 is likely to be launched in India after the Hunter 350.","url":"https://auto.hindustantimes.com/auto/two-wheelers/newgen-royal-enfield-bullet-350-spotted-fully-undisguised-41657684489353.html","urlToImage":"https://images.hindustantimes.com/auto/img/2022/07/13/1600x900/Royal_Enfield_1657685989435_1657686009601_1657686009601.JPG","publishedAt":"2022-07-13T04:42:43Z","content":"While Royal Enfield prepares for the launch of the Hunter 350 next month, the company's upcoming new-gen Bullet 350 has now been spotted undisguised indicating that it could be next in the pipeline r… [+1650 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Harsha Jethmalani","title":"Q1 results of HCL and TCS have some worrying similarities | Mint - Mint","description":"HCL's Ebit margin at 17% declined 100 basis points (bps) sequentially, and was at a multi-quarter low. Also, it was below consensus estimate of 17.6%. TCS also missed consensus margin estimates. At 23.1% TCS' Ebit margin hit a multi-year low","url":"https://www.livemint.com/market/mark-to-market/q1-results-of-hcl-and-tcs-have-some-worrying-similarities-11657686418724.html","urlToImage":"https://images.livemint.com/img/2022/07/13/600x338/HCL_Technologies_1642156340919_1657686950994_1657686950994.jpg","publishedAt":"2022-07-13T04:36:52Z","content":"In fact, there are worrying similarities between the two.\r\n First and foremost, HCL's Ebit margin at 17% declined 100 basis points (bps) sequentially, and was at a multi-quarter low. Also, it was bel… [+2009 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Dinesh Unnikrishnan","title":"RBI's desperate catch-up act on inflation will hurt economy - Moneycontrol","description":"It isn’t an exaggeration to say the RBI let loose the inflation genie for too long, in search of a stimulus-led growth. It is now playing catch-up with steep, consecutive rate hikes","url":"https://www.moneycontrol.com/news/business/rbis-desperate-catch-up-act-on-inflation-will-hurt-economy-8818881.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/05/inflation-770x433.jpeg","publishedAt":"2022-07-13T04:28:52Z","content":"The government data on July 12 showed that retail inflation stayed largely unchanged at a high of 7.01 percent in June as against 7.04 percent in May. The June CPI inflation print takes average infla… [+2697 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Asit Manohar","title":"Adani Green shares surge for seventh straight session, stock rises 22% this week | Mint - Mint","description":"Adani Green share price has been rising since 6th July 2022","url":"https://www.livemint.com/market/stock-market-news/adani-green-share-surges-on-seventh-straight-session-stock-rises-20-this-week-11657683966214.html","urlToImage":"https://images.livemint.com/img/2022/07/13/600x338/Adani_1652781101937_1657684068844_1657684068844.JPG","publishedAt":"2022-07-13T03:54:34Z","content":"Adani Green Energy shares extended its rally on seventh straight day in early morning deals on Wednesday. Adani Green share price today opened upside and went on to hit intraday high of 2338 per shar… [+1936 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Now","title":"Buy selectively; 6 largecap IT and FMCG stocks to bet on: Sudip Bandyopadhyay - Economic Times","description":"“If I have to pick between midcap and largecap IT, I will go with the largecap. I see no problem in Infosys, TCS or Wipro at this stage. In FMCG, I have been positive on Hindustan Unilever and I will continue to maintain my view. I also like Dabur and Marico.…","url":"https://economictimes.indiatimes.com/markets/expert-view/buy-selectively-6-largecap-it-and-fmcg-stocks-to-bet-on-sudip-bandyopadhyay/articleshow/92831742.cms","urlToImage":"https://img.etimg.com/thumb/msid-92831731,width-1070,height-580,imgsize-49652,overlay-etmarkets/photo.jpg","publishedAt":"2022-07-13T03:31:00Z","content":"There are pockets where there are opportunities and if a client is having cash, we are recommending buying in small lots in those pockets but by and large, the advice is to be extremely cautious, say… [+7527 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"Government puts gold, silver, currency, cigarettes on controlled shipments list - Moneycontrol","description":"The revenue authority can approve a controlled delivery of import or export of such suspect shipments, with due consultation with authorities of foreign countries.","url":"https://www.moneycontrol.com/news/business/government-puts-gold-silver-currency-cigarettes-on-controlled-shipments-list-8818641.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/06/gold_yellow-metal__precious-metal_gold-prices-1-770x431.jpg","publishedAt":"2022-07-13T03:11:38Z","content":"The government has placed gold, silver, precious and semi-precious stones, currency, antiques and several other goods under the so-called Controlled Delivery (Customs) Regulations, 2022, for tracing … [+1184 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"These High-Value Transactions Can Invite Income Tax Notice, Check Details - NDTV Profit","description":"Certain cash transactions beyond the specified limit should be reported to the tax authorities","url":"https://www.ndtv.com/business/here-s-why-you-need-to-report-high-value-cash-transactions-in-itr-3147621","urlToImage":"https://c.ndtvimg.com/2021-02/hd824m9o_money-generic-rupees-generic_625x300_25_February_21.jpg","publishedAt":"2022-07-13T03:05:54Z","content":"Here's why you need to report high-value cash transactions in ITR\r\nThe Income Tax Department monitors high-value cash transactions beyond a specific limit. If you fail to mention such transactions in… [+2666 chars]"},{"source":{"id":null,"name":"XDA Developers"},"author":"Adam Doud","title":"Ive had enough – Apple and legendary designer officially part ways - XDA Developers","description":"Apple and LoveFrom have parted ways. Sir Jony Ive left Apple in 2019 to form LoveFrom, keeping Apple as its primary client.","url":"https://www.xda-developers.com/jony-ive-apple-terminate-contract/","urlToImage":"https://www.xda-developers.com/files/2022/05/Ivy-Cook.jpg","publishedAt":"2022-07-13T03:01:00Z","content":"Sir Jony Ive and Apple have parted waysagain. This time it looks to be more official, as Apple and Ive’s design firm, LoveFrom, have decided not to renew their contract. If all this sounds confusing … [+1746 chars]"}]}