{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Saumya Tandon raises money for Deepesh Bhan’s family to repay loan worth 50 lakh - Hindustan Times","description":"Saumya Tandon is raising funds to help late co-actor Deepesh Bhan's family. The family needs ₹50 lakh to repay their home loan after the actor's death.","url":"https://www.hindustantimes.com/entertainment/tv/saumya-tandon-raises-money-for-deepesh-bhan-s-family-to-repay-loan-worth-50-lakh-101660402286067.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/13/1600x900/deepesh_1660402789563_1660402789827_1660402789827.jpg","publishedAt":"2022-08-13T15:07:14Z","content":"Bhabi Ji Ghar Par Hai actor Saumya Tandon took to Instagram and launched an initiative to help late actor Deepesh Bhans family. She shared a video and requested people to donate and help Deepeshs fam… [+1671 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Express Web Desk","title":"Salman Rushdie stabbed, Live Updates: Rushdie told German magazine his life is now ‘relatively normal’ - The Indian Express","description":"Rajiv Gandhi’s decision to ban ‘The Satanic Verses’ was justified, says Natwar Singh; suspect had Shi'ite extremist sympathies, reports NBC New York; writers, publishers condemn attack on Rushdie, stress on upholding freedom of speech.","url":"https://indianexpress.com/article/world/salman-rushdie-stabbing-new-york-live-updates-8087417/","urlToImage":"https://images.indianexpress.com/2022/08/salman-rushdie.jpg","publishedAt":"2022-08-13T14:31:26Z","content":"Yes, I would write The Satanic Verses again.That was Salman Rushdie in January 2013, in The Indian Express, where he had dropped by for Idea Exchange, the newsrooms weekly interaction with newsmakers… [+993 chars]"},{"source":{"id":null,"name":"PINKVILLA"},"author":"Himesh Mankad","title":"Mirroring The Industry: The curious case of rising actor fees and bubble around industry positioning of stars - PINKVILLA","description":"Some actors have doubled and tripled their prices sitting at home in the pandemic. They didn2019t sell a single ticket in the pandemic, but hiked their price based on social media appreciation and OTT numbers - An insight into the real picture of Hindi Film I…","url":"https://www.pinkvilla.com/entertainment/exclusives/mirroring-industry-curious-case-rising-actor-fees-and-bubble-around-industry-positioning-stars-1176325","urlToImage":"https://www.pinkvilla.com/files/styles/fbimagesection/public/actor-remuneration-social.jpg?itok=B_qOltIb","publishedAt":"2022-08-13T13:33:03Z","content":"Bollywood is going through a rough phase – the sooner we accept it, the better it will be. The industry is churning out projects in the name of films – budgets being decided based on the value of var… [+6201 chars]"},{"source":{"id":null,"name":"PINKVILLA"},"author":"Himesh Mankad","title":"EXCLUSIVE: Akshay Kumar returns as Jagdishwar Mishra in Jolly LLB 3; Filming begins 2023 - PINKVILLA","description":"Jolly LLB 3 will be produced by Star Studios with Subhash Kapoor as the director. The script is locked and team is targetting to go on floors by Mid-2023. More details","url":"https://www.pinkvilla.com/entertainment/exclusives/exclusive-akshay-kumar-returns-jagdishwar-mishra-jolly-llb-3-filming-begins-2023-1176237","urlToImage":"https://www.pinkvilla.com/files/styles/fbimagesection/public/jolly-llb-3-social.jpg?itok=CtaC0Sy4","publishedAt":"2022-08-13T11:47:43Z","content":"Akshay Kumar’s filmography is loaded with iconic characters that have the potential of being spun into a franchise. Be it Raju from Hera Pheri, Guru Gulab Khatri from Awara Pagal Deewana, Mac from Ga… [+2110 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Salman Rushdie On Ventilator After Stabbing, Attacker Identified: 10 Facts - NDTV","description":"Author Salman Rushdie, who spent years in hiding after an Iranian fatwa ordered his killing, was on a ventilator and could lose an eye following a stabbing attack at a literary event in New York state on Friday.","url":"https://www.ndtv.com/world-news/salman-rushdie-author-salman-rushdie-on-ventilator-after-stabbing-attacker-identified-3250726","urlToImage":"https://c.ndtvimg.com/2022-08/f41ntd4_rushdie_625x300_13_August_22.jpg","publishedAt":"2022-08-13T11:39:00Z","content":"<li>The British author of \"The Satanic Verses\", which sparked fury among some Muslims who believed it was blasphemous, had to be airlifted to hospital for emergency surgery following the attack.\r\n</l… [+2425 chars]"},{"source":{"id":null,"name":"Bollywood Hungama"},"author":"Bollywood Hungama","title":"Laal Singh Chaddha Box Office: Film becomes Aamir Khan’s third film in past 10 years to see dip in business on Day 2 - Bollywood Hungama","description":"Laal Singh Chaddha Box Office: Film becomes Aamir Khan’s third film in past 10 years to see dip in business on Day 2. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood…","url":"https://www.bollywoodhungama.com/news/box-office-special-features/laal-singh-chaddha-box-office-film-becomes-aamir-khans-third-film-past-10-years-see-dip-business-day-2/","urlToImage":"https://stat1.bollywoodhungama.in/wp-content/uploads/2022/08/Laal-Singh-Chaddha-Box-Office-Film-becomes-Aamir-Khan’s-third-film-in-past-10-years-to-see-dip-in-business-on-Day-2.jpg","publishedAt":"2022-08-13T11:26:18Z","content":"Collecting Rs. 7.26 cr on its second day running, Laal Singh Chaddha witnessed a drop of nearly 38% from its opening day collections. This drop in business is being attributed to the fact that Friday… [+2193 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Ameesha Patel's Throwback Gold With Aishwarya Rai Bachchan - NDTV Movies","description":"\"The beautiful Aishwarya Rai Bachchan n me as chief guests at a show cracking up on some silly joke,\" wrote Ameesha Patel","url":"https://www.ndtv.com/entertainment/ameesha-patels-throwback-gold-with-aishwarya-rai-bachchan-3251661","urlToImage":"https://c.ndtvimg.com/2022-08/du8tr1gg_aish_625x300_13_August_22.jpg","publishedAt":"2022-08-13T11:04:17Z","content":"Ameesha Patel shared this picture (courtesy: ameeshapatel9)\r\nAs promised, Ameesha Patel has shared another throwback picture, and this time she's with Aishwarya Rai Bachchan when both attended an eve… [+1363 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Entertainment Desk","title":"Akshay Kumar opens up about his citizenship, says he has a Canadian passport: 'I thought about moving there' - The Indian Express","description":"Actor Akshay Kumar shared that he holds a Canadian passport but pays all his taxes in India.","url":"https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-opens-up-about-his-citizenship-says-he-has-a-canadian-passport-8087923/","urlToImage":"https://images.indianexpress.com/2022/08/Akshay-Kumar-1.jpg","publishedAt":"2022-08-13T09:01:50Z","content":"Actor Akshay Kumar, who has had a string of flops this year with Raksha Bandhan, Samrat Prithviraj and Bachchhan Paandey, was recently asked about his citizenship in an interview. Akshay is often tro… [+2746 chars]"},{"source":{"id":null,"name":"Bollywood Hungama"},"author":"Bollywood Hungama","title":"Uorfi Javed lashes out at Mukesh Khanna after he claimed that Indian women asking for sex are prostitutes - Bollywood Hungama","description":"Uorfi Javed lashes out at Mukesh Khanna after he claimed that Indian women asking for sex are prostitutes. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi…","url":"https://www.bollywoodhungama.com/news/bollywood/uorfi-javed-lashes-mukesh-khanna-claimed-indian-women-asking-sex-prostitutes/","urlToImage":"https://stat2.bollywoodhungama.in/wp-content/uploads/2022/08/uorfimukesh620.jpg","publishedAt":"2022-08-13T08:53:11Z","content":"Uorfi Javed has become a social media celebrity with her unique outfits and candid takes on everything. She decided to show her feminist side after Mukesh Khanna made some rather sexist statements in… [+2748 chars]"},{"source":{"id":null,"name":"Koimoi"},"author":"Koimoi.com Team","title":"Lock Upp Fame Anjali Arora's MMS Leak Controversy Heats Up As She Again Gets Trolled For Her Reaction, Netizens Say \"Leak Hone Ke Baad Bhi Confidence...\" - Koimoi","description":"Amid the MMS leak, Lock Upp Fame Anjali Arora is now getting trolled as netizens are calling her out for overacting. Read on","url":"https://www.koimoi.com/television/lock-upp-fame-anjali-aroras-mms-leak-controversy-heats-up-as-she-again-gets-trolled-for-her-reaction-netizens-say-leak-hone-ke-baad-bhi-confidence/","urlToImage":"https://static-koimoi.akamaized.net/wp-content/new-galleries/2022/08/lock-upp-fame-anjali-arora-trolled-for-overacting-amid-her-alleged-mms-leak-001.jpg","publishedAt":"2022-08-13T08:40:46Z","content":"Lock Upp Fame Anjali Arora Gets Brutally Trolled For ‘Overacting’ While She Celebrated The Success Of Her Song(Photo CreditInstagram)\r\nAnjali Arora rose to fame after her Instagram reel dancing on Ka… [+2929 chars]"},{"source":{"id":null,"name":"123telugu.com"},"author":null,"title":"Date & Time locked for the massive Salaar update | 123telugu.com - 123telugu","description":"PAN India star Prabhas fans are eagerly waiting for the film Salaar. Billed to be a heavy action thriller, the film is directed by KGF sensation Prasanth Neel. As two of the biggest mass forces are jo","url":"https://www.123telugu.com/mnews/date-time-locked-for-the-massive-salaar-update.html","urlToImage":"https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif","publishedAt":"2022-08-13T08:31:00Z","content":"PAN India star Prabhas fans are eagerly waiting for the film Salaar. Billed to be a heavy action thriller, the film is directed by KGF sensation Prasanth Neel. As two of the biggest mass forces are j… [+578 chars]"},{"source":{"id":null,"name":"Bollywood Life"},"author":"Urmimala Banerjee","title":"Karan Mehra-Nisha Rawal marital crisis: Kashmera Shah supports the Yeh Rishta Kya Kehlata Hai star; calls him - Bollywood Life","description":"Karan Mehra-Nisha Rawal marital crisis: Kashmera Shah comes out in support of the Yeh Rishta Kya Kehlata Hai actor reveals how she sensed some flaws in the domestic violence charge of Nisha Rawal. Also talks about the alleged boyfriend, Rohit Sathia.","url":"https://www.bollywoodlife.com/photos/karan-mehra-nisha-rawal-marital-crisis-kashmera-shah-supports-the-yeh-rishta-kya-kehlata-hai-star-calls-him-innocent-hints-at-loopholes-in-the-domestic-violence-charge-and-more-entertainment-news-2155293/","urlToImage":"https://st1.bollywoodlife.com/wp-content/uploads/2022/08/MicrosoftTeams-image-1760-600x315.jpg","publishedAt":"2022-08-13T08:30:54Z","content":"Some days back, Karan Mehra in a press conference exposed his estranged wife Nisha Rawal's alleged affair with Rohit Sathia, who is supposed to be her Rakhi brother. He discussed details of their aff… [+317 chars]"},{"source":{"id":null,"name":"Bollywood Hungama"},"author":"Bollywood Hungama","title":"Raksha Bandhan Overseas Box Office: Registers nearly 100% growth at Australia and New Zealand box office on Day 2 - Bollywood Hungama","description":"Raksha Bandhan Overseas Box Office: Registers nearly 100% growth at Australia and New Zealand box office on Day 2. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood Ne…","url":"https://www.bollywoodhungama.com/news/box-office-special-features/raksha-bandhan-overseas-box-office-registers-nearly-100-growth-australia-new-zealand-box-office-day-2/","urlToImage":"https://stat1.bollywoodhungama.in/wp-content/uploads/2022/08/Raksha-Bandhan-Overseas-Box-Office-Registers-nearly-100-growth-at-Australia-and-New-Zealand-box-office-on-Day-2.jpg","publishedAt":"2022-08-13T08:30:34Z","content":"In this box office report, we look at the collections of Raksha Bandhan in the overseas markets on Day 1 and 2 respectively.\r\nAustralia box officeDay 1 - 7,373 USD [Rs. 5.87 lacs] from 43 screensDay … [+187 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":"NDTV Sports Desk","title":"When Dhawan Met Dhawan: Bollywood Star's \"Boy In A Candy Shop\" Moment - NDTV Sports","description":"Bollywood actor Varun Dhawan on Saturday shared pictures with India opening batter Shikhar Dhawan and the rest of the Indian team","url":"https://sports.ndtv.com/zimbabwe-vs-india-2022/when-dhawan-met-dhawan-bollywood-stars-boy-in-a-candy-shop-moment-3251163","urlToImage":"https://c.ndtvimg.com/2022-08/qe97umto_shikhar-dhawan-varun-dhawan-twitter-_625x300_13_August_22.jpg","publishedAt":"2022-08-13T07:43:15Z","content":"Bollywood actor Varun Dhawan on Saturday shared pictures with India opening batter Shikhar Dhawan and the rest of the Indian team. He also joked that he was asked a couple of riddles by the Indian op… [+1549 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Liger Stars Vijay Deverakonda And Ananya Panday Remind Us Of Dilwale Dulhania Le Jayenge - NDTV Movies","description":"The two were promoting their film, Liger, in Chandigarh","url":"https://www.ndtv.com/entertainment/vijay-deverakonda-makes-our-saturday-morning-better-and-how-3251102","urlToImage":"https://c.ndtvimg.com/2022-08/tb18naao_vijay_625x300_13_August_22.jpg","publishedAt":"2022-08-13T07:27:51Z","content":"Vijay Deverakonda shared this picture. (courtesy: thedeverakonda)\r\nVijay Deverakonda and Ananya Panday are on a promotional spree for their much-awaited film Liger. The duo has been vising numerous c… [+1400 chars]"},{"source":{"id":null,"name":"Thehansindia.com"},"author":"The Hans India","title":"Karthikeya 2 Movie Review and Release Day LIVE UPDATES: Karthikeya 2 Grand Release Today - The Hans India","description":"It is all known that Tollywoods young actors Nikhil and Anupama are all set to take the audience to...","url":"https://www.thehansindia.com/live-updates/karthikeya-2-movie-review-and-release-day-live-updates-karthikeya-2-grand-release-today-757577","urlToImage":"https://assets.thehansindia.com/h-upload/2021/09/03/1105769-kartikeya2.jpg","publishedAt":"2022-08-13T07:17:42Z","content":null},{"source":{"id":null,"name":"News18"},"author":"Buzz Staff","title":"Tom Cruise at 60 vs Mammootty at 70: Facebook Users Spar Over Who's Fitter - News18","description":"Both Tom Cruise and Mammootty continue to be at incredible physical shape at the age of 60 and 70 respectively.","url":"https://www.news18.com/news/buzz/tom-cruise-at-60-vs-mammootty-at-70-facebook-users-spar-over-whos-fitter-5744041.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/tom-cruise-mammootty-166037387916x9.png","publishedAt":"2022-08-13T07:08:04Z","content":"Tom Cruise vs Mammootty might make for a good Mission Impossible movie but for the time being, the brawl is happening in the comment section of a Facebook post. Both the Hollywood sensation and the M… [+2031 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Naga Chaitanya says he got caught by police while making out with a girl in car - Hindustan Times","description":"Naga Chaitanya has revealed an old incident during a recent interview. He said that he was caught by police while he was making out with a girl.","url":"https://www.hindustantimes.com/entertainment/telugu-cinema/naga-chaitanya-says-he-got-caught-by-police-while-making-out-with-a-girl-in-car-101660370004067.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/13/1600x900/h_upLfUz_400x400_1660370172865_1660370184526_1660370184526.jpg","publishedAt":"2022-08-13T07:03:27Z","content":"Naga Chaitanya has revealed in a new interview that he was once caught while making out with a girl. Naga said that the incident happened in his car, while he was in Hyderabad. Naga has made her Boll… [+1447 chars]"},{"source":{"id":null,"name":"Sportskeeda"},"author":"Ali Akber","title":"5 things WWE SmackDown got right this week: Champion got attacked; Karrion Kross sends another warning - Sportskeeda","description":"Gunther was ready to defend his Intercontinental Championship in the main event of this week’s WWE SmackDown.","url":"https://www.sportskeeda.com/wwe/5-things-wwe-smackdown-got-right-august-12-2022","urlToImage":"https://staticg.sportskeeda.com/editor/2022/08/0affe-16603730157340-1920.jpg","publishedAt":"2022-08-13T06:58:32Z","content":"Gunther was ready to defend his Intercontinental Championship in the main event of this weeks WWE SmackDown. Shinsuke Nakamura was looking to dethrone The Ring General and begin another reign as the … [+6416 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Raj Kapoor pleaded with Vyajyantimala's grandma to let her to wear a swimsuit - Hindustan Times","description":"As she turns 86 on Saturday, we revisit how she got the Raj Kapoor film Sangam, and even got to wear her first swimsuit onscreen for the song Bol Radha Bol in the 1964 film. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/raj-kapoor-pleaded-with-vyajyantimala-s-grandma-to-let-her-to-wear-a-swimsuit-in-sangam-101660371718234.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/13/1600x900/sangam_raj_kapoor_vyajyantimala_1660373690588_1660373690852_1660373690852.jpg","publishedAt":"2022-08-13T06:57:01Z","content":"Bollywood's first dancing diva, Vyajyantimala, turns 86 on Saturday. A widely revered classical dancer and actor, Vyajyantimala featured in many popular films including Raj Kapoor's iconic love story… [+2591 chars]"}]}