{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Hazel Keech Is In The Gym To Get Back Her Aa Ante Body. What Husband Yuvraj Singh Commented - NDTV Movies","description":"Yuvraj and Hazel announced the arrival of their baby boy in January, this year","url":"https://www.ndtv.com/entertainment/do-not-disturb-hazel-keech-she-is-busy-doing-3227140","urlToImage":"https://c.ndtvimg.com/2022-08/rv2s2mto_hazel_625x300_05_August_22.jpg","publishedAt":"2022-08-05T08:57:03Z","content":"Hazel Keech in a still from video. (courtesy: hazelkeechofficial)\r\nNew Delhi: Do not disturb Hazel Keech, as she is busy getting her Aa Ante body back. We are not making such claims. The announcement… [+2035 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Akshay Kumar addresses criticism against his movie-minting habit - Hindustan Times","description":"Akshay Kumar asserted his commitment towards his craft and said that he takes the maximum number of holidays than any other celebrity in Bollywood. He said that his eight hours on the sets are equal to 14-15 hours of any other actor. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/akshay-kumar-addresses-criticism-against-his-movie-minting-habit-101659686174474.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/05/1600x900/akshay_1659686920132_1659686920333_1659686920333.jpg","publishedAt":"2022-08-05T08:21:05Z","content":"Actor Akshay Kumar remains one of the busiest actors with multiple projects in the pipeline throughout the year. The actor refused to slow down even since his debut in the industry. When questioned a… [+1645 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"Shocking revelations! Karan Mehra accuses estranged wife Nisha Rawal of dating a man who posed as her ‘Rakhi brother’, says they threatened to shoot me - Times of India","description":"Karan Mehra and Nisha Rawal's ugly fight keeps hitting headlines. Now, Karan held a press conference recently and made some shocking revelations including that Nisha is dating her rakhi brother Rohit Sethia. He accused Nisha of staying in his 4BHK apartment w…","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/shocking-revelations-karan-mehra-accuses-estranged-wife-nisha-rawal-of-dating-a-man-who-posed-as-her-rakhi-brother-says-they-threatened-to-shoot-me/videoshow/93365923.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/93365923/size-47678/93365923.jpg","publishedAt":"2022-08-05T07:22:07Z","content":"Karan Mehra\r\n and Nisha Rawal\r\n's ugly fight keeps hitting headlines. Now, Karan held a press conference recently and made some shocking revelations\r\n including that Nisha is dating her rakhi brother… [+854 chars]"},{"source":{"id":null,"name":"Bollywood Life"},"author":"Manisha Mandal","title":"Palak Tiwari gets body-shamed again for her black jumpsuit look; netizens call her 'mard face' and more - Bollywood Life","description":"The Bijlee Bijlee girl Palak Tiwari was seen at the airport wearing a body-hugging jumpsuit and this outfit of hers didn't get well with the trollers and they badly attacked her.","url":"https://www.bollywoodlife.com/photos/palak-tiwari-gets-body-shamed-again-for-her-black-jumpsuit-look-netizens-call-her-lizard-mard-face-and-more-entertainment-news-bollywood-heroine-2148168/","urlToImage":"https://st1.bollywoodlife.com/wp-content/uploads/2022/08/MicrosoftTeams-image-2022-08-05T115846.155-600x315.jpg","publishedAt":"2022-08-05T06:37:15Z","content":"Malaika Arora, Vaani Kapoor, Palak Tiwari and others set the ramp on fire at Bombay Times Fashion Week 2022"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"Sushmita Sen drops stunning pictures praising her 'attitude', Charu Asopa couldn't agree more - Times of India","description":"Sushmita Sen has been in the limelight after former IPL founder Lalit Modi confirmed that he is dating the former Miss Universe. Sushmita, who is known for her warm personality, is an ardent social media user who keeps treating fans with sneak peeks into her …","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/sushmita-sen-drops-stunning-pictures-praising-her-attitude-charu-asopa-couldnt-agree-more/videoshow/93364564.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/93364564/size-99316/93364564.jpg","publishedAt":"2022-08-05T06:30:48Z","content":"Sushmita Sen\r\n has been in the limelight after former IPL founder Lalit Modi\r\n confirmed that he is dating the former Miss Universe. Sushmita, who is known for her warm personality, is an ardent soci… [+675 chars]"},{"source":{"id":null,"name":"News18"},"author":"Bohni Bandyopadhyay","title":"Darlings Movie Review: Alia Bhatt, Shefali Shah, Vijay Varma Shine Bright in Netflix's Dark Comedy - News18","description":"Darlins Movie Review: Alia Bhatt, Shefali Shah and Vijay Varma's black comedy brings out laughs in tragic situations, but is ultimately a story about shattered hopes and dreams","url":"https://www.news18.com/news/movies/darlings-movie-review-alia-bhatt-shefali-shah-vijay-varma-netflix-dark-comedy-5691787.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/alia-shefali-165967160616x9.jpg","publishedAt":"2022-08-05T05:50:00Z","content":"Alia Bhatt chose a sensitive topic like domestic violence as the debut project for her production house. Instead of making a hard-hitting film on it, the story has been wrapped in the garb of a black… [+3426 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Ajay Devgn's Birthday Wish For Wife Kajol: \"When She Calls, I Pick Up\" - NDTV Movies","description":"Ajay shared a montage of glam pics of Kajol","url":"https://www.ndtv.com/entertainment/ajay-devgns-birthday-wish-for-wife-kajol-when-she-calls-i-pick-up-3226987","urlToImage":"https://c.ndtvimg.com/2022-08/2k475al_ajay-kajol_625x300_05_August_22.jpg","publishedAt":"2022-08-05T05:42:20Z","content":"Ajay Devgn with Kajol. (courtesy: ajaydevgn)\r\nNew Delhi: Ajay Devgn had a lovely birthday wish for wife Kajol on Friday. The actress is celebrating her 48th birthday today. Ajay's early morning post … [+1488 chars]"},{"source":{"id":null,"name":"Bollywood Hungama"},"author":"Bollywood Hungama","title":"SCOOP: Aamir Khan and Laal Singh Chaddha team opt for BLOCKBUSTER pricing in India - Bollywood Hungama","description":"SCOOP: Aamir Khan and Laal Singh Chaddha team opt for BLOCKBUSTER pricing in India. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News …","url":"https://www.bollywoodhungama.com/news/bollywood/scoop-aamir-khan-laal-singh-chaddha-team-opt-blockbuster-pricing-india/","urlToImage":"https://stat2.bollywoodhungama.in/wp-content/uploads/2022/08/3159e620-5056-453a-aec0-e7a6e7878141.jpg","publishedAt":"2022-08-05T05:41:04Z","content":"The countdown for the release of Laal Singh Chaddha has begun as the audience is waiting to welcome Mr. Perfectionist, Aamir Khan on the big screen after 4 long years. The advances for the film have … [+2055 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Miss Universe Harnaaz Sandhu Sued By Producer Upasana Singh Over Punjabi Film - NDTV","description":"Film producer Upasana Singh accused Harnaaz Sandhu of not honouring an agreement signed for the promotion of a Punjabi movie","url":"https://www.ndtv.com/entertainment/film-producer-moves-court-against-miss-universe-harnaaz-sandhu-3224795","urlToImage":"https://c.ndtvimg.com/2022-08/02g6eic8_harnaaz_625x300_05_August_22.jpg","publishedAt":"2022-08-05T05:31:21Z","content":"Harnaaz Sandhu shared this pic. (courtesy: harnaazsandhu_03)\r\nChandigarh: Film producer Upasana Singh on Thursday moved a local court against Miss Universe Harnaaz Sandhu, accusing her of not honouri… [+1385 chars]"},{"source":{"id":null,"name":"India.com"},"author":"Ritika Handoo","title":"Crash Course actor Annu Kapoor says `with due respect to Arundhati Roy, she has betrayed the country severa... - Zee News","description":"Veteran actor and National award-winning star Annu Kapoor, who starred in films such as Mr India, Vicky Donor, Utsav, Darr, and Shaukeen among others is best known for hosting Close-Up Antakshari for years.","url":"https://zeenews.india.com/people/crash-course-actor-annu-kapoor-says-with-due-respect-to-arundhati-roy-she-has-betrayed-the-country-several-times-2493450.html","urlToImage":"https://english.cdn.zeenews.com/sites/default/files/2022/08/05/1073598-annu-kapoor.jpg","publishedAt":"2022-08-05T05:28:09Z","content":"New Delhi: Veteran actor and National award-winning star Annu Kapoor, who starred in films such as Mr India, Vicky Donor, Utsav, Darr, and Shaukeen among others is best known for hosting Close-Up Ant… [+2565 chars]"},{"source":{"id":null,"name":"India.com"},"author":null,"title":"Deepika Padukone Turns Grace Goddess in Sheer Black Saree And Infinity Blouse - See Viral Pics - India.com","description":"Deepika Padukone looks breathtakingly gorgeous in a black saree with an infinity blouse. The actress attends an event in the city and the hearts stop when she enters the venue. Check her latest viral pictures here.","url":"https://www.india.com/photos/entertainment/deepika-padukone-turns-grace-goddess-sheer-black-saree-infinity-blouse-see-viral-pics-247920/","urlToImage":"https://st1.photogallery.ind.sh/wp-content/uploads/indiacom/deepika-padukone-looks-drop-dead-gorgeous-in-a-metallic-black-saree-see-pics-202208-1659676078-825x510.jpg","publishedAt":"2022-08-05T05:09:58Z","content":"Image credit: Viral BhayaniDeepika Padukone looks drop-dead gorgeous in a metallic black saree - see pics\r\nDeepika Padukone has her own ways to stun the internet. This time, she chose to do it by wea… [+128 chars]"},{"source":{"id":null,"name":"Bollywood Life"},"author":"Nikita Thakkar","title":"Koffee With Karan 7: Sara Ali Khan and Janhvi Kapoor's cosy pictures with ex-boyfriends go viral after Karan - Bollywood Life","description":"On Koffee With Karan 7, Karan Johar discussed about Sara Ali Khan and Janhvi Kapoor's dating lives. He mentioned that they dated siblings who live in his building.","url":"https://www.bollywoodlife.com/photos/koffee-with-karan-7-sara-ali-khan-and-janhvi-kapoors-cosy-pictures-with-ex-boyfriends-go-viral-after-karan-johars-explosive-revelation-of-them-dating-siblings-bollywood-galleries-entertainment-news-2148093/","urlToImage":"https://st1.bollywoodlife.com/wp-content/uploads/2022/08/sara-51-600x315.png","publishedAt":"2022-08-05T04:59:03Z","content":"On Koffee With Karan 7, Sara Ali Khan and Janhvi Kapoor appeared together. The ladies were asked about a lot of things including their lives. It was Karan Johar who made an explosive revelation. He r… [+180 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"Lovebirds Richa Chadha-Ali Fazal to finally tie the knot in September 2022: Reports - Times of India","description":"Lovebirds Ali Fazal and Richa Chadha are all set to tie the knot in September 2022. According to a report, the couple will have two wedding ceremonies, one in Mumbai while the other will be held in Delhi. Ali and Richa had earlier planned to get married in Ma…","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/lovebirds-richa-chadha-ali-fazal-to-finally-tie-the-knot-in-september-2022-reports/videoshow/93362059.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/93362059/size-23468/93362059.jpg","publishedAt":"2022-08-05T04:48:45Z","content":"Lovebirds\r\n Ali Fazal and Richa Chadha\r\n are all set to tie the knot in September 2022. According to a report, the couple will have two wedding ceremonies, one in Mumbai while the other will be held … [+493 chars]"},{"source":{"id":null,"name":"Thehansindia.com"},"author":"The Hans India","title":"Sita ramam Movie Leaked Online on Movierulz and Tamilrockers - The Hans India","description":"This most-hyped film of Dulquer Salmaans Sita Raamam is hitting the screens today. Mrunal Thakur,...","url":"https://www.thehansindia.com/cinema/sita-ramam-movie-leaked-online-on-movierulz-and-tamilrockers-756523","urlToImage":"https://assets.thehansindia.com/h-upload/2022/05/25/1294186-sita-ramam.jpg","publishedAt":"2022-08-05T04:30:48Z","content":"This most-hyped film of Dulquer Salmaan's Sita Raamam is hitting the screens today. Mrunal Thakur, Rashmika, Sumanth, and other actors star in the Hanu Raghavapudi-directed film Sita Ramam. Swapna Ci… [+556 chars]"},{"source":{"id":null,"name":"123telugu.com"},"author":null,"title":"This is why Shankar decided to put RC15 on hold? - 123telugu","description":"Shankar is doing a film with Ram Charan as of now and we all are aware of it already. He was supposed to do Indian 2 with Kamal Haasan but that project was stopped. Now, there was news that Shankar ha","url":"https://www.123telugu.com/mnews/this-is-why-shankar-decided-to-put-rc15-on-hold.html","urlToImage":"https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif","publishedAt":"2022-08-05T04:30:00Z","content":"Shankar is doing a film with Ram Charan as of now and we all are aware of it already. He was supposed to do Indian 2 with Kamal Haasan but that project was stopped.\r\nNow, there was news that Shankar … [+462 chars]"},{"source":{"id":null,"name":"Mirchi9.com"},"author":null,"title":"Unexpected Boost for Karthikeya 2 in Bollywood - Mirchi9","description":"Karthikeya 2 is getting an unexpected boost in Hindi belt because of boycott trends. Karthikeya 2 promotes Hinduism and shows the greatness of Lord Krishna.","url":"https://www.mirchi9.com/movienews/unexpected-boost-for-karthikeya-2-in-bollywood/","urlToImage":"https://www.mirchi9.com/wp-content/uploads/2022/08/Karthikeya_2-1.jpg","publishedAt":"2022-08-05T03:38:33Z","content":"This Independence day weekend, Bollywood will see one of the biggest clashes in recent times. Aamir Khan’s much-awaited Laal Singh Chaddha and Akshay Kumar’s Rakshabandhan are releasing on August 11t… [+1879 chars]"},{"source":{"id":null,"name":"Latestgossipwu.com"},"author":null,"title":"YRKKH Spoiler: Mahima knows Anisha's Reality plans to get Rid of the Worst - Latestgossipwu","description":"YRKKH Spoiler: Mahima knows Anisha's Reality plans to get Rid of the Worst\r\nIn the Upcoming Track of the Popular hit Show from Yeh Rishta Kya Kehlata Hai the Drama is going to intensify with high voltage drama. \r\nRecently We h","url":"https://www.latestgossipwu.com/gossip-68762-a","urlToImage":"https://img.latestgossipwu.com/2022/08/05/gossip-1659668585.jpg","publishedAt":"2022-08-05T03:21:09Z","content":"In the Upcoming Track of the Popular hit Show from Yeh Rishta Kya Kehlata Hai the Drama is going to intensify with high voltage drama. \r\nRecently We have seen that Birlas and Goenkas are worried abou… [+1002 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Hrithik Roshan pays tribute to his Koi Mil Gaya co-star Mithilesh Chaturvedi - Hindustan Times","description":"Hrithik Roshan paid his condolences to Koi Mil Gaya co-actor Mithilesh Chaturvedi. The actor suffered a cardiac arrest over a week ago and was admitted to a Mumbai hospital. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/hrithik-roshan-pays-tribute-to-his-koi-mil-gaya-co-star-mithilesh-chaturvedi-101659667782056.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/05/1600x900/Hrithik_Roshan_Koi_Mil_Gaya_Mithilesh_Chaturvedi_1659668559788_1659668559977_1659668559977.JPG","publishedAt":"2022-08-05T03:18:39Z","content":"Actor Hrithik Roshan paid a tribute to his Koi mil Gaya co-star Mithilesh Chaturvedi, who died on Thursday morning days after a cardiac arrest. Taking to Twitter, Hrithik Roshan wrote, \"Thoughts and … [+2317 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"Amyra Dastur steals hearts in pretty slip dress - Times of India","description":"South Indian beauty Amyra Dastur stole hearts in her beautiful slip dress at the Mumbai airport. The actor looked absolutely pretty and raised bar for comfy airport look. Her dress was a perfect balance of comfort and glamour. Amyra left her hair open that we…","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/amyra-dastur-steals-hearts-in-pretty-slip-dress/videoshow/93360021.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/93360021/size-60750/93360021.jpg","publishedAt":"2022-08-05T02:58:38Z","content":"South Indian beauty Amyra Dastur\r\n stole hearts in her beautiful slip dress at the Mumbai airport. The actor\r\n looked absolutely pretty and raised bar for comfy airport look. Her dress was a perfect … [+213 chars]"},{"source":{"id":null,"name":"123telugu.com"},"author":null,"title":"Surprise: Huge cutout erected for Dulquer Salmaan in AP - 123telugu","description":"It is a known fact that Telugu people love actors irrespective of language and industry. That's why many Tamil, Kannada, Malayalam and Hindi movies run well at the ticket windows in AP & TS.","url":"https://www.123telugu.com/mnews/surprise-huge-cutout-erected-for-dulquer-salmaan-in-ap.html","urlToImage":"https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif","publishedAt":"2022-08-05T02:30:00Z","content":"It is a known fact that Telugu people love actors irrespective of language and industry. Thats why many Tamil, Kannada, Malayalam and Hindi movies run well at the ticket windows in AP &amp; TS. Now, … [+695 chars]"}]}