{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"A Major Throwback Of Chiranjeevi Cheering For Ram Charan And Allu Arjun's Dance. Watch - NDTV","description":"Talk about a perfect throwback moment","url":"https://www.ndtv.com/entertainment/a-major-throwback-of-chiranjeevi-cheering-for-ram-charan-and-allu-arjuns-dance-watch-3282105","urlToImage":"https://c.ndtvimg.com/2022-08/5fod0qs_chiranjeevi_625x300_24_August_22.jpg","publishedAt":"2022-08-24T09:46:02Z","content":"A still from the video. (courtesy MegaPowerSena)\r\nNew Delhi: It's not Thursday yet but we chanced upon the perfect throwback video, which is trending big time on social media. The video shared by a f… [+1582 chars]"},{"source":{"id":null,"name":"123telugu.com"},"author":null,"title":"Rajamouli wants to direct this Tamil superstar - 123telugu","description":"The promotions of Brahmastra are in full swing and the team has landed in Chennai today for the Tamil version's promotions. Rajamoul, who is releasing the film in Tamil spoke at length about the","url":"https://www.123telugu.com/mnews/rajamouli-wants-to-direct-this-tamil-superstar.html","urlToImage":"https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif","publishedAt":"2022-08-24T09:30:00Z","content":"The promotions of Brahmastra are in full swing and the team has landed in Chennai today for the Tamil version’s promotions.\r\nRajamoul, who is releasing the film in Tamil spoke at length about the fil… [+417 chars]"},{"source":{"id":null,"name":"India TV News"},"author":"Written by Ridhi Suri","title":"Shah Rukh Khan suffers ‘big time FOMO’ after Aryan, Suhana & Abram's recent pic. Describe them THIS - India TV News","description":"Suhana Khan's picture with her brothers Aryan Khan and AbRam has garnered several comments and likes. The sweetest one arrived from her father, Shah Rukh Khan who suffered big time FOMO.","url":"https://www.indiatvnews.com/entertainment/celebrities/shah-rukh-khan-suffers-big-time-fomo-after-aryan-khan-suhana-khan-abram-s-recent-pic-circus-gauri-khan-2022-08-24-802582","urlToImage":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/aryan-1661328454.jpg","publishedAt":"2022-08-24T08:08:24Z","content":"Shah Rukh Khan is enjoying commenting on the new pictures shared by his kids, son Aryan Khan and daughter Suhana Khan which also feature their younger brother AbRam. The superstar shares a strong bon… [+2392 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Karan Johar reveals the two celebs he will never invite on Koffee With Karan - Hindustan Times","description":"Koffee With Karan: Karan Johar has opened up on the two celebrities he is almost certain will never be guests on his popular talk show Koffee With Karan. | Web Series","url":"https://www.hindustantimes.com/entertainment/web-series/karan-johar-reveals-the-two-celebs-he-will-never-invite-on-koffee-with-karan-101661326641675.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/24/1600x900/koffeewithkaran7_1661326899985_1661326911949_1661326911949.jpg","publishedAt":"2022-08-24T08:00:30Z","content":"Koffee With Karan has been on our TV screens (and lately mobiles and tablets too) for close to two decades now. Over the course of seven seasons, scores of film stars and filmmakers have graced Karan… [+1561 chars]"},{"source":{"id":null,"name":"Greatandhra.com"},"author":"Vamsi","title":"Finally, Naga Shaurya's KVV Set For Release.. - Greatandhra","description":"Hero Naga Shaurya will next be seen in a wholesome family entertainer Krishna Vrinda Vihari which got postponed few times for different reasons.","url":"https://www.greatandhra.com/movies/news/finally-naga-shauryas-kvv-set-for-release-123336","urlToImage":"https://www.greatandhra.com/newphotos10/kvv11661324334.jpg","publishedAt":"2022-08-24T06:58:54Z","content":"Hero Naga Shaurya will next be seen in a wholesome family entertainer Krishna Vrinda Vihari which got postponed few times for different reasons.\r\nThe makers actually looked for a right date for the f… [+646 chars]"},{"source":{"id":null,"name":"We Got This Covered"},"author":"Jamie Dunkin","title":"No-One Knows Why Facebook Is Showing Everyone Posts On Celebrities' Pages - We Got This Covered","description":"No, it's not just happening to you.","url":"https://wegotthiscovered.com/social-media/facebook-has-been-zucked-by-an-algorithm-bug-that-has-broken-everyones-news-feeds/","urlToImage":"https://wegotthiscovered.com/wp-content/uploads/2022/08/mark-zuckerberg-drew-angerer.png","publishedAt":"2022-08-24T06:47:04Z","content":"In case you hadn’t noticed, your Facebook feed may look like an absolute mess of memes and strange cryptic language. Fear not, because everyone else is having the same issue.\r\nSome point between the … [+1460 chars]"},{"source":{"id":null,"name":"India TV News"},"author":"Reported by Agencies, Edited by India TV Entertainment Desk","title":"Raju Srivastava Health Update: Comedian to be taken off ventilator today, claims Sunil Pal - India TV News","description":"Raju Srivastava Health Update: Comedian, who has been in the intensive care unit of AIIMS for a fortnight following a heart attack, is stable and continues to be unconscious, his family had shared. Here's the latest update.","url":"https://www.indiatvnews.com/entertainment/news/raju-srivastava-health-update-comedian-to-be-taken-off-ventilator-today-claims-sunil-pal-celeb-latest-news-2022-08-24-802546","urlToImage":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/raju-srivastava-9-1661322902.jpg","publishedAt":"2022-08-24T06:36:27Z","content":"Raju Srivastava Health Update: The acclaimed comedian and winner of 'The Great Indian Laughter Challenge' Season 1, Sunil Pal, has requested his friend and colleague Raju Srivastava's fans to stay po… [+2736 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Sweta Kaushal","title":"Mandakini explains her breastfeeding scene in Ram Teri Ganga Maili - Hindustan Times","description":"In this exclusive interview with Hindustan Times, Mandakini talks about her debut film Ram Teri Ganga Maili, her breastfeeding scene and working on her new song as she makes her comeback with Maa O Maa that also marks her son Rabbil's debut. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/mandakini-explains-her-breastfeeding-scene-in-ram-teri-ganga-maili-101661318804548.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/24/1600x900/MANDAKINI_1661319230548_1661319845281_1661319845281.JPG","publishedAt":"2022-08-24T05:44:11Z","content":"Yesteryear star Mandakini is all set for a comeback after two decades. She launched her first single, Maa O Maa Monday evening and the song marks her comeback to showbiz after 26 long years of break.… [+4307 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Vikram Vedha teaser: Hrithik will show no mercy as Saif is out to hunt him down - Hindustan Times","description":"Vikram Vedha teaser: Starring Hrithik Roshan and Saif Ali Khan, the film is a powerful action thriller made on a much larger scale than the original 2017 movie. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/vikram-vedha-teaser-hrithik-roshan-will-show-no-mercy-as-saif-ali-khan-is-out-to-hunt-him-down-101661316969305.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/24/1600x900/hrithik_roshan_1661319490862_1661319491014_1661319491014.jpg","publishedAt":"2022-08-24T05:41:17Z","content":"The teaser of Hrithik Roshan and Saif Ali Khan's neo-noir action thriller Vikram Vedha is out now. While Saif plays a determined police officer Vikram, Hrithik plays a ruthless gangster Vedha. Also r… [+1900 chars]"},{"source":{"id":null,"name":"CarToq.com"},"author":"Shantonil Nag","title":"Lal Singh Chaddha actor and superstar Aamir Khan’s car collection: Toyota Vellfire to Bentley Continental - CarToq.com","description":"Aamir Khan, who recently appeared in Lal Singh Chaddha, the remake of Forrest Gump in India, is considered one of the most versatile actors. Aamir owns a slew of cars and his car garage is a mix of fast cars and practical spacious vehicles. Lal Singh Chaddha …","url":"https://www.cartoq.com/aamir-khans-collection-of-practical-super-luxurious-cars-from-toyota-vellfire-to-bentley-continental/","urlToImage":"https://www.cartoq.com/wp-content/uploads/2022/08/aamir-khan-with-the-toyota-vellfire-featured.jpg","publishedAt":"2022-08-24T05:36:54Z","content":"Aamir Khan, who recently appeared in Lal Singh Chaddha, the remake of Forrest Gump in India, is considered one of the most versatile actors. Aamir owns a slew of cars and his car garage is a mix of f… [+3773 chars]"},{"source":{"id":null,"name":"Koimoi"},"author":"Koimoi.com Team","title":"Karthikeya 2 Box Office Update (11 Days): Hits A Humongous Profit Of 286%, On Its Way To Achieve 100 Crore Global Milestone Soon - Koimoi","description":"Nikhil Siddhartha starrer Karthikeya 2 continues to enjoy its highly successful run at the box office. Here's the 11-day collection update.","url":"https://www.koimoi.com/?p=921189","urlToImage":"https://static-koimoi.akamaized.net/wp-content/new-galleries/2022/08/karthikeya-2-box-office-update-11-days-001.jpg","publishedAt":"2022-08-24T05:35:28Z","content":"Karthikeya 2 Box Office Update (11 Days)(Photo Credit Instagram)\r\nNikhil Siddhartha starrer Karthikeya 2 continues to enjoy its highly successful run at the box office. After witnessing terrific grow… [+1575 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Vivek Agnihotri reacts to Canadian director who called The Kashmir Files garbage - Hindustan Times","description":"Vivek Agnihotri defended The Kashmir Files as he responded to a Canadian filmmaker, who had said the film should not be sent to the Oscars. Dylan Mohan Gray called the box office hit a ‘hatemongering garbage of no artistic merit’. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/vivek-agnihotri-reacts-to-canadian-director-who-called-the-kashmir-files-garbage-101661317815876.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/24/1600x900/dylan_mohan_gray_vivek_agnihotri_1660792825508_1661318189534_1661318189534.jpg","publishedAt":"2022-08-24T05:30:48Z","content":"Days after he made headlines for his reaction to Anurag Kashyaps remark that The Kashmir Files should not be sent to the Oscars, filmmaker Vivek Agnihotri has spoken about his film being criticised b… [+2299 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Sorry Karan Johar, But Shahid Kapoor Only Wants \"Koffee With Kiara\" - NDTV Movies","description":"Shahid Kapoor has shared an image with his Kabir Singh co-star Kiara Advani","url":"https://www.ndtv.com/entertainment/sorry-karan-johar-but-shahid-kapoor-only-wants-koffee-with-kiara-3281106","urlToImage":"https://c.ndtvimg.com/2022-08/iqvqji38_shahid-kapoor_625x300_24_August_22.jpg","publishedAt":"2022-08-24T05:09:46Z","content":"Shahid Kapoor shared this picture. (courtesy: shahidkapoor)\r\nShahid Kapoor and Kiara Advani's chemistry is the stuff of legends. Need proof? All you have to do is look at the box office collection of… [+2062 chars]"},{"source":{"id":null,"name":"Latestgossipwu.com"},"author":null,"title":"Anupama: Anupama slays down accumulated anger amidst Barkha-Ankush with full swag - Latestgossipwu","description":"Anupama: Anupama's (Rupali Ganguly) compiled anger runs Barkha's mental horses wild as Ankush seeks apology towards Anuj (Gaurav Khanna)\r\nAnupama's show will be definitely slaying the yet stubborn Barkha and Ankush with full vigour and vi","url":"https://www.latestgossipwu.com/gossip-69368-a","urlToImage":"https://img.latestgossipwu.com/2022/08/24/gossip-1661316293.jpg","publishedAt":"2022-08-24T04:49:13Z","content":"Anupama's show will be definitely slaying the yet stubborn Barkha and Ankush with full vigour and violence in the upcoming episode.\r\nAnkush and Barkha will be dragged out of Kapadia house by none oth… [+933 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Dia Mirza wasn’t allowed to hold son for two-and-a-half months after he was born - Hindustan Times","description":"Dia Mirza spoke about her ‘very hard’ childbirth, and said it was life-threatening for both – her and son Avyaan Azaad Rekhi. The actor said she was not allowed to hold him for his first two-and-a-half months, and visited him in hospital only twice a week. | …","url":"https://www.hindustantimes.com/entertainment/bollywood/dia-mirza-wasn-t-allowed-to-hold-son-for-two-and-a-half-months-after-he-was-born-101661314272917.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/24/1600x900/Dia_Mirza_baby_name_1661314481114_1661314515212_1661314515212.jpg","publishedAt":"2022-08-24T04:34:50Z","content":"Dia Mirza gave birth to son Avyaan Azaad Rekhi in May 2021. The actor recalled her delivery and said it was life-threatening for both her and her child. In a recent interview, Dia also spoke about no… [+2537 chars]"},{"source":{"id":null,"name":"123telugu.com"},"author":null,"title":"Chiranjeevi’s God Father locks its OTT streaming partner? - 123telugu","description":"Megastar Chiranjeevi is currently busy with multiple projects and God Father is one of them. Directed by Mohan Raja, the movie's teaser was released a few days ago. Bollywood star actor Salman Kh","url":"https://www.123telugu.com/mnews/chiranjeevis-god-father-locks-its-ott-streaming-partner.html","urlToImage":"https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif","publishedAt":"2022-08-24T04:30:00Z","content":"Megastar Chiranjeevi is currently busy with multiple projects and God Father is one of them. Directed by Mohan Raja, the movies teaser was released a few days ago. Bollywood star actor Salman Khan is… [+643 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"Suniel Shetty confirms Athiya Shetty and KL Rahul's wedding. But, there's a twist... - India Today","description":"Suniel Shetty has once again spoken up about her daughter Athiya Shetty and KL Rahul's wedding plans. The actor confirmed they will get married.","url":"https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-confirms-athiya-shetty-and-kl-rahul-s-wedding-but-there-s-a-twist-1991811-2022-08-24","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/ezgif-4-8621edaf78-647x363.jpeg?kgjL77t0ErcY6ZV6nAYVSwTuj7alCOME","publishedAt":"2022-08-24T04:13:00Z","content":"Athiya Shetty and KL Rahul have been in a relationship for quite some time now. It is quite often rumoured that the couple is ready to take the plunge and tie the knot. While Athiya, daughter of Suni… [+2582 chars]"},{"source":{"id":null,"name":"Greatandhra.com"},"author":"Venkat","title":"Buzz: Lesbian Relationships In Tollywood.. - Greatandhra","description":"Lesbianism was once upon a time a taboo in any society. But now with LGBT rights in place, they could open up and live in freedom.","url":"https://www.greatandhra.com/movies/news/buzz-lesbian-relationships-in-tollywood-123334","urlToImage":"https://www.greatandhra.com/newphotos10/tollywood11661312020.jpg","publishedAt":"2022-08-24T03:33:40Z","content":"Lesbianism was once upon a time a taboo in any society. But now with LGBT rights in place, they could open up and live in freedom. But still Indian societies are still conventional to accept this kin… [+644 chars]"},{"source":{"id":null,"name":"soompi"},"author":"sala12","title":"BLACKPINK Revealed To Be Filming MV For Upcoming Studio Album “BORN PINK” - soompi","description":"BLACKPINK is gearing up for their highly-anticipated second full-length album “BORN PINK“! On August 24, YG Entertainment revealed that the four BLACKPINK members are currently working hard to film the music video for the upcoming album at a site in Gyeonggi …","url":"https://www.soompi.com/article/1542016wpp/blackpink-revealed-to-be-filming-mv-for-upcoming-studio-album-born-pink","urlToImage":"https://6.viki.io/image/020523639b1e40ab844a23d3d105039f/dummy.jpeg?s=900x600&e=t","publishedAt":"2022-08-24T03:10:52Z","content":"BLACKPINK is gearing up for their highly-anticipated second full-length album BORN PINK!\r\nOn August 24, YG Entertainment revealed that the four BLACKPINK members are currently working hard to film th… [+881 chars]"},{"source":{"id":null,"name":"Tracktollywood.com"},"author":"Suraj","title":"Vijay Deverakonda Is No More A Tier 2 Hero; Enters Tier 1 With Liger - TrackTollywood","description":"After Liger, Vijay Deverakonda is no longer in the Tier 2 list... He has entered the Tier 1 list... The advance bookings of Liger are...","url":"https://tracktollywood.com/vijay-deverakonda-is-no-more-a-tier-2-hero-enters-tier-1-with-liger/","urlToImage":"https://tracktollywood.com/wp-content/uploads/2022/08/A-still-from-Liger-Trailer.jpg","publishedAt":"2022-08-24T03:08:29Z","content":"With just a day left for the release of Vijay Deverakonda’s much anticipated Pan-Indian project Liger, the advance bookings are highly promising. The bookings are not only phenomenal in the two Telug… [+1026 chars]"}]}