{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"India.com"},"author":"India.com Lifestyle Staff","title":"8 Ways Lauric Acid Can Boost Your Overall Health - India.com","description":"Lavanya Sunkari, founder, and CEO of Laurik, describes the benefits and uses of the hottest superfood in nutraceuticals – lauric acid. Read on!","url":"https://www.india.com/lifestyle/health-tips-8-ways-lauric-acid-can-boost-your-overall-health-benefits-of-lauric-acid-5463665/","urlToImage":"https://static.india.com/wp-content/uploads/2022/06/Collage-Maker-20-Jun-2022-09.56-AM.jpg","publishedAt":"2022-06-20T04:27:19Z","content":"The general desire for looking young and feeling good is not new. People across the world have always looked for ways to reverse ageing by enhancing their looks and improving their overall health. Th… [+4409 chars]"},{"source":{"id":null,"name":"Medical Dialogues"},"author":"Jacinthlyn Sylvia","title":"Diabetes patients with low osteocalcin levels at increased risk of mortality: BMC - Medical Dialogues","description":"China: A new study published in Cardiovascular Diabetology shows that in type 2 diabetes patients,...","url":"https://medicaldialogues.in/diabetes-endocrinology/news/diabetes-patients-with-low-osteocalcin-levels-at-increased-risk-of-mortality-bmc-94709","urlToImage":"https://medicaldialogues.in/h-upload/2021/11/02/163181-heart-disease-risk-assessment.jpg","publishedAt":"2022-06-20T04:15:25Z","content":"China: A new study published in Cardiovascular Diabetology shows that in type 2 diabetes patients, there was a relationship between baseline osteocalcin and death. Patients with lower serum osteocalc… [+2383 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"Scientists discover new way of treating solid tumours using Nanoparticles - Times of India","description":"According to a recent study, a group of Wake Forest University School of Medicine researchers found a new way of treating solid tumours with the creation of a novel nanoparticle. They also discovered that cancers of breast, colon, head and neck have tumours t…","url":"https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/scientists-discover-new-way-of-treating-solid-tumours-using-nanoparticles/videoshow/92327743.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/92327743/size-48973/92327743.jpg","publishedAt":"2022-06-20T04:13:04Z","content":"According to a recent study, a group of Wake Forest University School of Medicine researchers found a new way of treating solid tumours\r\n with the creation of a novel nanoparticle. They also discover… [+1099 chars]"},{"source":{"id":null,"name":"The Siasat Daily"},"author":"IANS","title":"4 cr Indians experienced long COVID-19 symptoms in last two years: Study - The Siasat Daily","description":"About four crore Indians suffered long COVID-19 symptoms during the last two years of pandemic, according to a study, not peer-reviewed yet.","url":"https://www.siasat.com/4-cr-indians-experienced-long-covid-19-symptoms-in-last-two-years-study-2352667/","urlToImage":"https://cdn.siasat.com/wp-content/uploads/2022/02/2022_2img01_Feb_2022_PTI02_01_2022_000161B-scaled.jpg","publishedAt":"2022-06-20T04:00:00Z","content":"New Delhi: About four crore Indians suffered long COVID-19 symptoms during the last two years of pandemic, according to a study, not peer-reviewed yet.\r\nLong COVID-19 is defined as having new or ongo… [+2402 chars]"},{"source":{"id":null,"name":"News-Medical.Net"},"author":null,"title":"Long-COVID risk reduced with Omicron versus Delta - News-Medical.Net","description":"In a recent study published in The Lancet, researchers at King's College London and ZOE Limited assessed the risk of long coronavirus disease (COVID) associated with severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) Delta and Omicron variants in th…","url":"https://www.news-medical.net/news/20220619/Long-COVID-risk-reduced-with-Omicron-versus-Delta.aspx","urlToImage":"https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_717163_16556933041586477.jpg","publishedAt":"2022-06-20T02:50:00Z","content":"In a recent study published in The Lancet, researchers at King's College London and ZOE Limited assessed the risk of long coronavirus disease (COVID) associated with severe acute respiratory syndrome… [+4817 chars]"},{"source":{"id":null,"name":"The Sentinel Assam"},"author":"Sentinel Digital Desk","title":"Diabetes, heart disease increase dementia risk: Study - Sentinelassam - The Sentinel Assam","description":"People with Type 2 diabetes, heart disease or stroke have double the risk of developing dementia,...","url":"https://www.sentinelassam.com/topheadlines/diabetes-heart-disease-increase-dementia-risk-study-597966","urlToImage":"https://assets.sentinelassam.com/h-upload/2022/06/19/356655-dementi.jpg","publishedAt":"2022-06-20T02:00:12Z","content":"LONDON: People with Type 2 diabetes, heart disease or stroke have double the risk of developing dementia, finds a study. Type 2 diabetes, heart diseases (ischemic heart disease, heart failure or atri… [+2322 chars]"},{"source":{"id":null,"name":"Roguemedialabs.com"},"author":"rmladmin","title":"Drinking hot lemon water on an empty stomach, what are the health consequences? – Rogue Media Labs - Rogue Media Labs","description":"Very fashionable among superstars, the hot lemon water-based regimen would be very beneficial to health. The virtues of lemon also make this drink an excellent ally for health. However, there are some","url":"https://roguemedialabs.com/2022/06/20/drinking-hot-lemon-water-on-an-empty-stomach-what-are-the-health-consequences/","urlToImage":"https://roguemedialabs.com/wp-content/uploads/2022/06/eau-chaude-citronnee.jpg","publishedAt":"2022-06-20T00:31:32Z","content":"Very fashionable among superstars, the hot lemon water-based regimen would be very beneficial to health. The virtues of lemon also make this drink an excellent ally for health. However, there are som… [+4455 chars]"},{"source":{"id":null,"name":"News-Medical.Net"},"author":null,"title":"Combating monkeypox during COVID-19 - News-Medical.Net","description":"Scientists describe the global prevalence and significance of the current monkeypox virus outbreak.","url":"https://www.news-medical.net/news/20220619/Combating-monkeypox-during-COVID-19.aspx","urlToImage":"https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_717151_16555052584093062.jpg","publishedAt":"2022-06-20T00:18:00Z","content":"In a recent Virusesstudy, scientists at James Cook University, Australia, describe the global prevalence and significance of the current monkeypox virus outbreak.\r\nStudy: Travel-Related Monkeypox Out… [+5571 chars]"},{"source":{"id":null,"name":"Theepochtimes.com"},"author":null,"title":"Comparing Different Treatment Options for Spider Veins - The Epoch Times","description":"Recent surveys have concluded spider veins are the number one cause for concern in American women, with many undergoing cosmetic procedures to remove them.","url":"https://www.theepochtimes.com/comparing-different-treatment-options-for-spider-veins_4543847.html","urlToImage":"https://img.theepochtimes.com/assets/uploads/2022/06/19/walking-seniors-1200x960.jpg","publishedAt":"2022-06-19T23:01:14Z","content":"Introduction to Spider Veins\r\nSpider veins are increasingly common, occurring in half of the population over 50. Research has suggested that women are four times more likely than men to be affected [… [+9841 chars]"},{"source":{"id":null,"name":"Playcrazygame.com"},"author":"Jenni Smith","title":"Do you have diabetes? Know what foods are allowed and what to avoid - Play Crazy Game","description":"Diet is very important to help diabetics control blood glucose levels, preventing changes such as hyperglycemia, which is excess sugar, or hypoglycemia, which is an exaggerated drop in blood sugar.Sugar imbalance, common in situations where diabetes is not co…","url":"https://playcrazygame.com/2022/06/20/do-you-have-diabetes-know-what-foods-are-allowed-and-what-to-avoid/","urlToImage":"https://uploads.metropoles.com/wp-content/uploads/2022/02/23135945/diabetes-pode-ser-controlada-com-alimentos.jpg","publishedAt":"2022-06-19T20:18:38Z","content":"Diet is very important to help diabetics control blood glucose levels, preventing changes such as hyperglycemia, which is excess sugar, or hypoglycemia, which is an exaggerated drop in blood sugar.\r\n… [+7766 chars]"},{"source":{"id":null,"name":"Neurosciencenews.com"},"author":"https://www.facebook.com/neurosciencenews","title":"The Benefits of Exercise in a Pill? Science Is Closer to That Goal - Neuroscience News","description":"Researchers have identified a molecule in the blood that is produced during exercise. The molecule, Lac-Phe, can effectively reduce food intake and obesity in mouse models.","url":"https://neurosciencenews.com/exercise-enzyme-20867/","urlToImage":"https://neurosciencenews.com/files/2022/06/plasma-exercise-neurosicencecs-public.jpg","publishedAt":"2022-06-19T19:44:07Z","content":"Summary: Researchers have identified a molecule in the blood that is produced during exercise. The molecule, Lac-Phe, can effectively reduce food intake and obesity in mouse models.\r\nSource: Baylor C… [+4948 chars]"},{"source":{"id":null,"name":"Rising Kashmir Daily English Newspaper"},"author":null,"title":"Studies suggest upto 70 percent women experience breast pain in their lifetime: Dr. Syed Quibtiya - Rising Kashmir","description":"Says, Breast pain least associated symptoms of breast cancer","url":"https://www.risingkashmir.com/displaynews.aspx?news=109405","urlToImage":"https://www.risingkashmir.com/userfiles/image/s_637912356249713816_Interview_Pic_(1).jpeg","publishedAt":"2022-06-19T19:37:37Z","content":"Mastalgia/Breast Pain is the most common symptom encountered in women and is defined as tension, discomfort and pain in one or both breasts.\r\nRising Kashmir’s special Correspondent Jahangir Sofi spea… [+7795 chars]"},{"source":{"id":null,"name":"Ianslive.in"},"author":"IANSLive","title":"42 countries reported 2103 cases of monkeypox since January: WHO - IANS","description":"The global health body has, in a significant move, dropped the endemic country distinction for monkeypox in bid to unify responses.","url":"https://ianslive.in/news/42_countries_reported_2_103_cases_of_monkeypox_since_january_who-880795/SCIENCE-AND-TECHNOLOGY/36","urlToImage":"https://ianslive.in/upload/2022/June/19/r-1655642092202206191804522090_l.jpg","publishedAt":"2022-06-19T18:07:21Z","content":"Photo Credit: IANS\r\nIANSLive\r\nNew Delhi, June 19 (IANS) A total of 42 countries, both endemic and non-endemic, have reported 2,103 laboratory confirmed cases of monkeypox, since the beginning of the … [+3074 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Study suggests glucose meter might soon test SARS-CoV-2 antibody levels - ANI News","description":"Washington [US], June 19 (ANI): Researchers have reported simple and accurate glucose meter-based tests that include new fusion proteins. They say that consumers will one day be able to use this assay to monitor their SARS-CoV-2 antibody levels.","url":"https://www.aninews.in/news/science/study-suggests-glucose-meter-might-soon-test-sars-cov-2-antibody-levels20220619233215","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/et345t4rtf4retfure2022061917403620220619180205.jpg","publishedAt":"2022-06-19T18:02:00Z","content":"ANI | Updated: Jun 19, 2022 23:32 IST\r\nWashington [US], June 19 (ANI): Researchers have reported simple and accurate glucose meter-based tests that include new fusion proteins. They say that consumer… [+3424 chars]"},{"source":{"id":null,"name":"Playcrazygame.com"},"author":"Jenni Smith","title":"Stop smoking with the help of these 3 healthy foods; see other tips - Play Crazy Game","description":"It is not news that smoking is bad for health, but unfortunately many people in Brazil and around the world still use tobacco on a daily basis. However, it is possible to see that some groups are becoming increasingly concerned about their well-being, which l…","url":"https://playcrazygame.com/2022/06/19/stop-smoking-with-the-help-of-these-3-healthy-foods-see-other-tips/","urlToImage":"https://editalconcursosbrasil.com.br/wp-content/uploads/2022/06/fumar.jpg","publishedAt":"2022-06-19T17:39:04Z","content":"It is not news that smoking is bad for health, but unfortunately many people in Brazil and around the world still use tobacco on a daily basis. However, it is possible to see that some groups are bec… [+2659 chars]"},{"source":{"id":null,"name":"Roguemedialabs.com"},"author":"rmladmin","title":"Why pancreatic cancer will be a bigger problem in the future – Rogue Media Labs - Rogue Media Labs","description":"This high rate is explained by the impossibility of adequately treating this cancer at an advanced stage, which is often the case. In fact, this cancer is characterized by a silent course without obvi","url":"https://roguemedialabs.com/2022/06/19/why-pancreatic-cancer-will-be-a-bigger-problem-in-the-future/","urlToImage":"https://roguemedialabs.com/wp-content/uploads/2022/06/Pancreas-780x470.jpg","publishedAt":"2022-06-19T17:37:30Z","content":"This high rate is explained by the impossibility of adequately treating this cancer at an advanced stage, which is often the case. In fact, this cancer is characterized by a silent course without obv… [+3797 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Study: Scientists offer solutions for risky tap water - ANI News","description":"Washington [US], June 19 (ANI): A recent study by Prof. YU Wenzheng's team highlighted the risk that high concentrations of disinfection byproducts in tap water can cause bladder cancer and suggested sustainable solutions such as ozone biofiltration and nanof…","url":"https://www.aninews.in/news/health/study-scientists-offer-solutions-for-risky-tap-water20220619223540","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/t564rgetgrftpture2022061917012320220619170529.jpg","publishedAt":"2022-06-19T17:05:00Z","content":"ANI | Updated: Jun 19, 2022 22:35 IST\r\nWashington [US], June 19 (ANI): A recent study by Prof. YU Wenzheng's team highlighted the risk that high concentrations of disinfection byproducts in tap water… [+3845 chars]"},{"source":{"id":null,"name":"Playcrazygame.com"},"author":"Abhishek Pratap","title":"Discover the app that helps control blood glucose - Play Crazy Game","description":"For those diagnosed with diabetes the news is not at all pleasant, after all, this person goes through a moment of acceptance and diet change until they learn to live with the disease on a daily basis. One of the things, however, that bothers you the most is …","url":"https://playcrazygame.com/2022/06/19/discover-the-app-that-helps-control-blood-glucose/","urlToImage":"https://escolaeducacao.com.br/wp-content/uploads/2022/06/conheca-o-aplicativo-que-ajuda-a-controlar-a-glicemia-1024x683.png","publishedAt":"2022-06-19T16:54:26Z","content":"For those diagnosed with diabetes the news is not at all pleasant, after all, this person goes through a moment of acceptance and diet change until they learn to live with the disease on a daily basi… [+1612 chars]"},{"source":{"id":null,"name":"OI Canadian"},"author":"Tammy Sewell","title":"Videos. The fight against the tiger mosquito is organized in the Dordogne - OI Canadian","description":"“During the summer of 2020, I no longer went out. I could not eat outside once, ”plague Martine Doyen, elected municipal official in Boulazac-Isle-Manoire. His colleague, Janique Plu, agrees: “We find","url":"https://oicanadian.com/videos-the-fight-against-the-tiger-mosquito-is-organized-in-the-dordogne/","urlToImage":"https://media.sudouest.fr/11317069/1200x-1/20220616162537-8t6a3912.jpg","publishedAt":"2022-06-19T16:49:37Z","content":"During the summer of 2020, I no longer went out. I could not eat outside once, plague Martine Doyen, elected municipal official in Boulazac-Isle-Manoire. His colleague, Janique Plu, agrees: We find t… [+2602 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Parmita Uniyal","title":"Add karonda to your diet for these wonderful benefits - Hindustan Times","description":"From working wonders for your mental health to easing constipation, here are reasons you must consider adding karonda to your diet.","url":"https://www.hindustantimes.com/photos/lifestyle/add-karonda-to-your-diet-for-these-wonderful-benefits-101655651029948.html","urlToImage":"https://images.hindustantimes.com/img/2022/06/19/1600x900/karonda_3_1655651054936_1655651082867.jpg","publishedAt":"2022-06-19T15:09:03Z","content":null}]}