{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"The Indian Express"},"author":"Reuters","title":"Explained: Why has polio been found in London, New York and Jerusalem, and how dangerous is it? - The Indian Express","description":"Polio disease: In 2022 so far, there have been 177 cases, after major efforts to get polio vaccination campaigns back on track.","url":"https://indianexpress.com/article/explained/explained-global/polio-disease-outbreak-explained-new-york-london-jerusalem-8092384/","urlToImage":"https://images.indianexpress.com/2022/08/Polio-1.jpg","publishedAt":"2022-08-16T02:39:56Z","content":"Polio, a deadly disease that used to paralyze tens of thousands of children every year, is spreading in London, New York and Jerusalem for the first time in decades, spurring catch-up vaccination cam… [+3044 chars]"},{"source":{"id":null,"name":"Zoom"},"author":"TN Digital","title":"Anaemia: Know how periods could lead to this health condition - Times Now","description":"Anaemia could also be of different types; from iron deficiency anaemia to sickle cell anaemia, there are several other types of anaemia. However, amid all of these iron deficiency anaemia is one of the most common ones and it can be caused when the body doesn…","url":"https://www.timesnownews.com/health/anaemia-know-how-periods-could-lead-to-this-health-condition-article-93580963","urlToImage":"https://static.tnn.in/thumb/msid-93580963,imgsize-100,width-1280,height-720,resizemode-75/93580963.jpg","publishedAt":"2022-08-16T02:38:56Z","content":"Independence Day 2022: Quotes, wishes, messages, WhatsApp statuses, greetings and images to celebrate freedom on August 15"},{"source":{"id":null,"name":"Good News Network"},"author":"Good News Network","title":"Snacking on Grapes May Add 4-5 Years to Lifespans of Those Who Regularly Eat Fast Food - Good News Network","description":"New research suggests that eating grapes might combat the effects of junk food diet—by flushing out the refined fats and sugars.","url":"https://www.goodnewsnetwork.org/grapes-lengthen-lifespan-of-mice-that-eat-high-fat-diets/","urlToImage":"https://www.goodnewsnetwork.org/wp-content/uploads/2021/12/grapes-on-vine-wine-pubdomain-Bill-Williams.jpg","publishedAt":"2022-08-16T01:00:00Z","content":"Photo by Bill Williams\r\nNew research suggests that snacking on grapes might combat the effects of consuming a junk food dietflushing out the refined fats and sugars of processed food.\r\nEating the gra… [+3008 chars]"},{"source":{"id":null,"name":"Healthline"},"author":"Christine Fallabel","title":"Cholesterol and Glucose Metabolism: What You Should Know - Healthline","description":"Cholesterol and glucose metabolism both play roles in diabetes management, and higher glucose readings or cholesterol levels have a negative effect on the other.","url":"https://www.healthline.com/health/diabetes/cholesterol-and-glucose-metabolism","urlToImage":"https://post.healthline.com/wp-content/uploads/2022/08/consulting_with_doctor-1200x628-facebook-1200x628.jpg","publishedAt":"2022-08-16T00:30:08Z","content":"If you live with diabetes and have elevated blood glucose levels, you may also have high cholesterol.\r\nBut how exactly is glucose metabolism impacted by cholesterol? And does diabetes impact choleste… [+6770 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Lateshia Beachum","title":"Humans may have passed monkeypox to their dog, report says - The Washington Post","description":"The potential transmission was discovered in an Italian greyhound 12 days after its Parisian owners had an onset of monkeypox symptoms, according to the Lancet.","url":"https://www.washingtonpost.com/health/2022/08/15/monkeypox-human-dog-transmission/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NJMIMZA43AI63HHGNASTXUYYMQ.jpg&w=1440","publishedAt":"2022-08-16T00:22:24Z","content":"Placeholder while article actions load\r\nThe first suspected case of human-to-dog transmission of monkeypox has been reported in Paris, leading the U.S. Centers for Disease Control and Prevention to u… [+3643 chars]"},{"source":{"id":null,"name":"SheFinds"},"author":"faith geiger","title":"How to Improve Gut Health Naturally: 12 Tips to Consider - SheFinds","description":"Discover 12 expert-approved tips to set your digestive system back on track, only on SheFinds.","url":"https://www.shefinds.com/collections/improve-gut-health-naturally/","urlToImage":"https://www.shefinds.com/files/2022/08/woman-holder-stomach-in-pain.jpg","publishedAt":"2022-08-16T00:00:44Z","content":"Gut health is no joke! While it may be most commonly associated with digestive issues like gas, bloating, irritable bowel syndrome, and more, its important to remember that your gut plays a major rol… [+10788 chars]"},{"source":{"id":null,"name":"EurekAlert"},"author":null,"title":"Can a human with a spinal cord injury walk and run? Discovering clues to solving science challenges with neuromorphic technology - EurekAlert","description":"- Provide a ray of hope, engineering clues to biological/medical challenges for spinal cord and nerve damage patients\n- Reproduction of the leg movement of a nerve-paralyzed rat through the stretchable organic artificial nerve\n- Discover new possibilities for…","url":"https://www.eurekalert.org/news-releases/961673","urlToImage":"https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/dd45b93d-20cd-40fc-b442-efc26760b9fc/Rendition/thumbnail/Content/Public","publishedAt":"2022-08-15T22:57:13Z","content":"image: (From left) Research team of Prof. Tae-Woo Lee (Seoul National University), Prof. Zhenan Bao (Stanford University), Dr. Yeongjun Lee (Seoul National University), Dr. Yuxin Liu (Stanford Univer… [+11363 chars]"},{"source":{"id":null,"name":"INSIDER"},"author":"Gabby Landsverk","title":"Tirzepatide: Weight loss drug suppresses appetite, awaits FDA approval - Insider","description":"Tirzepatide is a diabetes medication being considered for use to treat obesity and help patients lose weight, like the related drug semaglutide.","url":"https://www.insider.com/tirzepatide-weight-loss-medication-what-to-know-2022-8","urlToImage":"https://i.insider.com/62fa8ea2f16a0d0018e6922e?width=1200&format=jpeg","publishedAt":"2022-08-15T21:40:29Z","content":"Another weight loss medication designed to treat diabetes is part of a promising class of new drugs that may aid weight loss. \r\nTirzepatide has attracted attention for dramatic weight loss results, i… [+3891 chars]"},{"source":{"id":"medical-news-today","name":"Medical News Today"},"author":"Deep Shukla","title":"Banana peel 'flour' may enhance cookies' nutritional value and taste - Medical News Today","description":"Researchers found that the nutritional value and taste of baked cookies can be enhanced by adding flour made from banana peels which are a rich source of dietary fiber, vitamins, antioxidants, and protein.","url":"https://www.medicalnewstoday.com/articles/banana-peel-flour-may-enhance-nutritional-value-and-taste-of-cookies","urlToImage":"https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/08/cooking_with_banana_peels_732x549_thumb.jpg","publishedAt":"2022-08-15T21:12:25Z","content":"<ul><li>Banana peels can be edible and are a rich source of dietary fiber, vitamins, antioxidants, and protein.</li><li>A new study shows that substituting a small amount (7.5% to 15%) of wheat flour… [+7329 chars]"},{"source":{"id":"medical-news-today","name":"Medical News Today"},"author":"Robby Berman","title":"Even a 2-minute walk after a meal may help reduce risk of type 2 diabetes - Medical News Today","description":"A study found that even 2 to 5 minutes of light walking right after eating may reduce the risk of type 2 diabetes.","url":"https://www.medicalnewstoday.com/articles/even-a-2-minute-walk-after-a-meal-may-help-reduce-risk-of-type-2-diabetes","urlToImage":"https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/08/walk_meals_GettyImages1163664149_Thumb.jpg","publishedAt":"2022-08-15T21:06:32Z","content":"<ul><li>A new meta-analysis published in Sports Medicine suggests that even 2 to 5 minutes of light walking right after eating may reduce the risk of type 2 diabetes.</li><li>Just standing rather tha… [+5696 chars]"},{"source":{"id":null,"name":"News-Medical.Net"},"author":null,"title":"Study highlights the safety profile of mRNA COVID-19 vaccines during pregnancy - News-Medical.Net","description":"A new study describes how mRNA-based COVID-19 vaccines are safe during pregnancy.","url":"https://www.news-medical.net/news/20220815/Study-highlights-the-safety-profile-of-mRNA-COVID-19-vaccines-during-pregnancy.aspx","urlToImage":"https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_722397_16605954450167127.jpg","publishedAt":"2022-08-15T20:48:00Z","content":"The British Medical Journal has recently published an article describing that mRNA-based coronavirus disease 2019 (COVID-19) vaccines are safe during pregnancy. The conclusion has been made based on … [+4097 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"Dennis Thompson HealthDay Reporter","title":"How worried should you be about new reports on polio? - Medical Xpress","description":"Poliovirus detected in New York City wastewater last week put public health officials on high alert, as it indicates the potentially paralyzing virus is circulating widely in the area.","url":"https://medicalxpress.com/news/2022-08-polio-1.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/how-worried-should-you.jpg","publishedAt":"2022-08-15T19:54:04Z","content":"Poliovirus detected in New York City wastewater last week put public health officials on high alert, as it indicates the potentially paralyzing virus is circulating widely in the area.\r\nBut infectiou… [+6863 chars]"},{"source":{"id":null,"name":"Nationworldnews.com"},"author":"https://www.facebook.com/nationworldnews1","title":"Cholesterol And Junk Food - Nation World News","description":"The daily requirement of fat through the diet should be at least 15%, but not oxidized or burned, which is found in junk food. If we don't give it what it","url":"https://nationworldnews.com/cholesterol-and-junk-food/","urlToImage":"https://nationworldnews.com/wp-content/uploads/2022/08/Cholesterol-and-Junk-Food.jpg","publishedAt":"2022-08-15T19:53:04Z","content":"The daily requirement of fat through the diet should be at least 15%, but not oxidized or burned, which is found in junk food. If we don’t give it what it needs, the body starts a process in which it… [+1314 chars]"},{"source":{"id":null,"name":"Managedhealthcareexecutive.com"},"author":"Christine Blank","title":"Adherence to Oral Anticancer Meds Low - Managed Healthcare Executive","description":"The researchers attributed low adherence to oral anti-cancer medications for blood cancer and certain other cancers to high monthly out-of-pocket among several other reasons.","url":"https://www.managedhealthcareexecutive.com/view/adherence-to-oral-anticancer-meds-low","urlToImage":"https://cdn.sanity.io/images/0vv8moc6/mhe/e4565fa49164c7b6baf1b5c75ba262410632d273-6000x4000.jpg?fit=crop&auto=format","publishedAt":"2022-08-15T19:52:30Z","content":"Adherence to oral anti-cancer medications is suboptimal particulary for blood cancer patients most commonly due to high out-of-pocket (OOP) costs, according to new research.\r\nPolicies addressing cost… [+3357 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"Science X staff","title":"Machine learning-based continuous glucose analysis shows promise for guiding personalized diabetes management - Medical Xpress","description":"A new automatic approach of classifying raw data from continuous glucose monitoring (CGM) has been proven feasible and shows potential for guiding glucose management among patients with diabetes, according to a recent study in Health Data Science.","url":"https://medicalxpress.com/news/2022-08-machine-learning-based-glucose-analysis-personalized.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2021/glucose-test.jpg","publishedAt":"2022-08-15T19:06:03Z","content":"A new automatic approach of classifying raw data from continuous glucose monitoring (CGM) has been proven feasible and shows potential for guiding glucose management among patients with diabetes, acc… [+4176 chars]"},{"source":{"id":null,"name":"Smallcapnews.co.uk"},"author":"Camelia Bacchus","title":"They could be early signs of ankylosing spondylitis - SmallCapNews.co.uk","description":"This condition is most frequently diagnosed in young adults and can begin up to the age of 20 years. Dr. Amaryles Perez de Jesus, rheumatologist. Photo: Journal of Medicine and…","url":"https://www.smallcapnews.co.uk/they-could-be-early-signs-of-ankylosing-spondylitis/","urlToImage":null,"publishedAt":"2022-08-15T18:57:43Z","content":"This condition is most frequently diagnosed in young adults and can begin up to the age of 20 years.\r\n Dr. Amaryles Perez de Jesus, rheumatologist. Photo: Journal of Medicine and Public Health.The Ba… [+4469 chars]"},{"source":{"id":null,"name":"Medscape"},"author":"M. Alexander Otto, PA, MMS","title":"Chemo May Not Offer Breast Cancer Survival Advantage After Age 80 - Medscape","description":"The findings can help oncologists counsel older patients about their treatment options. The study covered in this summary was published as a preprint and has not yet been peer reviewed.","url":"https://www.medscape.com/viewarticle/979236","urlToImage":"https://img.medscape.com/thumbnail_library/gty_220815_elderly_cancer_patient_800x450.jpg","publishedAt":"2022-08-15T18:49:12Z","content":"The study covered in this summary was published on researchsquare.com as a preprint and has not yet been peer reviewed.\r\nKey Takeaway\r\n<ul><li>Refusing chemotherapy for high-risk ER-positive breast c… [+2901 chars]"},{"source":{"id":null,"name":"Newswise"},"author":"Boston Children's Hospital","title":"The aging heart accumulates mutations — while losing the ability to repair them - Newswise","description":"Why does the risk of heart disease go up as we age? Known risk factors such as hypertension or high cholesterol don’t explain all cases.","url":"https://www.newswise.com/articles/the-aging-heart-accumulates-mutations-while-losing-the-ability-to-repair-them","urlToImage":"https://www.newswise.com/assets/new/img/newswise-logo-square.jpg","publishedAt":"2022-08-15T18:35:00Z","content":"Newswise — Why does the risk of heart disease go up as we age? Known risk factors such as hypertension or high cholesterol don’t explain all cases. A first-of-its-kind study from Boston Children’s Ho… [+5558 chars]"},{"source":{"id":null,"name":"Ascopost.com"},"author":null,"title":"NELSON Trial Protocol May Be More Sensitive Than NLST, May Increase Benefits of Lung Cancer Screening - The ASCO Post","description":null,"url":"https://ascopost.com/news/august-2022/nelson-trial-protocol-may-be-more-sensitive-than-nlst-may-increase-benefits-of-lung-cancer-screening/","urlToImage":"https://ascopost.com/media/14020506/tap-logo-meta.png","publishedAt":"2022-08-15T18:34:23Z","content":"By The ASCO Post StaffPosted: 8/15/2022 2:10:00 PM\r\n Last Updated: 8/15/2022 1:30:53 PM\r\nThe protocol used to screen and detect lung cancer in the NELSON trial may be more sensitive than the protocol… [+3216 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"ANI","title":"Sugar metabolism is typical in cancer, says study - ThePrint","description":"Washington [US], August 15 (ANI): Cancer cell metabolism has been perceived as somewhat of a conundrum for more than a century. Recent findings from Washington University in St. Louis academics suggest that it might not be an abnormality at all. The work was …","url":"https://theprint.in/health/sugar-metabolism-is-typical-in-cancer-says-study/1084090/","urlToImage":null,"publishedAt":"2022-08-15T18:14:23Z","content":"Washington [US], August 15 (ANI): Cancer cell metabolism has been perceived as somewhat of a conundrum for more than a century. Recent findings from Washington University in St. Louis academics sugge… [+4441 chars]"}]}