{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"The Weather Channel"},"author":null,"title":"Monkeypox Spreads to 42 Countries; 99 Per Cent Cases Detected Among Men : WHO Report | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel","description":"The majority of cases (98 per cent) have been reported since May 2022. - Articles from The Weather Channel | weather.com","url":"https://weather.com/en-IN/india/health/news/2022-06-20-monkeypox-spreads-to-42-countries","urlToImage":"https://s.w-x.co/in-monkeypox_lesions.jpg","publishedAt":"2022-06-21T16:33:47Z","content":"A total of 42 countries, both endemic and non-endemic, have reported 2,103 laboratory-confirmed cases of monkeypox, since the beginning of the year, according to the World Health Organisation (WHO).\r… [+3074 chars]"},{"source":{"id":null,"name":"Healio"},"author":null,"title":"Azithromycin did not reduce extent of structural lung disease in infants with cystic fibrosis - Healio","description":"Treatment with azithromycin from the time of diagnosis of cystic fibrosis in infancy did not reduce the extent of structural lung disease at age 36 months, but did reduce airway inflammation and morbidity, according to the COMBAT CF trial.In addition, azithro…","url":"https://www.healio.com/news/pulmonology/20220621/azithromycin-did-not-reduce-extent-of-structural-lung-disease-in-infants-with-cystic-fibrosis","urlToImage":"https://www.healio.com/~/media/slack-news/pulmonology/misc/infographics/2022/pulm0622stick_graphic_01.jpg","publishedAt":"2022-06-21T16:08:35Z","content":"Treatment with azithromycin from the time of diagnosis of cystic fibrosis in infancy did not reduce the extent of structural lung disease at age 36 months, but did reduce airway inflammation and morb… [+3475 chars]"},{"source":{"id":null,"name":"Eatthis.com"},"author":"Kayla Garritano","title":"7 Effortless Eating Habits for Faster Weight Loss, Say Dietitians — Eat This Not That - Eat This, Not That","description":"Looking for effortless eating habits to lose weight? Our expert dietitians give you tips on how to lose weight without the hassle.","url":"http://www.eatthis.com/effortless-eating-habits-weight-loss/","urlToImage":"https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/Vegetables-for-weight-loss.jpg?quality=82&strip=all","publishedAt":"2022-06-21T15:42:11Z","content":"Have you ever searched on the internet, for \"ways to lose weight without trying?\" You're definitely not the only one. We all want to lose weight easily, but we want to do it without putting in a ton … [+6106 chars]"},{"source":{"id":null,"name":"Police1.com"},"author":null,"title":"The skinny on nutrition trends - Police News","description":"Learn if eating plans such as keto, paleo, vegetarian, gluten-free and intermittent fasting are right for you","url":"https://www.police1.com/health-wellness/articles/the-skinny-on-nutrition-trends-IijsxLNnXJC48zBw/","urlToImage":"https://media.cdn.lexipol.com/article-images/vegetables-573958_1920.jpg?w=1600&format=jpg&quality=87&crop=117%2C0%2C1920%2C1080","publishedAt":"2022-06-21T15:31:50Z","content":"By Aaron Zamzow\r\nDo a Google search about diet plans and youll find more than 100 different options: the TLC diet, volumizing, flexitarian, Mayo clinic, Nordic, Jenny Craig the list goes on and on. B… [+13631 chars]"},{"source":{"id":null,"name":"Pulmonologyadvisor.com"},"author":null,"title":"Can Vitamin D Supplementation Protect Health Care Workers From COVID-19? - Pulmonology Advisor","description":"Does vitamin D supplementation effectively prevent COVID-19 infection in those with high exposure to infected individuals — and is it safe?","url":"https://www.pulmonologyadvisor.com/general-medicine/can-vitamin-d-supplements-prevent-covid19-infection/","urlToImage":"https://www.pulmonologyadvisor.com/wp-content/uploads/sites/21/2021/04/Vitamin.D.Capsules_G_1178747475.jpg","publishedAt":"2022-06-21T15:11:00Z","content":"Vitamin D supplements may help individuals with high exposure to COVID-19 prevent infection without causing serious adverse events, according to study findings published in Archives of Medical Resear… [+2799 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Micro-device could pick up early signs of heart attack or stroke - Phys.org","description":"In Australia each year, approximately 55,000 people suffer a heart attack, with a similar number suffering from stroke. Many are caused by blood clots that block the flow of blood to the heart, often in at-risk individuals without any physical warning.","url":"https://phys.org/news/2022-06-micro-device-early-heart.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/micro-device-could-pic.jpg","publishedAt":"2022-06-21T15:10:25Z","content":"In Australia each year, approximately 55,000 people suffer a heart attack, with a similar number suffering from stroke. Many are caused by blood clots that block the flow of blood to the heart, often… [+3149 chars]"},{"source":{"id":null,"name":"Medscape"},"author":"Miriam E. Tucker","title":"Empagliflozin Eyed for Outpatient Chronic Hyponatremia - Medscape","description":"The SGLT2 inhibitor increased sodium and reduced neurocognitive dysfunction in patients with chronic hyponatremia due to the syndrome of inappropriate antidiuresis.","url":"https://www.medscape.com/viewarticle/975949","urlToImage":"https://img.medscape.com/thumbnail_library/Medscape_News.jpg","publishedAt":"2022-06-21T14:55:06Z","content":"Empagliflozin is a potential treatment for outpatients with chronic hyponatremia due to the syndrome of inappropriate antidiuresis (SIAD), new data suggest. \r\nThe sodium-glucose cotransporter 2 (SGLT… [+6535 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"PTI","title":"Omicron less likely to cause Long Covid than Delta variant: Lancet study - The Indian Express","description":"Researchers found that the odds of experiencing long Covid were between 20-50 per cent less during the Omicron period versus the Delta period, depending on age and time since vaccination.","url":"https://indianexpress.com/article/world/omicron-less-likely-long-covid-delta-7981954/","urlToImage":"https://images.indianexpress.com/2022/02/Omicron-subvariant-BA.2.jpg","publishedAt":"2022-06-21T14:48:49Z","content":"The Omicron variant of the SARS-CoV-2 virus is less likely to cause long Covid than the Delta strain, according to a study published in The Lancet journal.Long Covid is defined as having new or ongoi… [+1699 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"Science X staff","title":"'Goldilocks' treatment window could lead to cancer therapy without harmful side effects - Medical Xpress","description":"Researchers have developed a way to potentially reduce the toxic side-effects of a type of immunotherapy, in findings that could overcome the pioneering treatment's biggest limitation.","url":"https://medicalxpress.com/news/2022-06-goldilocks-treatment-window-cancer-therapy.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/goldilocks-treatment-w-1.jpg","publishedAt":"2022-06-21T14:38:55Z","content":"Learning the rules for programming self-associating membrane proteins (MPs). (a) Rosetta fold, dock, and design uses backbone fragments from natural MPs to construct symmetric, de novo architectures … [+7600 chars]"},{"source":{"id":null,"name":"The Siasat Daily"},"author":"IANS","title":"How Netflix-style algorithm may help in personalising cancer treatments - The Siasat Daily","description":"Just as Netflix algorithm generates data to determine the shows one can choose to binge watch next, doctors will soon be able to predict","url":"https://www.siasat.com/how-netflix-style-algorithm-may-help-in-personalising-cancer-treatments-2353872/","urlToImage":"https://cdn.siasat.com/wp-content/uploads/2022/06/vasdvbdvbd.jpg","publishedAt":"2022-06-21T14:03:00Z","content":"London: Just as Netflix algorithm generates data to determine the shows one can choose to binge watch next, doctors will soon be able to predict how tumours can behave and thus offer personalised can… [+2559 chars]"},{"source":{"id":null,"name":"Medical Dialogues"},"author":"Dr. Hiral patel","title":"Anti-tau antibody Semorinemab fails to slow Alzheimers disease progression: JAMA - Medical Dialogues","description":"USA: A 73-week, phase 2, randomized clinical trial data published in JAMA Neurology showed that...","url":"https://medicaldialogues.in/neurology-neurosurgery/news/anti-tau-antibody-semorinemab-fails-to-slow-alzheimers-disease-progression-jama-94711","urlToImage":"https://medicaldialogues.in/h-upload/2022/06/18/178895-image.jpg","publishedAt":"2022-06-21T14:00:06Z","content":"USA: A 73-week, phase 2, randomized clinical trial data published in JAMA Neurology showed that semorinemab did not slow clinical AD progression compared to placebo but it did demonstrate an acceptab… [+2920 chars]"},{"source":{"id":null,"name":"The Guardian"},"author":"Guardian staff reporter","title":"Stress voice: how a hard day at work changes the way you talk - The Guardian","description":"Researchers have discovered that we speak more loudly and quickly after a testing time – even if we now feel calmer","url":"https://amp.theguardian.com/money/2022/jun/21/stress-voice-hard-day-work-talk-speak-loudly","urlToImage":null,"publishedAt":"2022-06-21T13:53:00Z","content":"Pass notesResearchers have discovered that we speak more loudly and quickly after a testing time even if we now feel calmer\r\nTue 21 Jun 2022 08.53 EDT\r\nName: Stress voice.\r\nAge: Look it up yourself.\r… [+2916 chars]"},{"source":{"id":null,"name":"Eatthis.com"},"author":"Kelsey Lorencz, RDN","title":"4 Worst Breakfast Habits To Avoid if You Have High Cholesterol — Eat This Not That - Eat This, Not That","description":"Dietitians recommend that you should avoid these four breakfast habits everyday if you have high cholesterol.","url":"http://www.eatthis.com/worst-breakfast-habits-high-cholesterol/","urlToImage":"https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/high-cholesterol-foods.jpg?quality=82&strip=all","publishedAt":"2022-06-21T13:36:56Z","content":"High cholesterol may seem harmless, as there are no signs or symptoms, but left unchecked this condition can be dangerous.\r\nAccording to the Centers for Disease Control, up to 38% of Americans have h… [+4826 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Joe Sommerlad","title":"Two new Covid sub-variants are sparking global concern - what you need to know - The Independent","description":"BA.4 and BA.5 strains contain mutations evolved to target human lung cells, potentially making them more dangerous than other recent coronavirus sub-lineages","url":"https://www.independent.co.uk/news/world/americas/covid-omicron-sub-variant-cases-cdc-b2105739.html","urlToImage":"https://static.independent.co.uk/2022/05/27/02/00aab1c67af0467a8e524b1d7594eb82Y29udGVudHNlYXJjaGFwaSwxNjUzNzAxMDIz-2.66442754.jpg?quality=75&width=1200&auto=webp","publishedAt":"2022-06-21T12:55:21Z","content":"Concern is growing over two new sub-variants of Covid-19 that have driven up infection rates in the UK, inspiring fears that other countries could soon likewise see a resurgence in cases.\r\nKnown as B… [+4218 chars]"},{"source":{"id":null,"name":"OI Canadian"},"author":"Tammy Sewell","title":"Malaria epidemic – Sahel Intelligence - OI Canadian","description":"At least 50 people have been admitted to various health facilities in the Kerio Valley following an outbreak of malaria, amid a shortage of drugs to treat the disease. The worst affected area is Endo","url":"https://oicanadian.com/malaria-epidemic-sahel-intelligence/","urlToImage":"https://sahel-intelligence.com/wp-content/uploads/2022/06/le-kenyatta-national-hospital-qui-est-aussi-un-centre-hospitalier-universitaire-est-le-plus-ancien-et-le-plus-important-hopital-du-kenya-photo-afp-tony-karumba-1520059552.jpg","publishedAt":"2022-06-21T12:53:58Z","content":"At least 50 people have been admitted to various health facilities in the Kerio Valley following an outbreak of malaria, amid a shortage of drugs to treat the disease.\r\nThe worst affected area is End… [+1053 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Zarafshan Shiraz","title":"Eyes health tips: Correct these 5 everyday habits that could lead to poor vision - Hindustan Times","description":"Watch out for these 5 everyday habits that may contribute to poor eye health and break them to maintain a healthy vision for the rest of your life","url":"https://www.hindustantimes.com/photos/lifestyle/eyes-health-tips-correct-these-5-everyday-habits-that-could-lead-to-poor-vision-101655811444546.html","urlToImage":"https://images.hindustantimes.com/img/2022/06/21/1600x900/pexels-anna-shvets-4557831_1655812249062_1655814745049.jpg","publishedAt":"2022-06-21T12:37:12Z","content":"Watch out for these 5 everyday habits that may contribute to poor eye health and break them to maintain a healthy vision for the rest of your life ...read more\r\nA bad eyesight may be a result of habi… [+914 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"TIMESOFINDIA.COM","title":"Coronavirus explainer: THESE COVID symptoms remain longer than expected - Times of India","description":"The coronavirus which is notorious for spreading the COVID infection is going to remain with us for some time now. Only COVID appropriate behaviour can help us stay safe and protect us from contracting the infection.","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-explainer-these-covid-symptoms-remain-longer-than-expected/photostory/92358253.cms","urlToImage":"https://static.toiimg.com/photo/msid-92360420.cms","publishedAt":"2022-06-21T12:30:00Z","content":"COVID is primarily a respiratory tract infection. Considering the immune host response and the viral load it can be said that the virus can put a scarring effect on the normal breathing of an infecte… [+577 chars]"},{"source":{"id":null,"name":"News18"},"author":"News18","title":"Breathing in Polluted Air May Contribute to Brain Disorders: Study - News18","description":"An international team of scientists found a possible direct pathway used by various inhaled fine particles through blood circulation with indications that, once there, the particles stay longer in the brain than in other main metabolic organs","url":"https://www.news18.com/news/world/breathing-in-polluted-air-may-contribute-to-brain-disorders-study-5415505.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/brain-165581295916x9.png","publishedAt":"2022-06-21T12:29:50Z","content":"Breathing in polluted air could lead to toxic particles being transported from lungs to brain, potentially contributing to brain disorders and neurological damage, according to a study. An internatio… [+2457 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"COVID and the threat to your heart - News 8 WROC","description":"There is new research about the long-term consequences of a COVID-19 infection as it relates to cardiovascular disease.","url":"https://www.youtube.com/watch?v=6iV3QgBJbHo","urlToImage":"https://i.ytimg.com/vi/6iV3QgBJbHo/hqdefault.jpg","publishedAt":"2022-06-21T12:27:29Z","content":null},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Brand Studio","title":"Get your child monsoon ready with the flu shot - Hindustan Times","description":"HT Spotlight's latest session titled “VaxTalk: Is your kid ready to get back to school after vacations?” had MD and renowned pediatrician Dr Chetan Trivedi and pilot and influencer Ritu Rathee Taneja discuss the apprehensions parents have around the health of…","url":"https://www.hindustantimes.com/brand-stories/get-your-child-monsoon-ready-with-the-flu-shot-101655809054559.html","urlToImage":"https://images.hindustantimes.com/img/2022/06/21/1600x900/Article_(1)_1655809401017_1655809410727.jpg","publishedAt":"2022-06-21T12:27:16Z","content":"Over the past two years, children have led protected, largely indoor lives as a large majority are yet to be vaccinated for Covid-19. But, as they start to step out, parents must ensure that their im… [+5790 chars]"}]}