{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"ANI News"},"author":null,"title":"WHO says Monkeypox vaccines efficacy below 100 per cent - ANI News","description":"Geneva [Switzerland], August 18 (ANI): Vaccines against monkeypox are not 100 per cent effective and that is why, people must reduce their own risks of infection, WHO technical lead Rosamund Lewis said on Wednesday.","url":"https://www.aninews.in/news/world/europe/who-says-monkeypox-vaccines-efficacy-below-100-per-cent20220818044532","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220817224112.jpg","publishedAt":"2022-08-17T23:15:00Z","content":"Geneva [Switzerland], August 18 (ANI): Vaccines against monkeypox are not 100 per cent effective and that is why, people must reduce their own risks of infection, WHO technical lead Rosamund Lewis sa… [+2175 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Arkansas Children's Hosiptal sees increase in respiratory syncytial virus infections - THV11","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DW9Vhw6ylSgk","urlToImage":null,"publishedAt":"2022-08-17T22:10:53Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Understanding Polio: CLT schools require vaccinations - Queen City News","description":"Novant Health said that while a recent case was confirmed in New York, the patient was unvaccinated and there is no reason for concern.Thanks for stopping by...","url":"https://www.youtube.com/watch?v=BrQY1hEqTco","urlToImage":"https://i.ytimg.com/vi/BrQY1hEqTco/hqdefault.jpg","publishedAt":"2022-08-17T21:21:14Z","content":null},{"source":{"id":null,"name":"Dailyexcelsior.com"},"author":"https://www.facebook.com/dailyexcelsior","title":"Malaria vax to benefit millions: Unicef - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories","description":"United Nations, Aug 17: British pharmaceutical company GSK has been awarded a contract to produce the world’s first malaria vaccine so that millions more children will be protected against the killer disease, the UN Children’s Fund (UNICEF) announced. The lan…","url":"https://www.dailyexcelsior.com/malaria-vax-to-benefit-millions-unicef/","urlToImage":"https://www.dailyexcelsior.com/wp-content/uploads/2022/08/download-15-11.jpg","publishedAt":"2022-08-17T19:28:40Z","content":"United Nations, Aug 17: British pharmaceutical company GSK has been awarded a contract to produce the world’s first malaria vaccine so that millions more children will be protected against the killer… [+1873 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Teena Thacker","title":"'Covid Infection can Cause Neurological, Psychiatric Issues' - Economic Times","description":"The study found that contrary to the notion that the Omicron variant is mild, Omicron is associated with similar neurological and psychiatric risks as Delta that the World Health Organization (WHO) had declared a variant of concern.","url":"https://economictimes.indiatimes.com/news/science/covid-infection-can-cause-neurological-psychiatric-issues/articleshow/93624623.cms","urlToImage":"https://img.etimg.com/thumb/msid-93624664,width-1070,height-580,imgsize-25916,overlay-economictimes/photo.jpg","publishedAt":"2022-08-17T19:01:00Z","content":"New Delhi: There is an elevated risk of developing neurological and psychiatric conditions, including psychosis, dementia, brain fog and seizures, for two years after Covid-19 infection compared to o… [+1319 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Zimbabwean authorities say at least 157 children died due to measles outbreak - SABC News","description":"Zimbabwean authorities say at least 157 children have died as a result of the ongoing measles outbreak. The outbreak, which was first reported in Manicaland ...","url":"https://www.youtube.com/watch?v=yg1EGdANOpA","urlToImage":"https://i.ytimg.com/vi/yg1EGdANOpA/maxresdefault.jpg","publishedAt":"2022-08-17T18:30:20Z","content":null},{"source":{"id":null,"name":"The New Indian Express"},"author":"ANI","title":"Over 35,000 cases of monkeypox detected globally: WHO - The New Indian Express","description":"According to the CDC, the researchers are investigating whether the virus can be spread by someone who has no symptoms or through semen, vaginal fluids and faecal matter.","url":"https://www.newindianexpress.com/world/2022/aug/17/over-35000-cases-of-monkeypox-detected-globally-who-2488525.html","urlToImage":"https://images.newindianexpress.com/uploads/user/imagelibrary/2022/8/4/w600X390/Monkeypox_AP22209777470673_.jpg","publishedAt":"2022-08-17T18:00:00Z","content":"GENEVA: More than 35,000 cases of monkeypox have now been reported from 92 countries and territories, the World Health Organisation (WHO) said on Wednesday.\r\nSpeaking at the media briefing on monkeyp… [+3814 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"WHO renames two known lineages of monkeypox virus; they will be referred to using Roman numerals - WION","description":"Experts warn that the name monkeypox may stigmatise the primates it was named after. It is named after monkeys, who play little role in its spread","url":"https://www.wionews.com/world/who-renames-two-known-lineages-of-monkeypox-virus-they-will-be-referred-to-using-roman-numerals-507860","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/29/282924-monkeypox-2.png","publishedAt":"2022-08-17T16:59:51Z","content":"The World Health Organization (WHO) renamed the two known clades (or lineages), of the fast-spreading monkeypox virus Monday (August 15). WHO chief said that now the lineages will be referred to usin… [+1901 chars]"},{"source":{"id":null,"name":"India.com"},"author":"Zee Media Bureau","title":"Swine Flu THREAT in Delhi? Experts warn about spike - Know symptoms, causes - Zee News","description":"Experts have warned that there could be an outbreak of swine flu and other viral illnesses in the capital, flagging disruptions in flu vaccination for the last two years owing to the Covid pandemic.","url":"https://zeenews.india.com/india/swine-flu-threat-in-delhi-experts-warn-about-spike-know-symptoms-causes-2498354.html","urlToImage":"https://english.cdn.zeenews.com/sites/default/files/2022/08/17/1078912-untitled-design-72.png","publishedAt":"2022-08-17T16:51:22Z","content":"New Delhi: Experts have warned that there could be an outbreak of swine flu and other viral illnesses in the capital, flagging disruptions in flu vaccination for the last two years owing to the Covid… [+2807 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"40-year-old German man with severe monkeypox tests HIV positive, diagnosis after painful red spot on nose - India Today","description":"A man in Germany tested positive for HIV after he developed a rare and painful red spot on his nose.","url":"https://www.indiatoday.in/world/story/monkeypox-germany-hiv-positive-virus-std-sti-1989193-2022-08-17","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/monkeypox-647x363.jpeg?tB9ilR4WV13pCWwMbP0zjtqwfhjOnEet","publishedAt":"2022-08-17T15:16:42Z","content":"Amounting to a bizarre fold of events in Germany, a 40-year-old monkeypox patient was diagnosed with HIV after being dismissed for mere sunburn initially. In what appeared to be a single red spot on … [+3104 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Parmita Uniyal","title":"Fitness tips after 60: How to maintain healthy weight - Hindustan Times","description":"Nutrition needs for elderly are different from those of young and one needs to make some essential lifestyle changes for maintaining healthy weight. | Health","url":"https://www.hindustantimes.com/lifestyle/health/fitness-tips-after-60-how-to-maintain-healthy-weight-101660748744603.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/17/1600x900/elderly_cycling_1660748840721_1660748857455_1660748857455.jpg","publishedAt":"2022-08-17T15:12:18Z","content":"As the ageing process speeds up post 60, factors like maintaining a healthy weight apart from keeping muscle mass and focussing on bone health become important for optimum fitness. It is no longer ab… [+1945 chars]"},{"source":{"id":null,"name":"Cureus.com"},"author":null,"title":"Neurological Presentation of Invasive Mucormycosis - Cureus","description":"An elderly female presented to the emergency department with a right-sided facial droop and headache for two weeks. Investigations revealed poorly controlled diabetes, and the patient was found to be in diabetic ketoacidosis. Maxillofacial computed tomography…","url":"https://www.cureus.com/articles/105305-neurological-presentation-of-invasive-mucormycosis","urlToImage":"https://assets.cureus.com/uploads/figure/file/410778/article_river_ba9a031000cb11eda802cb855b89a06a-figure-2-.png","publishedAt":"2022-08-17T15:01:06Z","content":"An elderly female presented to the emergency department with a right-sided facial droop and headache for two weeks. Investigations revealed poorly controlled diabetes, and the patient was found to be… [+11410 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"New York Times","title":"Why a century-old vaccine offers new hope against pathogens - Moneycontrol","description":"The Bacillus-Calmette-Guerin vaccine has long been known to have broad effects on the immune system, and is still given to infants in the developing world and in countries where TB is prevalent.","url":"https://www.moneycontrol.com/news/trends/health-trends/why-a-century-old-vaccine-offers-new-hope-against-pathogens-9046841.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/07/Vaccine-770x433.jpg","publishedAt":"2022-08-17T14:58:24Z","content":"In the early days of the COVID-19 pandemic, when prevention seemed light years away, several scientists launched trials to see whether a tuberculosis vaccine developed in the early 1900s might protec… [+6948 chars]"},{"source":{"id":null,"name":"Medscape"},"author":"Marlene Busko","title":"Long COVID Case Study: Persistent Hormone Deficiencies - Medscape","description":"'It might be worthwhile to screen for endocrine dysfunction in patients with...persistent symptoms after their recovery from acute [COVID] disease,' authors of a case study of long COVID suggest.","url":"https://www.medscape.com/viewarticle/979314","urlToImage":"https://img.medscape.com/thumbnail_library/dt_220817_word_long_covid_800x450.jpg","publishedAt":"2022-08-17T14:54:07Z","content":"Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nA case study of a 65-year-old man in Japan with long COVID describes how he recovered from certai… [+4224 chars]"},{"source":{"id":null,"name":"Down To Earth Magazine"},"author":null,"title":"Antimicrobial resistant bacteria found in newborn children - Down To Earth Magazine","description":"These superbugs were most likely transmitted from mothers or the hospital environment to the newborns","url":"https://www.downtoearth.org.in/video/health/antimicrobial-resistant-bacteria-found-in-newborn-children-84370","urlToImage":"https://i.ytimg.com/vi/CWqSzUNzoUc/hqdefault.jpg","publishedAt":"2022-08-17T14:43:29Z","content":"These superbugs were most likely transmitted from mothers or the hospital environment to the newbornsA new study has confirmed the presence of antibiotic-resistant bacteria in newborn babies within a… [+2698 chars]"},{"source":{"id":null,"name":"Insideprecisionmedicine.com"},"author":"Julianna LeMieux, PhD","title":"Cancer Vaccine Prevents Recurrence in Mice - Inside Precision Medicine","description":"Scientists demonstrate an endogenously lymph node-targeting lipid nanoparticle (LNP), without the modification of any active targeting ligands, for developing an mRNA cancer vaccine. This method of targeting cancer in mice eliminated tumors and even prevented…","url":"https://www.insideprecisionmedicine.com/topics/oncology/cancer-vaccine-prevents-recurrence-in-mice/","urlToImage":"https://www.insideprecisionmedicine.com/wp-content/uploads/2019/01/1550-scaled.jpeg","publishedAt":"2022-08-17T14:37:03Z","content":"Scientists demonstrate an endogenously lymph node-targeting lipid nanoparticle (LNP), without the modification of any active targeting ligands, for developing an mRNA cancer vaccine. This method of t… [+3099 chars]"},{"source":{"id":null,"name":"Medical Dialogues"},"author":"Dr. Hiral patel","title":"Left atrial strain on CMR, a useful prognostic marker in dilated cardiomyopathy: JACC - Medical Dialogues","description":"Netherlands: Left atrial conduit strain is a promising independent prognostic predictor in patients...","url":"https://medicaldialogues.in/cardiology-ctvs/news/left-atrial-strain-on-cmr-a-useful-prognostic-marker-in-dilated-cardiomyopathy-jacc-97592","urlToImage":"https://medicaldialogues.in/h-upload/2022/07/18/181082-untitled-design-56.jpg","publishedAt":"2022-08-17T14:30:49Z","content":"Netherlands: Left atrial conduit strain is a promising independent prognostic predictor in patients with dilated cardiomyopathy, incremental to LGE and superior to LVEF, LAVI, and LV-GLS, states an a… [+3114 chars]"},{"source":{"id":null,"name":"Medical Dialogues"},"author":"Medha Baranwal","title":"Non-dipping and higher nocturnal BP tied to mortality risk in type 1 diabetes: Study - Medical Dialogues","description":"Denmark: Non-dipping of nocturnal blood pressure increases the risk of mortality and kidney disease...","url":"https://medicaldialogues.in/diabetes-endocrinology/news/non-dipping-and-higher-nocturnal-bp-tied-to-mortality-risk-in-type-1-diabetes-study-97663","urlToImage":"https://medicaldialogues.in/h-upload/2021/04/30/151795-blood-pressure.jpg","publishedAt":"2022-08-17T14:30:34Z","content":"Denmark: Non-dipping of nocturnal blood pressure increases the risk of mortality and kidney disease in patients with type 1 diabetes, researchers find in a new study published in the Journal of Diabe… [+2199 chars]"},{"source":{"id":null,"name":"Dovepress.com"},"author":"Dove Press","title":"MiR-204-5p alleviates neuropathic pain by targeting BRD4 | JPR - Dove Medical Press","description":"Exploring the level and role of miR-204-5p in the chronic constrictive injury (CCI) model of rats. Read more","url":"https://www.dovepress.com/mir-204-5p-alleviates-neuropathic-pain-by-targeting-brd4-in-a-rat-chro-peer-reviewed-fulltext-article-JPR","urlToImage":"https://www.dovepress.com/assets/img/addon/og_logo.png","publishedAt":"2022-08-17T13:51:48Z","content":"Introduction\r\nNeuropathic pain is a nervous system disease caused by primary pathological changes or dysfunction of central or peripheral nervous system, which is characterized by allodynia and hyper… [+26508 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Gay Adult Film Actor's Graphic Post Of Painful Monkeypox Rash Goes Viral - NDTV","description":"Silver Steele said that he also fainted due to the painful rash around his mouth.","url":"https://www.ndtv.com/world-news/gay-adult-film-actor-silver-steeles-graphic-post-of-painful-monkeypox-rash-goes-viral-3262765","urlToImage":"https://c.ndtvimg.com/2022-08/b45jdg3k_-silver-steele-instagram_625x300_17_August_22.jpg","publishedAt":"2022-08-17T13:51:06Z","content":"Silver Steele shared a collage of his monkeypox rash.\r\nA social media post detailing a man's experience of monkeypox has gone viral. Silver Steele, who is a gay adult film star, has documented the sy… [+1796 chars]"}]}