{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"The Lancet"},"author":null,"title":"Home as the new frontier for the treatment of COVID-19: the case for anti-inflammatory agents - The Lancet","description":"COVID-19, caused by SARS-CoV-2, is characterised by a broad spectrum of symptom severity\nthat requires varying amounts of care according to the different stages of the disease.\nIntervening at the onset of mild to moderate COVID-19 symptoms in the outpatient s…","url":"https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00433-9/fulltext","urlToImage":"//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/21ff3e2f-0af0-4523-a98b-355536abd063/gr1.jpg","publishedAt":"2022-08-25T22:38:14Z","content":"We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"},{"source":{"id":null,"name":"Dailypioneer.com"},"author":"The Pioneer","title":"'Monkeypox cases drop 21%, reversing month-long increase' - Daily Pioneer","description":"The number of monkeypox cases reported globally dropped by 21% in the last week, reversing a month-long trend of rising infections and a possible signal the outbreak in Europe may be starting to decline, according to a World Health Organisation report issued …","url":"https://www.dailypioneer.com/2022/world/---monkeypox-cases--drop-21---reversing--month-long-increase---.html","urlToImage":"https://www.dailypioneer.com/images/logo.jpg","publishedAt":"2022-08-25T20:53:08Z","content":"The number of monkeypox cases reported globally dropped by 21% in the last week, reversing a month-long trend of rising infections and a possible signal the outbreak in Europe may be starting to decl… [+2725 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Priyanka Sharma","title":"Covid shaping up like common cold, but be cautious: NTAGI chief | Mint - Mint","description":"mRNA & intranasal covid vaccines have the potential for precaution dose as and when appropriate data is available, says Dr N.K. Arora, Chairman, NTAGI","url":"https://www.livemint.com/companies/people/covid-shaping-up-like-common-cold-but-be-cautious-ntagi-chief-11661445136840.html","urlToImage":"https://images.livemint.com/img/2022/08/25/600x338/nkarora_1661445401831_1661445446331_1661445446331.jpg","publishedAt":"2022-08-25T19:23:19Z","content":"NEW DELHI : Dr N.K. Arora, chairman of the governments covid-19 working group of the National Technical Advisory Group on Immunization (NTAGI) said the disease is taking a shape of normal influenza. … [+2980 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"ANI","title":"Research at Yale University reveals how human brain is different - ThePrint","description":"Connecticut [US], August 26 (ANI): What distinguishes the human brain from all other animal brains, even those of our closest primate relatives? Researchers from Yale University discovered species-specific characteristics in the prefrontal cortex of four diff…","url":"https://theprint.in/health/research-at-yale-university-reveals-how-human-brain-is-different/1100664/","urlToImage":null,"publishedAt":"2022-08-25T19:13:23Z","content":"Connecticut [US], August 26 (ANI): What distinguishes the human brain from all other animal brains, even those of our closest primate relatives? Researchers from Yale University discovered species-sp… [+3042 chars]"},{"source":{"id":null,"name":"Cureus.com"},"author":null,"title":"A Case of Gastric Diverticulum Presenting As Upper Gastrointestinal Bleeding in Rural Central India - Cureus","description":"Gastric diverticula (GD) are the least prevalent type of gastrointestinal diverticula and are extremely uncommon anatomical anomalies in general. Although the majority of GD cases are asymptomatic and are identified by chance during normal diagnostic testing,…","url":"https://www.cureus.com/articles/104652-a-case-of-gastric-diverticulum-presenting-as-upper-gastrointestinal-bleeding-in-rural-central-india","urlToImage":"https://assets.cureus.com/uploads/figure/file/405204/article_river_b19b2740f90911ec97c2bb496adb5c7b-Screenshot-24-.png","publishedAt":"2022-08-25T18:58:55Z","content":"Gastric diverticula (GD) are the least prevalent type of gastrointestinal diverticula and are extremely uncommon anatomical anomalies in general. Although the majority of GD cases are asymptomatic an… [+9701 chars]"},{"source":{"id":null,"name":"Dailyexcelsior.com"},"author":"https://www.facebook.com/dailyexcelsior","title":"Study: Pfizer COVID pill showed no benefit in younger adults - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories","description":"WASHINGTON, Aug 25:Pfizer’s COVID-19 pill appears to provide little or no benefit for younger adults, while still reducing the risk of hospitalization and death for high-risk seniors, according to a large study published Wednesday. The results from a 109,000-…","url":"https://www.dailyexcelsior.com/study-pfizer-covid-pill-showed-no-benefit-in-younger-adults/","urlToImage":"https://www.dailyexcelsior.com/wp-content/uploads/2022/08/download-2-30.jpg","publishedAt":"2022-08-25T18:56:58Z","content":"WASHINGTON, Aug 25:Pfizer’s COVID-19 pill appears to provide little or no benefit for younger adults, while still reducing the risk of hospitalization and death for high-risk seniors, according to a … [+4123 chars]"},{"source":{"id":null,"name":"Deccan Herald"},"author":"International New York Times","title":"Long Covid in children appears less common than early fears suggested - Deccan Herald","description":"Long Covid—the constellation of symptoms that can persist long after an initial coronavirus infection—has been a source of fear among parents throughout the pandemic. But just how often are children affected? Conflicting and evolving messages can leave a pare…","url":"https://www.deccanherald.com/science-and-environment/long-covid-in-children-appears-less-common-than-early-fears-suggested-1139401.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/26/child-covid-afp-1139401-1661454041.jpg","publishedAt":"2022-08-25T18:55:01Z","content":"Long Covidthe constellation of symptoms that can persist long after an initial coronavirus infectionhas been a source of fear among parents throughout the pandemic. But just how often are children af… [+9811 chars]"},{"source":{"id":null,"name":"Forbes"},"author":"Jennifer Kite-Powell","title":"See How This AI Analyzes Breathing Patterns For Early Detection Of Parkinson’s - Forbes","description":"A new study shows that an AI algorithm can detect whether someone has Parkinson’s Disease early on and estimate the severity of their disease.","url":"https://www.forbes.com/sites/jenniferhicks/2022/08/25/see-how-this-ai-analyzes-breathing-patterns-for-early-detection-of-parkinsons/","urlToImage":"https://imageio.forbes.com/specials-images/imageserve/6307c27c5ac6080dba1b5fd1/0x0.jpg?format=jpg&width=1200","publishedAt":"2022-08-25T18:49:09Z","content":"27 July 2022, Hamburg: Dilar Kisikyol (m), professional boxer &amp; social pedagogue leads a group of ... [+] eleven women who suffer from Parkinson's disease and undergo boxing training - When fists… [+2837 chars]"},{"source":{"id":null,"name":"India New England"},"author":"India New England News","title":"Smoking also leads to thicker, weaker hearts: Study - India New England","description":"New Delhi– It is well known that smoking causes blocked arteries, leading to coronary heart disease and stroke. A new study on Thursday warned that smoking also leads to thicker, weaker hearts. The researchers found that the more people smoked, the worse thei…","url":"https://indianewengland.com/smoking-also-leads-to-thicker-weaker-hearts-study/","urlToImage":"https://indianewengland.com/wp-content/uploads/2021/11/smoking.jpg","publishedAt":"2022-08-25T18:25:49Z","content":"New Delhi– It is well known that smoking causes blocked arteries, leading to coronary heart disease and stroke. A new study on Thursday warned that smoking also leads to thicker, weaker hearts.\r\nThe … [+2308 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"History Of Heterosexual Contact In Delhi's 3 Out 5 Monkeypox Cases, Says Top Scientific Body's Study - NDTV","description":"Three out of the five Monkeypox cases reported from Delhi had a history of heterosexual contact, said the preliminary study done by the Indian Council of Medical Research (ICMR)-National Institute of Virology (NIV), Pune.","url":"https://www.ndtv.com/india-news/history-of-heterosexual-contact-in-delhis-3-out-5-monkeypox-cases-says-icmr-study-3287492","urlToImage":"https://c.ndtvimg.com/2022-07/2jo6i268_how-monkeypox-spreads_625x300_28_July_22.jpg","publishedAt":"2022-08-25T18:22:14Z","content":"The rest of the two cases among five have no sexual contact. (Representational)\r\nNew Delhi: Three out of the five Monkeypox cases reported from Delhi had a history of heterosexual contact, said the p… [+2801 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"ANI","title":"Researchers develop a novel method to unveil hidden genome - ThePrint","description":"Washington [US], August 25 (ANI): Thousands of short RNA sequences that code for microproteins and peptides have been identified, opening new avenues for disease research and drug development. “Much of what we understand about the known two per cent of the ge…","url":"https://theprint.in/science/researchers-develop-a-novel-method-to-unveil-hidden-genome/1100632/","urlToImage":null,"publishedAt":"2022-08-25T18:14:46Z","content":"Washington [US], August 25 (ANI): Thousands of short RNA sequences that code for microproteins and peptides have been identified, opening new avenues for disease research and drug development.\r\n“Much… [+2923 chars]"},{"source":{"id":null,"name":"Slurrp.com"},"author":"Yash Lakhan","title":"6 Healthy Snacks To Help You Lose Weight - Slurrp","description":"Snacking can increase your intake of nutrient-dense meals like fruits and vegetables, which the majority of people do not eat enough of.","url":"https://www.slurrp.com/article/6-healthy-snacks-to-help-you-lose-weight-1661450229975","urlToImage":"https://images.slurrp.com/prod/articles/d8q7dgxdza.webp","publishedAt":"2022-08-25T18:06:14Z","content":"Snacking is the activity of eating meals throughout the day that are not your main meals. Between meals, snacks are frequently smaller meals. While research on whether snacking helps with weight redu… [+3939 chars]"},{"source":{"id":null,"name":"Weekly Blitz"},"author":"Raisa Mehzabeen","title":"Dietary changes in high cholesterol - Weekly Blitz","description":"High cholesterol levels increase over time due to several lifestyle factors, such as unhealthy eating habits, lack of exercise-related physical activity, smoking, and obesity. Since all of these factors depend on the choices we make in our lives, it is safe t…","url":"https://www.weeklyblitz.net/health/dietary-changes-in-high-cholesterol/","urlToImage":"https://www.weeklyblitz.net/wp-content/uploads/2022/08/Dietary-changes-in-high-cholesterol-1000x600.jpg","publishedAt":"2022-08-25T18:04:31Z","content":"High cholesterol levels increase over time due to several lifestyle factors, such as unhealthy eating habits, lack of exercise-related physical activity, smoking, and obesity. Since all of these fact… [+3844 chars]"},{"source":{"id":null,"name":"DNA India"},"author":"DNA Web Team","title":"Man tested positive for Covid-19, monkeypox, HIV all at once; doctors call it 'first ever' - DNA India","description":"In a first, man tested positive for Covid-19, monkeypox, and HIV-1 all at once.","url":"https://www.dnaindia.com/health/report-monkeypox-covid-hiv-international-man-tested-positive-for-all-desieses-at-once-italian-man-health-healt-2979591","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/25/2533228-untitled-design-2022-08-25t232538.121.jpg","publishedAt":"2022-08-25T17:51:00Z","content":"Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Aug 25, 2022, 11:30 PM ISTScientists have reported a first known case where a person in Italy has tested positive for Covid-19, m… [+1512 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Research identifies new role of immune cells in liver regeneration - ANI News","description":"Washington [US], August 25 (ANI): A MedUni Vienna research team has discovered the vital role of immune cells that boost the production of liver cells.","url":"https://www.aninews.in/news/science/research-identifies-new-role-of-immune-cells-in-liver-regeneration20220825232020","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220825171252.jpg","publishedAt":"2022-08-25T17:50:00Z","content":"Washington [US], August 25 (ANI): A MedUni Vienna research team has discovered the vital role of immune cells that boost the production of liver cells.The results of the study were recently published… [+2098 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Researchers reveal new approach to clear toxic waste from brain - ANI News","description":"Washington [US], August 25 (ANI): Researchers have found a new druggable pathway that potentially could be used to help prevent Alzheimer's dementia.","url":"https://www.aninews.in/news/science/researchers-reveal-new-approach-to-clear-toxic-waste-from-brain20220825231231","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220825172707.jpg","publishedAt":"2022-08-25T17:42:00Z","content":"Washington [US], August 25 (ANI): Researchers have found a new druggable pathway that potentially could be used to help prevent dementia.Amyloid beta accumulation in the brain is the first step in th… [+4891 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Research: Brain's spatial mapping is supported by molecular processes - ANI News","description":"Washington [US], August 25 (ANI): Research in mice has cast new light on the molecular mechanisms that underlie spatial mapping in the brain. Scientists have found that a gene called Fos plays a key role in helping the brain use specialized navigation cells t…","url":"https://www.aninews.in/news/science/research-brains-spatial-mapping-is-supported-by-molecular-processes20220825230211","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220825171446.jpg","publishedAt":"2022-08-25T17:32:00Z","content":"Washington [US], August 25 (ANI): Research in mice has cast new light on the molecular mechanisms that underlie spatial mapping in the brain. Scientists have found that a gene called Fos plays a key … [+2295 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Bimodal distribution pattern associated with the PCR cycle threshold (Ct) and implications in COVID-19 infections | Scientific Reports - Nature.com","description":"Scientific Reports - Bimodal distribution pattern associated with the PCR cycle threshold (Ct) and implications in COVID-19 infections","url":"https://www.nature.com/articles/s41598-022-18735-2","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-18735-2/MediaObjects/41598_2022_18735_Fig1_HTML.png","publishedAt":"2022-08-25T17:08:06Z","content":"In this analysis of 14,231 clinical SARS-CoV-2 PCR tests, two mainstream platforms for amplification and quantification of viral gene targets displayed similar analytic characteristics. Both the CDC … [+8948 chars]"},{"source":{"id":null,"name":"India.com"},"author":"India.com News Desk","title":"Centre on Alert As Tomato Flu Cases Witness Spike In India, Health Ministry Issues Advisory - India.com","description":"The first case of tomato flu was reported in Kollam district of Kerala on May 6 this year and as of July 26.","url":"https://www.india.com/news/india/centre-on-alert-as-tomato-flu-cases-witness-spike-in-india-health-ministry-issues-advisory-5593407/","urlToImage":"https://static.india.com/wp-content/uploads/2022/08/tomato-flu.jpg","publishedAt":"2022-08-25T16:38:16Z","content":"Tomato Flu: The rising cases of Tomato flu has become a major concern for the health experts. The country is on high alert after 82 children below the age of five sickened by the illness in southern … [+3640 chars]"},{"source":{"id":null,"name":"Cureus.com"},"author":null,"title":"Giant Hemorrhagic Pancreatic Pseudocyst: A Case Report and Guidelines for Care - Cureus","description":"Pancreatic pseudocysts are potential sequelae of acute or chronic pancreatitis. In some cases, enzymatic degradation of the lining between a pseudocyst and the splenic artery, or surrounding vessels, can occur, resulting in a hemorrhagic pancreatic pseudocyst…","url":"https://www.cureus.com/articles/104945-giant-hemorrhagic-pancreatic-pseudocyst-a-case-report-and-guidelines-for-care","urlToImage":"https://assets.cureus.com/uploads/figure/file/406638/article_river_e1bd40c018e411edbe308f6e59b7ce86-CT-1-and-2-Combined-Marked.png","publishedAt":"2022-08-25T16:27:09Z","content":"Pancreatic pseudocysts are a complication of either acute or chronic pancreatitis, and they occur in about 15% of patients with acute pancreatitis and 30-40% of patients with chronic pancreatitis [1,… [+14736 chars]"}]}