{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Hindustan Times"},"author":"HT News Desk","title":"Monkeypox cases jumped 20% last week to 35,000 across 92 countries: WHO - Hindustan Times","description":"WHO director-general Tedros Adhanom Ghebreyesus said vaccines may also play an important part in controlling the monkeypox outbreak, and in many countries, there is high demand for vaccines from the affected communities. | World News","url":"https://www.hindustantimes.com/world-news/monkeypox-cases-jumped-20-in-last-week-to-35-000-across-92-countries-who-101660749372055.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/17/1600x900/PERU-HEALTH-VIRUS-MONKEYPOX-6_1660751014187_1660751014187_1660751028900_1660751028900.jpg","publishedAt":"2022-08-17T15:46:34Z","content":"More than 35,000 cases of monkeypox have now been reported from 92 countries and territories, with almost 7,500 cases being registered last week - a 20 per cent increase, said World Health Organizati… [+1126 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"40-year-old German man with severe monkeypox tests HIV positive, diagnosis after painful red spot on nose - India Today","description":"A man in Germany tested positive for HIV after he developed a rare and painful red spot on his nose.","url":"https://www.indiatoday.in/world/story/monkeypox-germany-hiv-positive-virus-std-sti-1989193-2022-08-17","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/monkeypox-647x363.jpeg?tB9ilR4WV13pCWwMbP0zjtqwfhjOnEet","publishedAt":"2022-08-17T15:16:42Z","content":"Amounting to a bizarre fold of events in Germany, a 40-year-old monkeypox patient was diagnosed with HIV after being dismissed for mere sunburn initially. In what appeared to be a single red spot on … [+3104 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"New York Times","title":"Why a century-old vaccine offers new hope against pathogens - Moneycontrol","description":"The Bacillus-Calmette-Guerin vaccine has long been known to have broad effects on the immune system, and is still given to infants in the developing world and in countries where TB is prevalent.","url":"https://www.moneycontrol.com/news/trends/health-trends/why-a-century-old-vaccine-offers-new-hope-against-pathogens-9046841.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/07/Vaccine-770x433.jpg","publishedAt":"2022-08-17T14:58:24Z","content":"In the early days of the COVID-19 pandemic, when prevention seemed light years away, several scientists launched trials to see whether a tuberculosis vaccine developed in the early 1900s might protec… [+6948 chars]"},{"source":{"id":null,"name":"Medscape"},"author":"Marlene Busko","title":"Long COVID Case Study: Persistent Hormone Deficiencies - Medscape","description":"'It might be worthwhile to screen for endocrine dysfunction in patients with...persistent symptoms after their recovery from acute [COVID] disease,' authors of a case study of long COVID suggest.","url":"https://www.medscape.com/viewarticle/979314","urlToImage":"https://img.medscape.com/thumbnail_library/dt_220817_word_long_covid_800x450.jpg","publishedAt":"2022-08-17T14:54:07Z","content":"Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nA case study of a 65-year-old man in Japan with long COVID describes how he recovered from certai… [+4224 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"ANI","title":"Daily exercise is more beneficial than lengthier workout sessions: Research - Hindustan Times","description":"According to a recent study, a little bit of exercise every day is more effective than lengthier sessions spaced out over the course of the week. Fortunately, this research also implies that you don't need to put in a lot of effort each day. | Health","url":"https://www.hindustantimes.com/lifestyle/health/daily-exercise-is-more-beneficial-than-lengthier-workout-sessions-research-101660741906875.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/17/1600x900/study_1660743288317_1660743298016_1660743298016.JPG","publishedAt":"2022-08-17T14:44:39Z","content":"New research indicates a little bit of daily activity is more beneficial than longer periods of exercise spread out across the week and happily, it also suggests you don't have to put in a mountain o… [+5816 chars]"},{"source":{"id":null,"name":"Down To Earth Magazine"},"author":null,"title":"Antimicrobial resistant bacteria found in newborn children - Down To Earth Magazine","description":"These superbugs were most likely transmitted from mothers or the hospital environment to the newborns","url":"https://www.downtoearth.org.in/video/health/antimicrobial-resistant-bacteria-found-in-newborn-children-84370","urlToImage":"https://i.ytimg.com/vi/CWqSzUNzoUc/hqdefault.jpg","publishedAt":"2022-08-17T14:43:29Z","content":"These superbugs were most likely transmitted from mothers or the hospital environment to the newbornsA new study has confirmed the presence of antibiotic-resistant bacteria in newborn babies within a… [+2698 chars]"},{"source":{"id":null,"name":"Insideprecisionmedicine.com"},"author":"Julianna LeMieux, PhD","title":"Cancer Vaccine Prevents Recurrence in Mice - Inside Precision Medicine","description":"Scientists demonstrate an endogenously lymph node-targeting lipid nanoparticle (LNP), without the modification of any active targeting ligands, for developing an mRNA cancer vaccine. This method of targeting cancer in mice eliminated tumors and even prevented…","url":"https://www.insideprecisionmedicine.com/topics/oncology/cancer-vaccine-prevents-recurrence-in-mice/","urlToImage":"https://www.insideprecisionmedicine.com/wp-content/uploads/2019/01/1550-scaled.jpeg","publishedAt":"2022-08-17T14:37:03Z","content":"Scientists demonstrate an endogenously lymph node-targeting lipid nanoparticle (LNP), without the modification of any active targeting ligands, for developing an mRNA cancer vaccine. This method of t… [+3099 chars]"},{"source":{"id":null,"name":"Medical Dialogues"},"author":"Medha Baranwal","title":"Non-dipping and higher nocturnal BP tied to mortality risk in type 1 diabetes: Study - Medical Dialogues","description":"Denmark: Non-dipping of nocturnal blood pressure increases the risk of mortality and kidney disease...","url":"https://medicaldialogues.in/diabetes-endocrinology/news/non-dipping-and-higher-nocturnal-bp-tied-to-mortality-risk-in-type-1-diabetes-study-97663","urlToImage":"https://medicaldialogues.in/h-upload/2021/04/30/151795-blood-pressure.jpg","publishedAt":"2022-08-17T14:30:34Z","content":"Denmark: Non-dipping of nocturnal blood pressure increases the risk of mortality and kidney disease in patients with type 1 diabetes, researchers find in a new study published in the Journal of Diabe… [+2199 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"PTI","title":"Molbio Diagnostics launches Truenat RT-PCR test for HIV 1/ HIV 2 - ThePrint","description":"Panaji, Aug 17 (PTI) Molbio Diagnostics, an in-vitro diagnostics company and inventor of Truenat technology, on Wednesday said it has launched a new test for differential diagnosis of HIV 1 and HIV 2 with viral loads within 60 minutes. The company has said th…","url":"https://theprint.in/india/molbio-diagnostics-launches-truenat-rt-pcr-test-for-hiv-1-hiv-2/1086894/","urlToImage":null,"publishedAt":"2022-08-17T14:06:19Z","content":"Panaji, Aug 17 (PTI) Molbio Diagnostics, an in-vitro diagnostics company and inventor of Truenat technology, on Wednesday said it has launched a new test for differential diagnosis of HIV 1 and HIV 2… [+1000 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"Medical experts warn athletes against relying on unproven intravenous nutrition as trend grows in world sports - WION","description":"Medical experts advise professional athletes against the use of intravenous drips as their regular source of nutrition as the practice grows in international sports.","url":"https://www.wionews.com/sports/medical-experts-warn-athletes-against-relying-on-unproven-intravenous-nutrition-as-trend-grows-in-world-sports-507819","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/08/17/288435-untitled-design-80.png","publishedAt":"2022-08-17T14:02:07Z","content":"Intravenous drips, which were previously considered to be the last resort for those athletes suffering from anaemia and/or severe hydration issues, are seemingly threatening to become the norm among … [+2304 chars]"},{"source":{"id":null,"name":"Dovepress.com"},"author":"Dove Press","title":"MiR-204-5p alleviates neuropathic pain by targeting BRD4 | JPR - Dove Medical Press","description":"Exploring the level and role of miR-204-5p in the chronic constrictive injury (CCI) model of rats. Read more","url":"https://www.dovepress.com/mir-204-5p-alleviates-neuropathic-pain-by-targeting-brd4-in-a-rat-chro-peer-reviewed-fulltext-article-JPR","urlToImage":"https://www.dovepress.com/assets/img/addon/og_logo.png","publishedAt":"2022-08-17T13:51:48Z","content":"Introduction\r\nNeuropathic pain is a nervous system disease caused by primary pathological changes or dysfunction of central or peripheral nervous system, which is characterized by allodynia and hyper… [+26508 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Gay Adult Film Actor's Graphic Post Of Painful Monkeypox Rash Goes Viral - NDTV","description":"Silver Steele said that he also fainted due to the painful rash around his mouth.","url":"https://www.ndtv.com/world-news/gay-adult-film-actor-silver-steeles-graphic-post-of-painful-monkeypox-rash-goes-viral-3262765","urlToImage":"https://c.ndtvimg.com/2022-08/b45jdg3k_-silver-steele-instagram_625x300_17_August_22.jpg","publishedAt":"2022-08-17T13:51:06Z","content":"Silver Steele shared a collage of his monkeypox rash.\r\nA social media post detailing a man's experience of monkeypox has gone viral. Silver Steele, who is a gay adult film star, has documented the sy… [+1796 chars]"},{"source":{"id":null,"name":"The Weather Channel"},"author":null,"title":"First Case of Human-to-Dog Monkeypox Transmission Reported in France; WHO Instructs Infected Individuals to Isolate Pets - The Weather Channel","description":"According to Dr Rosamund Lewis, WHO Technical Lead on monkeypox, the first human-to-dog transmission of the virus is new but not surprising. - Articles from The Weather Channel | weather.com","url":"https://weather.com/en-IN/india/health/news/2022-08-17-who-instructs-individuals-infected-with-monkeypox-to-isolate-pets","urlToImage":"https://s.w-x.co/in-dog%20cat.jpg","publishedAt":"2022-08-17T13:39:56Z","content":"People infected with monkeypox must isolate their pets, said an official from the World Health Organisation (WHO) after a report showed the first-ever case of human-to-dog transmission of the virus i… [+2351 chars]"},{"source":{"id":null,"name":"DNA India"},"author":"DNA Web Desk","title":"Post-Covid condition can cause THIS heart problem: Know symptoms, lifestyle habits that can help - DNA India","description":"Long COVID is a condition in which the symptoms of a coronavirus stay longer and continue for several weeks or months following recovery.","url":"https://www.dnaindia.com/lifestyle/report-covid-19-post-covid-condition-long-covid-heart-problems-heart-palpitations-symptoms-lifestyle-habits-2977344","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/17/2530922-untitled-design-1.jpg","publishedAt":"2022-08-17T13:10:00Z","content":"Reported By:| Edited By: DNA Web Desk |Source: DNA Web Desk |Updated: Aug 17, 2022, 06:57 PM ISTRecent reports from India show a sudden increase in COVID-19 infections as the struggle against the glo… [+3979 chars]"},{"source":{"id":null,"name":"News-Medical.Net"},"author":null,"title":"Acid ceramidase is a SARS-CoV-2 host factor, study says - News-Medical.Net","description":"Fluoxetine, a common antidepressant, inhibits the SARS-CoV-2 coronavirus in cell cultures and in preparations from human lung tissue. This was demonstrated by researchers at Julius-Maximilians-Universität (JMU) Würzburg in the summer of 2020. However, the mec…","url":"https://www.news-medical.net/news/20220817/Acid-ceramidase-is-a-SARS-CoV-2-host-factor-study-says.aspx","urlToImage":"https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_-_molecules-Sebastian_Kaulitzki-2000_12b7886e43a74db8bd94fd774ce58a26-620x480.jpg","publishedAt":"2022-08-17T12:14:00Z","content":"Fluoxetine, a common antidepressant, inhibits the SARS-CoV-2 coronavirus in cell cultures and in preparations from human lung tissue. This was demonstrated by researchers at Julius-Maximilians-Univer… [+2249 chars]"},{"source":{"id":null,"name":"Healthshots.com"},"author":"Aayushi Gupta","title":"Youngsters are also at a risk of developing rheumatoid arthritis. 7 signs to watch out - Health shots","description":"Look out for these signs of rheumatoid arthritis in young people because, according to this study, you're also susceptible to developing this condition.","url":"https://www.healthshots.com/preventive-care/self-care/7-signs-of-rheumatoid-arthritis-in-young-people/","urlToImage":"https://images.healthshots.com/healthshots/en/uploads/2022/08/17151427/knee-pain.jpg","publishedAt":"2022-08-17T11:46:58Z","content":"Rheumatoid arthritis (RA) is one serious joint condition. It is an autoimmune disease that affects the ends of bones and makes movements difficult in arthritis patients. It is typically a painful and… [+3722 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Parmita Uniyal","title":"Lesser-known signs of weak and unhealthy bones you shouldn't ignore - Hindustan Times","description":"Bones are a living tissue and are continuously changing depending on the availability of nutrients and also get affected by certain health conditions. Here are signs that they are growing weak. | Health","url":"https://www.hindustantimes.com/lifestyle/health/lesserknown-signs-of-weak-and-unhealthy-bones-you-shouldn-t-ignore-101660733180256.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/17/1600x900/weak_bones_thumb_1660733277648_1660733286270_1660733286270.jpg","publishedAt":"2022-08-17T10:52:28Z","content":"We all are worried about our bones growing weak and unhealthy as we age, but we may not exactly know the cause behind it. The signs of weak bones appear very late and by that time the damage is alrea… [+3069 chars]"},{"source":{"id":null,"name":"News9live.com"},"author":"Unnati Gusain","title":"Study finds artificial nerve can treat paralysis, expert says too soon to claim - News9 LIVE","description":"The research find by using a stretchable, low-power organic nanowire neuromorphic device that mimics ...","url":"https://www.news9live.com/health/health-conditions/study-finds-artificial-nerve-can-treat-paralysis-expert-says-too-soon-to-claim-190022","urlToImage":"https://media.news9live.com/h-upload/2022/08/17/530256-ezgifcom-gif-maker-2022-08-17t161105333.jpg","publishedAt":"2022-08-17T10:51:20Z","content":"An international research team has succeeded in recovering muscle movement in a model of paralysed mice organic through artificial nerves. The team was led by Prof Tae-Woo Lee (Department of Material… [+6135 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"Sandhya Ramesh","title":"How cornea implant made from pig skin helped 20 people see again in trial held in India, Iran - ThePrint","description":"The study was conducted by researchers from Sweden’s Linköping University. Details of the Phase 1 trial and its outcome published last week in scientific journal Nature Biotechnology.","url":"https://theprint.in/health/how-cornea-implant-made-from-pig-skin-helped-20-people-see-again-in-trial-held-in-india-iran/1086181/","urlToImage":"https://static.theprint.in/wp-content/uploads/2022/08/sd.jpg","publishedAt":"2022-08-17T10:47:24Z","content":"Bengaluru: A cornea implant made from pig skin collagen has enabled 20 volunteers suffering from corneal blindness to see again in a pilot trial. The trial was designed and conducted by researchers f… [+4787 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Ayushman Kumar","title":"Can Monkeypox patients remain asymptomatic like COVID, ICMR plans sero-survey to assess - Moneycontrol","description":"India has so far reported 10 cases of monkeypox and one fatality from the infection.","url":"https://www.moneycontrol.com/news/trends/can-monkeypox-patients-remain-asymptomatic-like-covid-icmr-plans-sero-survey-to-assess-9045361.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/05/000_32AV3BD-1-770x433.jpg","publishedAt":"2022-08-17T10:31:24Z","content":"The Indian Council of Medical Research (ICMR) is set to initiate a time-bound serological (blood serum) survey on close contacts of monkeypox patients to assess the proportion of people who remain as… [+4152 chars]"}]}