{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Healthday.com"},"author":"Physician’s Briefing Staff","title":"Men Who Have Sex With Men Acting to Prevent Monkeypox Transmission - HealthDay News","description":"MSM report reducing their number of sexual partners, one-time sexual encounters, sex with partners met on dating apps","url":"https://consumer.healthday.com/men-who-have-sex-with-men-acting-to-prevent-monkeypox-transmission-2657957553.html","urlToImage":"https://consumer.healthday.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMDI3OTY0Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3MjY3ODM3MH0.0juMZX56dQMGS1CM-UDP5fjViTyrJwq5xgmyuP9nVSM/image.jpg?width=1200&height=600&coordinates=0%2C61%2C0%2C62","publishedAt":"2022-08-30T00:33:24Z","content":"MONDAY, Aug. 29, 2022 (HealthDay News) -- Gay, bisexual, and other men who have sex with men (MSM) are taking actions to reduce their risk for acquiring the monkeypox virus, according to research pub… [+1535 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"How to tell if it's flu, allergies or COVID - CBS Colorado","description":"Flu season typically starts in October and runs through spring. But this year, doctors are warning that the illness may start earlier and be more severe.","url":"https://www.youtube.com/watch?v=tQnJnFj_B5g","urlToImage":"https://i.ytimg.com/vi/tQnJnFj_B5g/hqdefault.jpg","publishedAt":"2022-08-29T23:24:02Z","content":null},{"source":{"id":"medical-news-today","name":"Medical News Today"},"author":"Eleanor Bird, M.S.","title":"Simple musical test predicts cognitive decline in older adults, study shows - Medical News Today","description":"A new pilot study shows that simple musical tests combined with EEG recordings could help to predict cognitive decline in older adults. In the future, musical tests could be used to more accurately detect cognitive decline to help prevent severe dementia.","url":"https://www.medicalnewstoday.com/articles/simple-musical-test-predicts-cognitive-decline-in-older-adults-study-shows","urlToImage":"https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/08/musical_test_senior_cognition_arthritis_732x549_thumb-1.jpg","publishedAt":"2022-08-29T23:07:03Z","content":"<ul><li>Age-related cognitive decline can be a risk factor for dementia but is currently underdiagnosed.</li><li>A new pilot study shows that simple musical tests combined with EEG recordings could h… [+5827 chars]"},{"source":{"id":null,"name":"Everyday Health"},"author":"Lisa Rapaport","title":"Tomato Flu Keeps Spreading in India: What Is it and What do You Need to Know? - Everyday Health","description":"At least 100 children in India have been sickened by the so-called tomato flu, which shares some symptoms with COVID-19 and several other common childhood diseases.","url":"https://www.everydayhealth.com/infectious-diseases/tomato-flu-keeps-spreading-in-india/","urlToImage":"https://images.everydayhealth.com/images/tomato-flu-outbreak-continues-to-spread-in-india-1440x810.jpg?sfvrsn=6e513f00_1","publishedAt":"2022-08-29T23:04:48Z","content":"A new virus thats been dubbed tomato flu, or tomato fever, is spreading in India and causing several symptoms that are similar to COVID-19, including fever, fatigue, and body aches.\r\nThe virus got it… [+2873 chars]"},{"source":{"id":null,"name":"The Lancet"},"author":null,"title":"Excess tuberculosis cases and deaths following an economic recession in Brazil: an analysis of nationally representative disease registry data - The Lancet","description":"Tuberculosis cases in Brazil rose substantially in 2015–19 during the recession, largely\naffecting young men. This increase seems to be linked to increasing tuberculosis transmission\namong incarcerated populations. Rising tuberculosis case rates threaten tube…","url":"https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(22)00320-5/fulltext","urlToImage":"//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/e17c96f5-786c-43cf-ade2-02b4f71368b0/gr1.jpg","publishedAt":"2022-08-29T22:43:15Z","content":"We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"},{"source":{"id":null,"name":"Madinamerica.com"},"author":null,"title":"This Teen Was Prescribed 10 Psychiatric Drugs. She's Not Alone. - Mad In America - Mad in America","description":"The problem of multiple medication use, or polypharmacy, that first emerged a decade ago among young people in foster care and low-income settings, has now gone mainstream.","url":"https://www.madinamerica.com/2022/08/teen-prescribed-10-psychiatric-drugs-shes-not-alone/","urlToImage":"https://www.madinamerica.com/wp-content/uploads/2022/08/polypharmacy-e1661808553961.jpg","publishedAt":"2022-08-29T21:36:22Z","content":"From The New York Times: “Her senior yearbook photo shows her smiling broadly, ‘but I felt terrible that day,’ said [Renae] Smith, who is now 19 and attends a local community college. ‘Ive gotten goo… [+670 chars]"},{"source":{"id":null,"name":"Medscape"},"author":"Marilynn Larkin","title":"Moderate Physical Activity Tied to Lower Heart Failure Risk - Medscape","description":"Regular physical activity 2.5 to 5 hours weekly, logged using wrist accelerometers, was associated with reductions in HF hospitalization and risk of death by more than two thirds.","url":"https://www.medscape.com/viewarticle/979948","urlToImage":"https://img.medscape.com/thumbnail_library/dt_220829_cyclist_exercise_fitness_tracker_fitbit_800x450.jpg","publishedAt":"2022-08-29T20:49:56Z","content":"Performing 150 to 300 minutes of moderate physical activity, or 75 to 150 minutes of vigorous activity, weekly is associated with a lower risk of heart failure (HF), independently of clinical, sociod… [+4660 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"Science X staff","title":"AI model may help epilepsy patients become seizure-free - Medical Xpress","description":"A study led by Monash University and believed to be a world first has demonstrated that an Artificial Intelligence (AI) model can potentially predict the best personalized, anti-seizure medication for patients with newly diagnosed epilepsy.","url":"https://medicalxpress.com/news/2022-08-ai-epilepsy-patients-seizure-free.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/artificial-intelligenc-51.jpg","publishedAt":"2022-08-29T20:37:04Z","content":"A study led by Monash University and believed to be a world first has demonstrated that an Artificial Intelligence (AI) model can potentially predict the best personalized, anti-seizure medication fo… [+4373 chars]"},{"source":{"id":null,"name":"Outbreak News Today"},"author":null,"title":"Panama: Authorities on alert for an 'explosion of severe dengue cases' - Outbreak News Today - Outbreak News Today","description":"NewsDesk @bactiman63 The circulation of two of the four existing dengue serotypes, together with the increase in hospitalized patients, create the right environment for an  “explosion of severe dengue cases” to occur in some health regions of the country.  Th…","url":"http://outbreaknewstoday.com/panama-authorities-on-alert-for-an-explosion-of-severe-dengue-cases-12133/","urlToImage":"http://outbreaknewstoday.com/wp-content/uploads/2014/04/aedes-255x300.png","publishedAt":"2022-08-29T20:21:51Z","content":"NewsDesk @bactiman63\r\nThe circulation of two of the four existing dengue serotypes, together with the increase in hospitalized patients, create the right environment for an  “explosion of severe deng… [+1270 chars]"},{"source":{"id":null,"name":"AppleInsider"},"author":null,"title":"New Apple Watch study aims to cut blood thinner use by AFib patients - Apple Watch Discussions on AppleInsider Forums - AppleInsider","description":"The Apple Watch is being used as part of a study to determine if it is possible to cut down the use of expensive blood thinners used to prevent strokes and atrial fibrillation.","url":"https://forums.appleinsider.com/discussion/228679/new-apple-watch-study-aims-to-cut-blood-thinner-use-by-afib-patients","urlToImage":"https://photos5.appleinsider.com/gallery/50121-98365-49883-97770-42988-83539-36855-68891-apple-watch-heart-ecg-xl-xl-xl-xl.jpg","publishedAt":"2022-08-29T20:10:12Z","content":"The Apple Watch is being used as part of a study to determine if it is possible to cut down the use of expensive blood thinners used to prevent strokes and atrial fibrillation. The seven-year study, … [+3335 chars]"},{"source":{"id":null,"name":"Cancernetwork.com"},"author":"Phillip H. Kuo, MD, PhD","title":"Phillip H. Kuo, MD, PhD, Examines Utility of PSMA-PET Parameters to Predict Response to 177Lu-PSMA-617 in mCRPC - Cancer Network","description":"Phillip H. Kuo, MD, PhD, spoke about how prostate-specific membrane antigen PET scan testing affected outcomes in patients with metastatic castration-resistant prostate cancer.","url":"https://www.cancernetwork.com/view/phillip-h-kuo-md-phd-examines-utility-of-psma-pet-parameters-to-predict-response-to-117lu-psma-617-in-mcrpc","urlToImage":"https://cdn.sanity.io/images/0vv8moc6/cancernetwork/ae58e5c96aeff4f024155862955745fb4b1fd62d-2872x1600.png?fit=crop&auto=format","publishedAt":"2022-08-29T20:03:33Z","content":"CancerNetwork® spoke with Phillip H. Kuo, MD, PhD, professor of medical imaging, biomedical engineering, and medicine as well as member of the Graduate Faculty at The University of Arizona College of… [+3961 chars]"},{"source":{"id":"medical-news-today","name":"Medical News Today"},"author":"Beth JoJack","title":"Regular physical activity linked to reduced risk of COVID-19 - Medical News Today","description":"New research shows that 2.5 hours of moderate-intensity exercise or 75 minutes of vigorous-intensity exercise each week offer the best protection against COVID-19.","url":"https://www.medicalnewstoday.com/articles/regular-physical-activity-linked-to-reduced-risk-of-covid-19","urlToImage":"https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/08/activity_covid-19_Stocksy_txpd1947426AHV300_Medium_1189208_Thumb.jpg","publishedAt":"2022-08-29T18:54:26Z","content":"<ul><li>Regular physical activity may be linked to a lower risk of developing COVID-19.</li><li>Individuals who exercise regularly may be less likely to experience severe symptoms of COVID-19 and les… [+6497 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Artificial Intelligence Improves Treatment in Women with Heart Attacks - Science Daily","description":"Heart attacks in women are more likely to be fatal than in men. The reasons are differences in age and in comorbidity burden which makes risk assessment in women a challenge. Researchers have now developed a novel artificial-intelligence-based risk score that…","url":"https://www.sciencedaily.com/releases/2022/08/220829112918.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-29T18:38:51Z","content":"Heart attacks are one of the leading causes of death worldwide, and women who suffer a heart attack have a higher mortality rate than men. This has been a matter of concern to cardiologists for decad… [+2971 chars]"},{"source":{"id":null,"name":"Bbntimes.com"},"author":"Naveen Joshi","title":"How Artificial Intelligence Augments Animal Healthcare - BBN Times","description":"The involvement of AI in veterinary medicine and treatment opens up new possibilities to safeguard animal health with as much surefootedness as human health.","url":"https://www.bbntimes.com/science/how-artificial-intelligence-augments-animal-healthcare","urlToImage":"https://www.bbntimes.com/images/articles/global-economy/How_AI_Augments_Animal_Healthcare.jpeg","publishedAt":"2022-08-29T18:24:52Z","content":"The involvement of AI in veterinary medicine and treatment opens up new possibilities to safeguard animal health with as much surefootedness as human health.\r\nThere are many who rightly feel that the… [+2779 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Express News Service","title":"Possibility of increase in vector-borne diseases, warns Chandigarh health department - The Indian Express","description":"The city has so far recorded 40 cases of dengue, two each of malaria & chikungunya.","url":"https://indianexpress.com/article/cities/chandigarh/possibility-of-increase-in-vector-borne-diseases-warns-chandigarh-health-department-8119633/","urlToImage":"https://images.indianexpress.com/2022/08/ch806778.jpg","publishedAt":"2022-08-29T18:21:39Z","content":"Chandigarh so far has recorded a total of 40 cases of dengue, two of malaria, and two of chikungunya, and with the monsoon season still not over, these numbers could see an increase, the UT health de… [+2536 chars]"},{"source":{"id":null,"name":"Biospectrumindia.com"},"author":null,"title":"Wockhardt Hospital, Mumbai Central launches diabetes surgery clinic - BSI bureau","description":"The clinic will provide preventive and therapeutic care in the treatment of diabetes","url":"https://www.biospectrumindia.com/news/77/21882/wockhardt-hospital-mumbai-central-launches-diabetes-surgery-clinic.html","urlToImage":"https://www.biospectrumindia.com/uploads/articles/diabetes-21882.jpg","publishedAt":"2022-08-29T18:20:06Z","content":"The clinic will provide preventive and therapeutic care in the treatment of diabetes\r\nWockhardt Hospital, Mumbai Central has launched a diabetes surgery clinic. The clinic will provide preventive and… [+388 chars]"},{"source":{"id":null,"name":"Rising Kashmir Daily English Newspaper"},"author":null,"title":"The lifelong influence of the gut-brain axis - Rising Kashmir","description":"An infant’s gut environment, or microbiome, is initially “seeded” at the time of birth","url":"https://www.risingkashmir.com/displaynews.aspx?news=114477","urlToImage":"https://www.risingkashmir.com/userfiles/image/s_637973644010266147_Author_View_1_(21).png","publishedAt":"2022-08-29T17:12:26Z","content":"Representing more than 99% of our genetic material, the friendly microbes in our bodies take up a lot of space. Mainly residing in the gut, our bugs were here first, have co-evolved with us, and cont… [+8532 chars]"},{"source":{"id":null,"name":"LatestLY"},"author":"ANI","title":"Health News | Researchers Discover New Diagnostic Method for Posterior Uveitis Eye Disease - LatestLY","description":"Get latest articles and stories on Health at LatestLY. Uveitis, a rare inflammatory eye illness, is responsible for five to ten percent of blindness worldwide. In particular, posterior uveitis is frequently associated with significant disease progression and …","url":"https://www.latestly.com/agency-news/health-news-researchers-discover-new-diagnostic-method-for-posterior-uveitis-eye-disease-4141430.html","urlToImage":"https://st1.latestly.com/wp-content/uploads/2022/08/ANI-20220829160653-588x441.jpg","publishedAt":"2022-08-29T17:10:20Z","content":"Bonn [Germany], August 29 (ANI): Uveitis, a rare inflammatory eye illness, is responsible for five to ten percent of blindness worldwide. In particular, posterior uveitis is frequently associated wit… [+4612 chars]"},{"source":{"id":null,"name":"Cureus.com"},"author":null,"title":"A Study of the Peripheral Vessels in Patients With Type 2 Diabetes Mellitus With or Without Foot Involvement - Cureus","description":"Peripheral vascular disease (PVD) is chronic limb ischemia caused by atherosclerosis of the peripheral arteries. Diabetes mellitus (DM) is a risk factor for this disease. The probability of a diabetic foot ulcer (DFU) is higher in a patient with DM and PVD th…","url":"https://www.cureus.com/articles/108410-a-study-of-the-peripheral-vessels-in-patients-with-type-2-diabetes-mellitus-with-or-without-foot-involvement","urlToImage":"https://assets.cureus.com/uploads/figure/file/420800/article_river_e7d8fba011c511eda7bbf119cbc63d85-1.v2.png","publishedAt":"2022-08-29T16:54:15Z","content":"Peripheral vascular disease (PVD) is chronic limb ischemia caused by atherosclerosis of the peripheral arteries. Diabetes mellitus (DM) is a risk factor for this disease. The probability of a diabeti… [+19658 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Large-scale sequencing identifies multiple genes and rare variants associated with Crohn’s disease susceptibility - Nature.com","description":"Large-scale sequence-based analyses identify novel risk variants and susceptibility genes for Crohn’s disease, and implicate mesenchymal cell-mediated intestinal homeostasis in disease etiology.","url":"https://www.nature.com/articles/s41588-022-01156-2","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-022-01156-2/MediaObjects/41588_2022_1156_Fig1_HTML.png","publishedAt":"2022-08-29T15:49:42Z","content":"<li>Genomics of Inflammation and Immunity Group, Human Genetics Programme, Wellcome Sanger Institute, Wellcome Genome Campus, Hinxton, UK\r\nAleksejs Sazonovs, Laura Fachal, Daniel L. Rice &amp; Carl A… [+13747 chars]"}]}