{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"Zoom"},"author":"TN Digital","title":"Avocados: Using this delectable fruit for the benefit of your skin - Times Now","description":"This fruit has several nutrients present in it along with some healthy fats and all of these factors make this fruit a favourite among many. However, the fruit is not just beneficial for your health, but, it is also good for your skin. The vitamins present in…","url":"https://www.timesnownews.com/health/avocados-using-this-delectable-fruit-for-the-benefits-of-your-skin-article-93827862","urlToImage":"https://static.tnn.in/thumb/msid-93827862,imgsize-100,width-1280,height-720,resizemode-75/93827862.jpg","publishedAt":"2022-08-28T02:16:48Z","content":"Avocados can help improve skin elasticity. The fats present in avocados can help to improve skin elasticity. When your skin elasticity is good, the appearance of wrinkles and fine lines also reduces."},{"source":{"id":null,"name":"Deccan Herald"},"author":"Sneha Ramesh","title":"Wastewater surveillance extends its reach to track H1N1, monkeypox - Deccan Herald","description":"With the flu-like cases on the increase in the city, Bengaluru’s Precision Health initiative, a wastewater surveillance programme piloted by the COVIDActionCollab (CAC) has widened its scope to study the prevalence of H1N1, influenza, and monkeypox.","url":"https://www.deccanherald.com/city/top-bengaluru-stories/bengaluru-wastewater-surveillance-extends-its-reach-to-track-h1n1-monkeypox-1140010.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/28/virus-1140010-1661653852.jpg","publishedAt":"2022-08-28T01:30:50Z","content":"With the flu-like cases on the increase in the city, Bengalurus Precision Health initiative, a wastewater surveillance programme piloted by the COVIDActionCollab (CAC) has widened its scope to study … [+1749 chars]"},{"source":{"id":null,"name":"The Sunday Guardian"},"author":null,"title":"No specific treatment for tomato flu, say health experts - The Sunday Guardian Live - The Sunday Guardian","description":"New Delhi: Several health experts have stated that children and immune-compromised adults are at utmost risk as the Tomato Flu is highly contagious. Currently, there is no specific treatment for the flu and the symptoms are almost similar to dengue, and chiku…","url":"https://www.sundayguardianlive.com/news/no-specific-treatment-tomato-flu-say-health-experts","urlToImage":"https://www.sundayguardianlive.com/wp-content/uploads/2022/08/Tanmaya-Das-Tomato-flu-edited.jpg","publishedAt":"2022-08-27T23:12:13Z","content":"New Delhi: Several health experts have stated that children and immune-compromised adults are at utmost risk as the Tomato Flu is highly contagious. Currently, there is no specific treatment for the … [+2116 chars]"},{"source":{"id":null,"name":"Neurosciencenews.com"},"author":"Neuroscience News","title":"Artificial Intelligence Model Can Detect Parkinson’s From Breathing Patterns - Neuroscience News","description":"A newly developed artificial intelligence model can detect Parkinson's disease by reading a person's breathing patterns. The algorithm can also discern the severity of Parkinson's disease and tract progression over time.","url":"https://neurosciencenews.com/artificial-intelligence-breathing-parkinsons-21305/","urlToImage":"https://neurosciencenews.com/files/2022/08/ai-parkinsons-breathing-neurosicences-public.jpg","publishedAt":"2022-08-27T21:59:00Z","content":"Summary: A newly developed artificial intelligence model can detect Parkinson’s disease by reading a person’s breathing patterns. The algorithm can also discern the severity of Parkinson’s disease an… [+6626 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"ANI","title":"Cardiovascular disease risk increases if you have autoimmune disorders - ThePrint","description":"Leuven [Belgium], August 28 (ANI): In high-income areas like Europe and the United States, 10% of the population has been identified as having one or more autoimmune illnesses. Examples include type I diabetes, lupus erythematosus, psoriasis, systemic scleros…","url":"https://theprint.in/health/cardiovascular-disease-risk-increases-if-you-have-autoimmune-disorders/1104068/","urlToImage":null,"publishedAt":"2022-08-27T20:13:21Z","content":"Leuven [Belgium], August 28 (ANI): In high-income areas like Europe and the United States, 10% of the population has been identified as having one or more autoimmune illnesses.\r\nExamples include type… [+5296 chars]"},{"source":{"id":null,"name":"Neurosciencenews.com"},"author":"Neuroscience News","title":"Mapping Brain Stem’s Control of Eating Could Lead to Better Treatments for Obesity - Neuroscience News","description":"Researchers investigate neural pathways that meet in the brainstem which help control feeding behaviors.","url":"https://neurosciencenews.com/brainstem-eating-obesity-21301/","urlToImage":"https://neurosciencenews.com/files/2022/08/brainstem-eating-neurosicences-public.jpg","publishedAt":"2022-08-27T20:06:07Z","content":"Summary: Researchers investigate neural pathways that meet in the brainstem which help control feeding behaviors.\r\nSource: University of Michigan\r\nEvery meal you sit down to makes an impression, with… [+4945 chars]"},{"source":{"id":null,"name":"YourTango"},"author":"Alice Kelly","title":"18 Foods To Add To Your Diet If You Want To Reduce Anxiety - YourTango","description":"These foods that help with anxiety have been proven to lower stress levels and boost mood. Add them to your diet to feel more at ease.","url":"https://www.yourtango.com/self/foods-help-with-anxiety-stress","urlToImage":"https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/foods-that-help-with-anxiety.png?itok=xwZR9RxP","publishedAt":"2022-08-27T19:39:24Z","content":"Diets arent just about weight loss and looking good. Feeling good is just as, if not more, important than what is going on on the outside.\r\nIncluding a bunch of foods that help with anxiety into your… [+9312 chars]"},{"source":{"id":null,"name":"Thehansindia.com"},"author":"Dr Irfan Shaikh","title":"Impact of poor muscle health on your body's immunity - The Hans India","description":"Building and maintaining a robust immune system is important for leading healthy, wholesome lives,...","url":"https://www.thehansindia.com/featured/sunday-hans/impact-of-poor-muscle-health-on-your-bodys-immunity-759488","urlToImage":"https://assets.thehansindia.com/h-upload/2022/08/27/1309766-physi.jpg","publishedAt":"2022-08-27T18:44:14Z","content":"Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune system even… [+3677 chars]"},{"source":{"id":null,"name":"Thehansindia.com"},"author":"The Hans India","title":"Why healthy eating is important - The Hans India","description":"If you've ever asked someone for advice on how to stay healthy, they've undoubtedly told you to 'eat ...","url":"https://www.thehansindia.com/featured/sunday-hans/why-healthy-eating-is-important-759487","urlToImage":"https://assets.thehansindia.com/h-upload/2022/08/27/1309765-kids.jpg","publishedAt":"2022-08-27T18:35:51Z","content":"If you've ever asked someone for advice on how to stay healthy, they've undoubtedly told you to 'eat a nutritious diet', but really-what does that even mean? \r\nDifferent nutrients and their importanc… [+3864 chars]"},{"source":{"id":null,"name":"Cureus.com"},"author":null,"title":"Sclerosing Encapsulating Peritonitis Mimicking an Internal Hernia: A Case Report - Cureus","description":"Sclerosing encapsulating peritonitis (SEP) is a rare entity that could lead to abdominal obstruction; however, despite being reported in several case series, its underlying pathophysiology is still unclear. A large proportion of SEP cases are diagnosed incide…","url":"https://www.cureus.com/articles/103484-sclerosing-encapsulating-peritonitis-mimicking-an-internal-hernia-a-case-report","urlToImage":"https://assets.cureus.com/uploads/figure/file/433868/article_river_3de39fd0200011edad04295c24d8be7a-X-ray.png","publishedAt":"2022-08-27T18:31:39Z","content":"Sclerosing encapsulating peritonitis (SEP) is a rare entity that could lead to abdominal obstruction; however, despite being reported in several case series, its underlying pathophysiology is still u… [+12390 chars]"},{"source":{"id":null,"name":"Dailypioneer.com"},"author":"The Pioneer","title":"DENGUE MENACE - Daily Pioneer","description":"Climate change-induced temperatures causing erratic precipitation patterns, severe rainfall events, and seasonal changes are all known to boost mosquito populations. This means, once isolated to a few areas in the tropics, higher number of mosquitos available…","url":"https://www.dailypioneer.com/2022/sunday-edition/dengue-menace.html","urlToImage":"https://www.dailypioneer.com/images/logo.jpg","publishedAt":"2022-08-27T18:31:26Z","content":"Climate change-induced temperatures causing erratic precipitation patterns, severe rainfall events, and seasonal changes are all known to boost mosquito populations. This means, once isolated to a fe… [+14293 chars]"},{"source":{"id":null,"name":"Dailypioneer.com"},"author":"The Pioneer","title":"'It's Time To Find Therapeutic Solutions to Dengue Menace' - Daily Pioneer","description":"Compared to the funds and research carried out on Covid-19 during the past two years, only a fraction of that has been invested to develop dengue vaccine and drugs, despite the disease being around for decades and wreaking havoc every year across countries.Gi…","url":"https://www.dailypioneer.com/2022/sunday-edition/---it-s-time-to-find-therapeutic-solutions-to-dengue-menace-.html","urlToImage":"https://www.dailypioneer.com/uploads/2022/story/images/big/---it-s-time-to-find-therapeutic-solutions-to-dengue-menace--2022-08-28.jpg","publishedAt":"2022-08-27T18:31:26Z","content":"Compared to the funds and research carried out on Covid-19 during the past two years, only a fraction of that has been invested to develop dengue vaccine and drugs, despite the disease being around f… [+5040 chars]"},{"source":{"id":null,"name":"Millenniumpost.in"},"author":"Team MP","title":"Dengue: Kolkata registers about 438 cases so far this yr - Millennium Post","description":"Kolkata: In the wake of a rising number of dengue cases across the state, various government run...","url":"http://www.millenniumpost.in/kolkata/dengue-kolkata-registers-about-438-cases-so-far-this-yr-491042","urlToImage":"http://www.millenniumpost.in/images/logo.png","publishedAt":"2022-08-27T18:12:47Z","content":"Kolkata: In the wake of a rising number of dengue cases across the state, various government run hospitals in the subdivision and block levels have been urged to make necessary arrangements to treat … [+2102 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Felicity Nelson","title":"There is a 'Shockingly Weird' Reason Mosquitoes Always Seem to Find Us, Says Study - ScienceAlert","description":"The relentless accuracy with which some mosquito species hunt down humans may result from their bizarrely wired olfactory system, which has an in-built backup for detecting human scents.","url":"https://www.sciencealert.com/there-is-a-shockingly-weird-reason-mosquitoes-always-seem-to-find-us-says-study","urlToImage":"https://www.sciencealert.com/images/2022/08/mossie-moon-image-1024.jpg","publishedAt":"2022-08-27T18:04:18Z","content":"The relentless accuracy with which some mosquito species hunt down humans may result from their bizarrely wired olfactory system, which has an in-built backup for detecting human scents.\r\nMosquitoes … [+2816 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"ANI","title":"Vital role of immune cells in liver regeneration identified during research - ThePrint","description":"Washington [US], August 27 (ANI): The vital role of immune cells that boost the production of liver cells has recently been discovered by MedUni Vienna research. The results of the study were recently published in the esteemed Journal of Hepatology. During th…","url":"https://theprint.in/science/vital-role-of-immune-cells-in-liver-regeneration-identified-during-research/1103945/","urlToImage":null,"publishedAt":"2022-08-27T17:15:33Z","content":"Washington [US], August 27 (ANI): The vital role of immune cells that boost the production of liver cells has recently been discovered by MedUni Vienna research.\r\nThe results of the study were recent… [+2225 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Anemia In Pregnancy: Health Problems During Pregnancy That Anemia & Obesity Can Cause How To Deal Wit - TheHealthSite","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy50aGVoZWFsdGhzaXRlLmNvbS92aWRlb3MvYW5lbWlhLWluLXByZWduYW5jeS1oZWFsdGgtcHJvYmxlbXMtZHVyaW5nLXByZWduYW5jeS10aGF0LWFuZW1pYS1vYmVzaXR5LWNhbi1jYXVzZS1ob3ctdG8tZGVhbC13aXRoLWl0LXdhdGNoLXZpZGVvLTkwNDM0OS_SAaMBaHR0cHM6Ly93d3cudGhlaGVhbHRoc2l0ZS5jb20vdmlkZW9zL2FuZW1pYS1pbi1wcmVnbmFuY3ktaGVhbHRoLXByb2JsZW1zLWR1cmluZy1wcmVnbmFuY3ktdGhhdC1hbmVtaWEtb2Jlc2l0eS1jYW4tY2F1c2UtaG93LXRvLWRlYWwtd2l0aC1pdC13YXRjaC12aWRlby05MDQzNDkvYW1wLw?oc=5","urlToImage":null,"publishedAt":"2022-08-27T16:30:00Z","content":null},{"source":{"id":null,"name":"Easternmirrornagaland.com"},"author":null,"title":"Smoking Also Leads to Thicker, Weaker Hearts — Study - Eastern Mirror","description":"It is well known that smoking causes blocked arteries, leading to coronary heart disease and stroke. A new study on Thursday warned that smoking also leads to thicker, weaker hearts. The researchers found that the more people smoked, the worse their heart fun…","url":"https://easternmirrornagaland.com/smoking-also-leads-to-thicker-weaker-hearts-study/","urlToImage":null,"publishedAt":"2022-08-27T16:22:39Z","content":"It is well known that smoking causes blocked arteries, leading to coronary heart disease and stroke. A new study on Thursday warned that smoking also leads to thicker, weaker hearts.\r\nThe researchers… [+2306 chars]"},{"source":{"id":null,"name":"Medscape"},"author":"Steve Stiles","title":"Vintage Drug Atop Loop Diuretics Boosts ADHF Decongestion: ADVOR - Medscape","description":"Adding the IV drug to loop diuretics in the ADVOR trial improved decongestion success in volume-overloaded patients with acute decompensated heart failure, researchers reported.","url":"https://www.medscape.com/viewarticle/979851","urlToImage":"https://img.medscape.com/thumbnail_library/dt_220825_urine_bag_800x450.jpg","publishedAt":"2022-08-27T16:07:39Z","content":"A decades-old drug, added to standard loop diuretics, could potentially help more volume-overloaded patients with acute decompensated heart failure (ADHF) to be discharged from the hospital 'dry,' a … [+9515 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Zarafshan Shiraz","title":"Incompetent cervix: Symptoms, risk factors, complications, tips to prevent it - Hindustan Times","description":"Here's all you need to know about the symptoms, risk factors, complications and tips to prevent incompetent cervix or cervical insufficiency/cervical incompetence that could lead to premature delivery or pregnancy loss. Read about it and take timely treatment…","url":"https://www.hindustantimes.com/lifestyle/health/incompetent-cervix-can-lead-to-premature-birth-or-pregnancy-loss-here-are-its-symptoms-risk-factors-complications-tips-to-prevent-it-101661613056136.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/27/1600x900/pexels-dominika-roseclay-1145997_1661613633318_1661613646039_1661613646039.jpg","publishedAt":"2022-08-27T15:29:00Z","content":"Before conceiving, the cervix or the lower part of the uterus that opens to the vagina is closed and firm. As one becomes pregnant, the cervix tends to soften, decreases in length (effaces) and opens… [+2563 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"I learned why our brains feel too full for more bad news - HuntDailyNews.in","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMiUmh0dHBzOi8vaHVudGRhaWx5bmV3cy5pbi9pLWxlYXJuZWQtd2h5LW91ci1icmFpbnMtZmVlbC10b28tZnVsbC1mb3ItbW9yZS1iYWQtbmV3cy_SAQA?oc=5","urlToImage":null,"publishedAt":"2022-08-27T15:28:59Z","content":null}]}