{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"Abplive.com"},"author":"Radifah Kabir","title":"Ancient Rocks Hold Clues To How Earth Became A Habitable Planet And Avoided A Mars-Like Fate - ABP Live","description":"According to a new study, the solid inner core of the Earth formed 550 million years ago and restored the magnetic field of the planet. This unravels how Earth became a habitable planet.","url":"https://news.abplive.com/science/ancient-rocks-hold-clues-to-how-earth-became-a-habitable-planet-and-avoided-a-mars-like-fate-1545617","urlToImage":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/08/01/dd5b7d02082da80bc8111d094f5aa0ca1659337311_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628","publishedAt":"2022-08-01T23:30:00Z","content":"Swirling liquid iron in the outer core of Earth creates the protective magnetic field around our planet. The iron flows approximately 1,800 miles beneath the surface of Earth. The invisible magnetic … [+7672 chars]"},{"source":{"id":null,"name":"India TV News"},"author":"Reported by IANS","title":"James Webb telescope likely spots first supernova - India TV News","description":"James Webb telescope's actual aim is to solve mysteries in our solar system, look beyond distant worlds around other stars, and probe the mysterious structures and origins of our universe and our place in it.","url":"https://www.indiatvnews.com/science/james-webb-telescope-likely-spots-first-supernova-nasa-2022-08-01-796632","urlToImage":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/01/1000-1643075419.jpeg","publishedAt":"2022-08-01T21:30:01Z","content":"James Webb telescope:\r\n The powerful next-generation James Webb Space Telescope may have likely spotted its first supernova, according to astronomers. According to Mike Engesser of the Space Telescop… [+1927 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Noor Al-Sibai","title":"ESA Unveils Plan to Send Spacecraft Through Venus' \"Hot, Thick\" Atmosphere - Futurism","description":"ESA is prepping to send a spacecraft to Venus — a feat which will require state-of-the-art methods to get through the planet's grueling atmosphere.","url":"https://futurism.com/the-byte/esa-venus-envision-atmosphere","urlToImage":"https://wp-assets.futurism.com/2022/08/esa-venus-envision-atmosphere.png","publishedAt":"2022-08-01T20:42:36Z","content":"It will get as close as 93 miles from the surface.\r\nToo Hot to Handle\r\nThe European Space Agency is preparing to send an orbital spacecraft to Venus a feat which will require some out-of-the-box thin… [+1930 chars]"},{"source":{"id":null,"name":"Mid-day"},"author":null,"title":"NASA's lunar orbiter spacecraft finds lunar pits with temperatures suitable for humans - mid-day.com","description":"The pits, and caves to which they may lead, would make thermally stable sites for lunar exploration compared to areas at the Moon's surface, which heat up to about 127 Celsius during the day and cool to about minus 173 Celsius at night","url":"https://www.mid-day.com/technology/article/nasas-lunar-orbiter-spacecraft-finds-lunar-pits-with-temperatures-suitable-for-humans-23238825","urlToImage":"https://images.mid-day.com/images/images/2022/aug/NASA_d.png","publishedAt":"2022-08-01T20:16:38Z","content":"The pits, and caves to which they may lead, would make thermally stable sites for lunar exploration compared to areas at the Moon's surface, which heat up to about 127 Celsius during the day and cool… [+3386 chars]"},{"source":{"id":null,"name":"Newswise"},"author":"Max Planck Institute of Molecular Cell Biology and Genetics","title":"Taking your time makes a difference – Brain development differs between Neanderthals and modern humans - Newswise","description":"After the ancestors of modern humans split from those of Neanderthals and Denisovans, their Asian relatives, about one hundred amino acids, the building blocks","url":"https://www.newswise.com/articles/taking-your-time-makes-a-difference-brain-development-differs-between-neanderthals-and-modern-humans","urlToImage":"https://www.newswise.com/assets/new/img/newswise-logo-square.jpg","publishedAt":"2022-08-01T20:15:00Z","content":"Newswise — After the ancestors of modern humans split from those of Neanderthals and Denisovans, their Asian relatives, about one hundred amino acids, the building blocks of proteins in cells and tis… [+3426 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Nickelate superconductors are intrinsically magnetic: Waves of magnetic excitation sweep through this exciting new material whether it's in superconducting mode or not -- another possible clue to how unconventional superconductors carry electric curre - Science Daily","description":"Scientists embedded elementary particles called muons into a many-layered nickel oxide superconductor to learn more about its magnetic properties. They discovered that waves of flip-flopping electron spins create magnetic excitations that sweep through the ni…","url":"https://www.sciencedaily.com/releases/2022/08/220801133044.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-01T18:37:01Z","content":"Electrons find each other repulsive. Nothing personal -- it's just that their negative charges repel each other. So getting them to pair up and travel together, like they do in superconducting materi… [+6513 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"New method to promote biofilm formation and increase efficiency of biocatalysis - Science Daily","description":"The researchers identified a library of synthetic polymers and screened them for their ability to induce biofilm formation in E. coli, a bacterium that is one of the most widely studied micro-organisms, and commonly used in biocatalysis.","url":"https://www.sciencedaily.com/releases/2022/08/220801102934.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-01T18:11:13Z","content":"Birmingham scientists have revealed a new method to increase efficiency in biocatalysis, in a paper published today in Materials Horizons.Biocatalysis uses enzymes, cells or microbes to catalyse chem… [+3462 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Research: Short-term high protein diets may hinder endurance athletes - ANI News","description":"Washington [US], August 1 (ANI): New research has found that microbial instability in the gut could hinder the performance of elite endurance athletes, and that short-term, high-protein diets are associated with this type of imbalance.","url":"https://www.aninews.in/news/health/research-short-term-high-protein-diets-may-hinder-endurance-athletes20220801230110","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/absndbansdbasdad202108290342422021082904082120220801171229.jpg","publishedAt":"2022-08-01T17:31:00Z","content":"Washington [US], August 1 (ANI): New research has found that microbial instability in the gut could hinder the performance of elite endurance athletes, and that short-term, high-protein diets are ass… [+2386 chars]"},{"source":{"id":null,"name":"Socialpost.news"},"author":"Abigail Anderson","title":"LARES-2 puts Einstein's theory to the test - Socialpost","description":"According to Newtonian gravity, an object orbiting a spherical planet must traverse exactly the same...","url":"https://www.socialpost.news/lares-2-puts-einsteins-theory-to-the-test/","urlToImage":null,"publishedAt":"2022-08-01T17:30:27Z","content":"According to Newtonian gravity, an object orbiting a spherical planet must traverse exactly the same ellipse over and over for eons. But in 1913, Albert Einstein and his assistant Michele Besso, usin… [+1801 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"Perseid meteor shower is active starting August; When will it peak and how to spot it? - Republic World","description":"The meteors in the Perseid meteor shower are remnants of the comet 109P/Swift-Tuttle which orbits the sun every 133 years, according to NASA.","url":"https://www.republicworld.com/science/space/perseid-meteor-shower-is-active-starting-august-when-will-it-peak-and-how-to-spot-it-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/mvnungaranzn2lbo_1659371486.jpeg","publishedAt":"2022-08-01T17:27:00Z","content":"The Perseid meteor shower, which is the best annual meteor shower, has turned active and will peak later this month. According to NASA, the Perseids start around July 15 every year but get significan… [+1866 chars]"},{"source":{"id":null,"name":"Nerdist"},"author":null,"title":"Meet the Lizard Robot That Could Save Your Life - Nerdist","description":"Physicists and biologists teamed up to answer an evolutionary question about lizards and then developed a robot that could go to the Moon.","url":"https://nerdist.com/article/meet-the-lizard-robot-that-could-save-your-life/","urlToImage":"https://legendary-digital-network-assets.s3.amazonaws.com/wp-content/uploads/2022/07/29125840/robot-lizard.png","publishedAt":"2022-08-01T17:21:03Z","content":"Scientists developed robotic lizards in a collaboration combining robotics, math, biology, and artificial intelligence. The robots helped solve an evolutionary puzzle and could be the first step towa… [+1793 chars]"},{"source":{"id":null,"name":"NASA"},"author":"https://www.jpl.nasa.gov/","title":"Mamers Valles - NASA Jet Propulsion Laboratory","description":"This image from NASA's Mars Odyssey shows a section of Mamers Valles. The channel is nearly 1000 km long (600 miles).","url":"https://www.jpl.nasa.gov/images/pia25461-mamers-valles","urlToImage":"https://d2pn8kiwq2w21t.cloudfront.net/images/jpegPIA25461.width-1024.jpg","publishedAt":"2022-08-01T17:20:18Z","content":"Today's VIS image shows a section of Mamers Valles. The channel is nearly 1000 km long (600 miles). Mamers Valles originates near Cerulli Crater in northern Arabia Terra, and after a short section ne… [+1056 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"NASA posts beautiful martian image showing `blue` region of the red planet - WION","description":"The blue streaks on the martian surface are a beautiful sight. The martian region visible in these images is called Gamboa Crater. It is located in the northern hemisphere of the planet","url":"https://www.wionews.com/science/nasa-posts-beautiful-martian-image-showing-blue-region-of-the-red-planet-502679","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/08/01/283715-mars.jpg","publishedAt":"2022-08-01T17:08:49Z","content":"When we say Mars, the first thing that crosses our minds is a red wasteland. Mars is almost always associated with the colour red. It's quite natural as the red colour of the planet is perceptible in… [+1503 chars]"},{"source":{"id":null,"name":"India.com"},"author":"India.com News Desk","title":"In A Galaxy Far, Far Away 100 Million Stars Twinkle In Andromeda Galaxy | See Pics Shared By NASA - India.com","description":"NASA's Hubble Space Telescope had captured some spectacular images of 100 million stars in Andromeda Galaxy.","url":"https://www.india.com/science/nasa-shares-image-of-andromeda-galaxy-100-million-stars-image-by-hubble-space-telescope-see-pics-5547671/","urlToImage":"https://static.india.com/wp-content/uploads/2022/08/nasa-hubble.jpg","publishedAt":"2022-08-01T15:59:04Z","content":"Andromeda Galaxy Images: In a galaxy far, far (really far) away there is a hub of about 100 million stars forming a composite and breathtaking view. Have you seen it yet? Well, now you can as NASA re… [+2142 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Bob Yirka","title":"Formation of dwarf galaxy observed using India's AstroSat - Phys.org","description":"An international team of researchers has observed part of the formation of a dwarf galaxy, helping to explain how they evolve from a dwarf state to maturity. In their paper published in the journal Nature, the group describes finding evidence of maturation in…","url":"https://phys.org/news/2022-08-formation-dwarf-galaxy-india-astrosat.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/formation-of-dwarf-gal.jpg","publishedAt":"2022-08-01T15:40:01Z","content":"An international team of researchers has observed part of the formation of a dwarf galaxy, helping to explain how they evolve from a dwarf state to maturity. In their paper published in the journal N… [+2510 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"NASA to send more helicopters to Mars as part of mission to bring back samples - WION","description":"The rocks, which were brought back in the initial mission, are currently being studied with help of state-of-the-art laboratory equipment.","url":"https://www.wionews.com/science/nasa-to-send-more-helicopters-to-mars-as-part-of-mission-to-bring-back-samples-502646","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/22/273061-untitled-design-2022-06-22t183554152.png","publishedAt":"2022-08-01T15:21:13Z","content":"NASA has decided to send two more helicopters to Mars following the success of their initial mission. The mission, which NASA is conducting along with the European Space Agency, is aimed at bringing … [+1666 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Huge solar flare explodes on Sun, says NASA, will spark geomagnetic storm on Earth - HT Tech","description":"A huge solar flare explosion was observed on the Sun and it may spark a geomagnetic storm on Earth on August 3. Know what space agencies say.","url":"https://tech.hindustantimes.com/tech/news/huge-solar-flare-explodes-on-sun-says-nasa-will-spark-geomagnetic-storm-on-earth-71659364956164.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/01/1600x900/faintyoung_1648896828205_1659365065989_1659365065989.jpg","publishedAt":"2022-08-01T14:44:43Z","content":"Something fiery and very unusual has exploded on the Sun. A huge explosion erupted on the north-eastern part of the Sun on July 31, but its intensity is yet to be identified. Solar observatories have… [+1671 chars]"},{"source":{"id":null,"name":"AZoNano"},"author":null,"title":"Rapidly Determining the Number of Layers 2D/3D Heterostructures - AZoNano","description":"An optical method was proposed for rapidly determining the number of layers of 2D materials, MoS2 nanosheets in a MoS2/MoO2 conformal heterostructure.","url":"https://www.azonano.com/news.aspx?newsID=39494","urlToImage":"https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39494_1659363679891421.jpg","publishedAt":"2022-08-01T14:24:00Z","content":"The layer-dependent electronic structures of two-dimensional (2D) materials suggest that the physical properties of 2D or three-dimensional (3D) heterostructures can be modulated by controlling the n… [+6334 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Watch: From Venice To The Edge Of The Universe - Swarajya","description":"The video zooms from the venue of the exhibition in Venice, Italy, out through the Solar System, the Milky Way, the Local Group and into the cosmic web. This...","url":"https://www.youtube.com/watch?v=CA56DORVY28","urlToImage":"https://i.ytimg.com/vi/CA56DORVY28/maxresdefault.jpg","publishedAt":"2022-08-01T12:17:24Z","content":null},{"source":{"id":null,"name":"Newsclick.in"},"author":null,"title":"First South Korean Lunar Mission, Danuri, to be Launched This Week - NewsClick","description":"It is expected to reach its destination by mid-December and shall orbit for a year afterwards.","url":"https://www.newsclick.in/first-south-korean-lunar-mission-danuri-launched-thi-week","urlToImage":"https://www.newsclick.in/sites/default/files/2022-08/liner.jpg","publishedAt":"2022-08-01T12:07:00Z","content":"South Korea is heading towards launching its first Moon mission, scheduled for this week. The lunar probe has been named 'Danuri,' which means enjoy the moon. It is expected to reach its destination … [+3922 chars]"}]}