{"status":"ok","totalResults":52,"articles":[{"source":{"id":null,"name":"Global Times"},"author":null,"title":"NASA launches nanosatellite to return humans to moon - Global Times","description":"NASA blasted a nanosatellite barely bigger than a microwave oven into outer space Tuesday, part of a landmark mission to return humans to the moon.","url":"https://www.globaltimes.cn/page/202206/1269334.shtml","urlToImage":"https://www.globaltimes.cn/Portals/0/attachment/2022/2022-04-09/c86d78fc-8622-410c-af5a-52b7621438a0.jpeg","publishedAt":"2022-06-29T10:04:00Z","content":"A SpaceX's Falcon 9 rocket carrying the Crew Dragon spacecraft is launched at NASA's Kennedy Space Center in Florida, the United States, April 8, 2022. NASA, Axiom Space, and SpaceX launched a first … [+1495 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Mars to soon reveal the secret behind the STRANGE double-impact asteroids - HT Tech","description":"The double impact asteroids are a strange phenomenon where two asteroids hit the same spot at the same time. While rare, Mars has many such craters created by double asteroid strike. But what do they actually reveal? Find out.","url":"https://tech.hindustantimes.com/tech/news/mars-to-soon-reveal-the-secret-behind-the-strange-double-impact-asteroids-71656495202763.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/29/1600x900/asteroids-1017666_1280_1648536433648_1656495272146.jpg","publishedAt":"2022-06-29T09:40:15Z","content":"Deep space is filled with mysteries and the more scientists explore the more confusing it gets. Take asteroids for example. In recent times, we have discovered a metallic asteroid, an armoured astero… [+2422 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"SpaceX-NASA's resupply mission to ISS deferred again to July 14 for Dragon's inspection - Republic World","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3d3dy5yZXB1YmxpY3dvcmxkLmNvbS9zY2llbmNlL3NwYWNlL3NwYWNleC1uYXNhcy1yZXN1cHBseS1taXNzaW9uLXRvLWlzcy1kZWZlcnJlZC1hZ2Fpbi10by1qdWx5LTE0LWZvci1kcmFnb25zLWluc3BlY3Rpb24tYXJ0aWNsZXNob3cuaHRtbNIBAA?oc=5","urlToImage":null,"publishedAt":"2022-06-29T09:30:00Z","content":null},{"source":{"id":null,"name":"Aawsat.com"},"author":"","title":"Chinese Spacecraft Acquires Images of Entire Planet of Mars - Asharq Al-awsat - English","description":"An uncrewed Chinese spacecraft has acquired imagery data covering all of Mars, including visuals of its south pole, after circling the planet more than 1,300 times since early last year, state media reported on Wednesday. \nChina's Tianwen-1 successfu","url":"https://english.aawsat.com/home/article/3730591/chinese-spacecraft-acquires-images-entire-planet-mars","urlToImage":"https://english.aawsat.com/sites/default/files/styles/large/public/2022/06/29/_2022-06-29t054819z_1454989318_rc2h1v9ta3hw_rtrmadp_3_space-exploration-china-mars-1656481929.jpg?itok=bWpnBErt","publishedAt":"2022-06-29T08:41:45Z","content":"An uncrewed Chinese spacecraft has acquired imagery data covering all of Mars, including visuals of its south pole, after circling the planet more than 1,300 times since early last year, state media … [+1127 chars]"},{"source":{"id":null,"name":"Nanowerk"},"author":null,"title":"The puzzling link between star formation and radio emission in galaxies - Nanowerk","description":"On the 50th anniversary of the discovery of a close connection between star formation in galaxies and their infrared and radio radiation, researchers have now deciphered the underlying physics.","url":"https://www.nanowerk.com/news2/space/newsid=60970.php","urlToImage":"https://www.nanowerk.com/news2/space/id60970.jpg","publishedAt":"2022-06-29T08:38:48Z","content":"Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"Artemis program: Here's how NASA plans to return to the Moon - The Indian Express","description":"With the Artemis program, NASA will return to the Moon more than 50 years after it was there last there.","url":"https://indianexpress.com/article/technology/science/nasa-artemis-moon-program-artemis-i-capstone-gateway-space-station-7998181/","urlToImage":"https://images.indianexpress.com/2022/06/NASA-Artemis-Moon-Program-Mission-SLS-rocket-launch.jpg","publishedAt":"2022-06-29T08:29:06Z","content":"NASAs Artemis mission aims to put humans back on the moon for the first time after the Apollo 17 mission, fifty years ago. The space agency has built the most powerful rocket ever, the Space Launch S… [+5946 chars]"},{"source":{"id":null,"name":"News18"},"author":"Buzz Staff","title":"NASA's Curiosity Rover Collects Crucial Data on Key Component of Life on Mars - News18","description":"It should be noted that organic carbon on Mars does not prove the existence of life on the red planet.","url":"https://www.news18.com/news/buzz/nasas-curiosity-rover-collects-crucial-data-on-key-component-of-life-on-mars-5459347.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/05/mars-nasa-165164724816x9.png","publishedAt":"2022-06-29T08:04:54Z","content":"NASAs Curiosity Rover, which has been collecting data on Mars since 2012, has helped scientists measure the total organic carbon in Martian rocks for the first time. In a press release on Tuesday, th… [+2125 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Shaurya Tomer","title":"Last asteroid impact on Earth? NASA scientist reveals truth - HT Tech","description":"When was the last time an asteroid hit Earth? NASA Scientist Marina Brozovic reveals startling information. Here’s more about it.","url":"https://tech.hindustantimes.com/tech/news/last-asteroid-impact-on-earth-nasa-scientist-reveals-truth-71656489079583.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/29/1600x900/asteroid-g5603adab3_1920_1647078503425_1656489140853.jpg","publishedAt":"2022-06-29T07:53:18Z","content":"Have you ever wondered when was the last time Earth got hit by an asteroid? If so, then NASA scientist Marina Brozovic might have the answer. Asteroids are small, rocky celestial objects in space whi… [+2009 chars]"},{"source":{"id":null,"name":"Devdiscourse"},"author":"Devdiscourse News Desk","title":"NASA's Lucy team makes significant progress in deploying spacecraft's solar array - Devdiscourse","description":"Read more about NASA's Lucy team makes significant progress in deploying spacecraft's solar array on Devdiscourse","url":"https://www.devdiscourse.com/article/science-environment/2090810-nasas-lucy-team-makes-significant-progress-in-deploying-spacecrafts-solar-array","urlToImage":"https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/14_10_2021_08_39_32_5268097.jpg?width=920&format=jpeg","publishedAt":"2022-06-29T06:45:46Z","content":"Following its launch in October 2021, one of Lucy's - NASA's asteroid-hunting spacecraft - solar arrays failed to latch after deployment. The mission team has achieved significant progress in deployi… [+1788 chars]"},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Ameya Paleja","title":"5 stunning images of the Red Planet that make you want to go there - Interesting Engineering","description":"Here are some of the breathtaking images of Mars planet that will make any adventurer yearn to go there.","url":"https://interestingengineering.com/stunning-images-mars","urlToImage":"https://inteng-storage.s3.amazonaws.com/img/iea/XD6KQJ11Ov/sizes/mars-crater-1920_md.png","publishedAt":"2022-06-29T06:12:00Z","content":"With the Federal Aviation Administration (FAA) giving the environmental clearances necessary for Starship to blast off from SpaceX's launch site, we are now a step closer to Elon Musk's long-cherishe… [+4132 chars]"},{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"University of Virginia: UVA Astrochemist Helps Explore The Chemistry Of Outer Space - India Education Diary","description":"Astronomers have been seeking to identify new molecules in space for more than five decades, a search that has led to date to the discovery of 276 specific molecule types. The latest discovery comes from an international collaboration including the c","url":"https://indiaeducationdiary.in/university-of-virginia-uva-astrochemist-helps-explore-the-chemistry-of-outer-space/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2022/01/University-of-Virginia.jpg","publishedAt":"2022-06-29T06:09:54Z","content":"Astronomers have been seeking to identify new molecules in space for more than five decades, a search that has led to date to the discovery of 276 specific molecule types. The latest discovery comes … [+6018 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"Can we grow food without sunlight? Scientists debut artificial photosynthesis - India Today","description":"Scientists have for the first time shown that plants can grow in the dark without sunlight, introducing a new method of artificial photosynthesis.","url":"https://www.indiatoday.in/science/story/can-we-grow-food-without-sunlight-scientists-debut-artificial-photosynthesis-1968015-2022-06-29","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Plants-647x363.jpeg?R0faEJCdw6iT3tlVF5G.fa5FHLTYG58C","publishedAt":"2022-06-29T06:03:17Z","content":"The Sun is the source of energy for all lifeforms on Earth, however, what happens if that permanently glowing bulb begins to dim? Scientists have now come up with a new way to replicate the process o… [+2756 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"NASA wants you to help spot clouds on Mars because it can reveal THIS big secret - HT Tech","description":"As NASA aims to collate 16 years of data on the atmosphere of Mars, and it is asking for people’s help to spot clouds on the red planet. This data can reveal a big secret about the planet.","url":"https://tech.hindustantimes.com/tech/news/nasa-wants-you-to-help-spot-clouds-on-mars-because-it-can-reveal-this-big-secret-71656481806301.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/29/1600x900/pia24622-curiosity_1-1041_(1)_1656481933595_1656481940372.jpg","publishedAt":"2022-06-29T05:57:14Z","content":"NASA is counting clouds on Mars and wants you to join them. Yes, the American space agency has undertaken a seemingly silly but extremely important project where it will be analysing the data collect… [+2151 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"Zombie star survives its own detonation, emerges brighter than before - India Today","description":"Researchers have observed a star that exploded onto itself and miraculously survived its own detonation.","url":"https://www.indiatoday.in/science/story/zombie-star-survives-its-own-detonation-emerges-brighter-than-before-1967998-2022-06-29","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/NGC_1309-647x363.jpeg?UhUSLUnBugO99n4JlKt3oneUfz3N8QZa","publishedAt":"2022-06-29T05:36:01Z","content":"In what could be one of the rarest phenomena ever observed in our cosmic neighbourhood, a star exploded on itself and miraculously survived its own detonation. What's even more bizarre is that the st… [+3073 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"Mysterious markings bloom on Mars as spring covers Red Planet - India Today","description":"Orbiter hovering above Mars has picked up strange markings on the surface with vents releasing gas as the Red Planet experiences spring.","url":"https://www.indiatoday.in/science/story/mysterious-polygons-bloom-on-mars-as-spring-covers-red-planet-1967987-2022-06-29","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Mars_polygon-647x363.jpeg?r0OPNnMiRa_cxr7V1UCkmrBU_teGRiXd","publishedAt":"2022-06-29T05:05:20Z","content":"Mars has always been a subject of not just curiosity but fascination, a planet inhospitable but with the possibility of life. A new image captured by the High-Resolution Imaging Experiment (HiRISE) c… [+2612 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"NASA’s $4 Billion Uranus Voyage Could Be a Boon for Space Companies - BollyInside","description":"Within weeks, NASA will announce whether it will conduct a $4.2 billion trip to Uranus, which advocates claim will answer previously unknown mysteries","url":"https://www.bollyinside.com/news/nasas-4-billion-uranus-voyage-could-be-a-boon-for-space-companies","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/NASAs-4-Billion-Uranus-Voyage-Could-Be-a-Boon-for.jpeg","publishedAt":"2022-06-29T00:08:35Z","content":"Within weeks, NASA will announce whether it will conduct a $4.2 billion trip to Uranus, which advocates claim will answer previously unknown mysteries about our solar system and is guaranteed to spar… [+5456 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Dissolving the problem: Organic vapor induces dissolution of molecular salts - Phys.org","description":"It has long been known that when salt is kept in a humid environment, it absorbs water, dissolving some of the salt and making it clump. Now, researchers from Japan have discovered that water vapor isn't the only agent that can do this.","url":"https://phys.org/news/2022-06-dissolving-problem-vapor-dissolution-molecular.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/dissolving-the-problem.jpg","publishedAt":"2022-06-29T00:00:28Z","content":"It has long been known that when salt is kept in a humid environment, it absorbs water, dissolving some of the salt and making it clump. Now, researchers from Japan have discovered that water vapor i… [+3312 chars]"},{"source":{"id":null,"name":"Daily Mail"},"author":"Christopher Carbone","title":"SpaceX's Starship Super Heavy rocket, which is the world's tallest, is ready for launch pad tests - Daily Mail","description":"SpaceX Starship's Super Heavy Rocket is ready for what could be its final launch pad test. The Super Heavy Booster 7 has 33 Raptor engines. A robotic arm  mounted the rocket to the pad.","url":"https://www.dailymail.co.uk/sciencetech/article-10961429/SpaceXs-Starship-Super-Heavy-rocket-worlds-tallest-ready-launch-pad-tests.html","urlToImage":"https://i.dailymail.co.uk/1s/2022/06/28/18/59632471-0-image-a-65_1656437034725.jpg","publishedAt":"2022-06-28T20:00:32Z","content":"SpaceX Starship's Super Heavy Rocket is ready for what could be its final launch pad test before a likely orbital test flight in July.  \r\nThe massive Super Heavy Booster 7, which has 33 Raptor engine… [+3768 chars]"},{"source":{"id":null,"name":"Nerdist"},"author":null,"title":"Can Captain America's Shield Withstand Lava? - Nerdist","description":"A series of YouTube videos asks what happens when you pour hot lava over a selection of items. The results range from scary to scientific.","url":"https://nerdist.com/article/captain-america-shield-replia-withstand-lava-experiment/","urlToImage":"https://legendary-digital-network-assets.s3.amazonaws.com/wp-content/uploads/2022/06/28092157/shield-featured.jpg","publishedAt":"2022-06-28T19:35:18Z","content":"Enemies of Captain America, take note. Apparently lava will punch through his mighty shield. Or at least a metal replica of it. YouTube channel PressTube tested out the lava versus shield for its ong… [+1724 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"NASA astronauts grow delicious space vegetables without soil - BollyInside","description":"For a long time, Earthly space travellers have been attempting to master orbital botany. Longer-term exploration missions require stable, sustainable","url":"https://www.bollyinside.com/news/nasa-astronauts-grow-delicious-space-vegetables-without-soil","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/NASA-astronauts-grow-delicious-space-vegetables-without-soil.jpeg","publishedAt":"2022-06-28T19:32:25Z","content":"For a long time, Earthly space travellers have been attempting to master orbital botany. Longer-term exploration missions require stable, sustainable off-world farming methods, and while the Internat… [+1462 chars]"}]}