{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"Inverse"},"author":"Matt Williams, Universe Today","title":"New molecules found on a nearby asteroid could reveal the origins of life - Inverse","description":"Japanese researchers recently announced that Ryugu carries strains of no less than 20 different amino acids — the building blocks of life itself!","url":"https://www.inverse.com/science/ryugu-asteroid-amino-acids-life-on-earth","urlToImage":"https://imgix.bustle.com/uploads/shutterstock/2022/6/24/64d22431-5a94-43c8-8fe5-e20f7d770cb9-shutterstock-2106080663.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg","publishedAt":"2022-06-26T10:30:25Z","content":"In 2014, \r\nthe Japan Aerospace Exploration Agency (JAXA) dispatched its Hayabusa2 spacecraft to rendezvous with 162173 Ryugu, a Near-Earth Asteroid (NEA) that periodically passes close to Earth. In 2… [+4661 chars]"},{"source":{"id":null,"name":"Newsnetnebraska.org"},"author":"Karen Hines","title":"abnormal radio waves from space - News Net Nebraska","description":"Space speaks to us, that’s for sure. Signals arrive from the depths of the universe,...","url":"https://www.newsnetnebraska.org/abnormal-radio-waves-from-space/","urlToImage":null,"publishedAt":"2022-06-26T08:31:24Z","content":"Space speaks to us, that’s for sure. Signals arrive from the depths of the universe, which telescopes and more advanced instruments are able to pick up. Then scientists on Earth analyze it to learn m… [+2969 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"NASA's First Rocket Launch From A Commercial Spaceport In Australia Today - NDTV","description":"NASA will launch a rocket from the remote wilderness of northern Australia on Sunday evening, the first commercial space launch in Australia and the agency's first from a commercial spaceport.","url":"https://www.ndtv.com/world-news/nasas-first-rocket-launch-from-commercial-spaceport-in-australia-tonight-3101395","urlToImage":"https://c.ndtvimg.com/2022-06/v4bfi6t_nasa-generic-reuters_120x90_26_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400","publishedAt":"2022-06-26T07:26:01Z","content":"The suborbital rocket will be briefly visible seconds after the launch from Australia. (Representational)\r\nSydney: NASA will launch a rocket from the remote wilderness of northern Australia on Sunday… [+2249 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Fish-like robots collect microplastics in the oceans - asumetech","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vYXN1bWV0ZWNoLmNvbS9maXNoLWxpa2Utcm9ib3RzLWNvbGxlY3QtbWljcm9wbGFzdGljcy1pbi10aGUtb2NlYW5zL9IBAA?oc=5","urlToImage":null,"publishedAt":"2022-06-26T06:53:38Z","content":null},{"source":{"id":null,"name":"The Indian Express"},"author":"New York Times","title":"NASA's return to the Moon starts with launching a microwave-size cube - The Indian Express","description":"Early Monday, a spacecraft named CAPSTONE is scheduled to launch as the first piece of Artemis to head to the moon. Compared to what is to follow, it is modest in size and scope.","url":"https://indianexpress.com/article/technology/science/nasas-return-to-the-moon-starts-with-launching-a-microwave-size-cube-7991981/","urlToImage":"https://images.indianexpress.com/2022/06/NASA_Moon_NYT.jpg","publishedAt":"2022-06-26T05:45:49Z","content":"In the coming years, NASA will be busy at the moon. A giant rocket will loft a capsule with no astronauts aboard around the moon and back, perhaps before the end of summer. A parade of robotic lander… [+10438 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":null,"title":"NASA Psyche asteroid mission suffers massive setback - HT Tech","description":"NASA put Psyche asteroid mission on hold Friday, blaming the late delivery of its own navigation software.","url":"https://tech.hindustantimes.com/tech/news/nasa-asteroid-mission-on-hold-due-to-late-software-delivery-71656145647525.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/pia24471-3-1041_1650699181614_1656149571811.jpg","publishedAt":"2022-06-26T04:17:50Z","content":"NASA put Psyche asteroid mission on hold Friday, blaming the late delivery of its own navigation software. The Psyche mission to a strange metal asteroid of the same name was supposed to launch this … [+2028 chars]"},{"source":{"id":null,"name":"News18"},"author":"Buzz Staff","title":"Massive Sunspot Twice the Size of Earth is Facing Our Home Planet - News18","description":"The sunspot has reportedly doubled its diameter in 24 hours, and it is pointed right at our planet. The magnetic field surrounding sunspot AR3038 has the potential to blast M-class solar flares toward our planet.","url":"https://www.news18.com/news/buzz/massive-sunspot-twice-the-size-of-earth-is-facing-our-home-planet-5439205.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/solar-flares-165615765116x9.png","publishedAt":"2022-06-26T02:30:39Z","content":"Celestial events are always interesting to witness and most recently we are witnessing a gigantic sunspot that has grown equal to twice the size of Earth. The sunspot has reportedly doubled its diame… [+1949 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Artificial Photosynthesis Can Produce Food in Complete Darkness - SciTechDaily","description":"Artificial photosynthesis is being developed by researchers to help make food production more energy-efficient on Earth, and maybe one day on Mars. For millions of years, photosynthesis has evolved in plants to turn water, carbon dioxide, and the energy from …","url":"https://scitechdaily.com/artificial-photosynthesis-can-produce-food-in-complete-darkness/","urlToImage":"https://scitechdaily.com/images/Plants-Growing-in-Complete-Darkness.jpg","publishedAt":"2022-06-26T01:21:33Z","content":"ByUniversity of California RiversideJune 25, 2022\r\nPlants are growing in complete darkness in an acetate medium that replaces biological photosynthesis. Credit: Marcus Harland-Dunaway/UCR\r\nArtificial… [+5242 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"A space traveler offers advice to aspiring astronauts - BollyInside","description":"More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an","url":"https://www.bollyinside.com/news/a-space-traveler-offers-advice-to-aspiring-astronauts","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/A-space-traveler-offers-advice-to-aspiring-astronauts.jpeg","publishedAt":"2022-06-26T00:08:37Z","content":"More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an astronaut.\r\nFor most people, working in space m… [+2485 chars]"},{"source":{"id":null,"name":"Universe Today"},"author":null,"title":"Despite its draining power, NASA's InSight Mars lander is determined to squeeze as much science as it can until the very last moment - Universe Today","description":"Its solar panels are caked with dust and the batteries are running out of juice, but NASA’s InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very last beep. To conserve energy, InSight was projected to shut…","url":"https://www.universetoday.com/156454/despite-its-draining-power-nasas-insight-mars-lander-is-determined-to-squeeze-as-much-science-as-it-can-until-the-very-last-moment/","urlToImage":"https://www.universetoday.com/wp-content/uploads/2022/06/FEATURED-IMAGE-7.jpg","publishedAt":"2022-06-25T21:57:07Z","content":"Its solar panels are caked with dust and the batteries are running out of juice, but NASAs InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very l… [+3906 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"The Andromeda Galaxy shows the wounds of a disastrous collision - BollyInside","description":"Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic","url":"https://www.bollyinside.com/news/the-andromeda-galaxy-shows-the-wounds-of-a-disastrous-collision","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/The-Andromeda-Galaxy-shows-the-wounds-of-a-disastrous-collision.jpeg","publishedAt":"2022-06-25T19:44:18Z","content":"Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic evolution.\r\nAndromeda, located 2.5 million ligh… [+1461 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"ISS Booster Engine Firing on Cygnus Freighter Comes to an Early End - BollyInside","description":"A scheduled reboost manoeuvre of the International Space Station was aborted after only 5 seconds for unknown reasons. Cargo spacecraft moored to the","url":"https://www.bollyinside.com/news/iss-booster-engine-firing-on-cygnus-freighter-comes-to-an-early-end","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/ISS-Booster-Engine-Firing-on-Cygnus-Freighter-Comes-to-an.jpeg","publishedAt":"2022-06-25T19:33:38Z","content":"A scheduled reboost manoeuvre of the International Space Station was aborted after only 5 seconds for unknown reasons.\r\nCargo spacecraft moored to the International Space Station fire their thrusters… [+2076 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"Climate change: a ‘space bubble’ shield can block solar radiation - BollyInside","description":"MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the sun’s rays, dubbed ‘Space","url":"https://www.bollyinside.com/news/climate-change-a-space-bubble-shield-can-block-solar-radiation","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/Climate-change-a-space-bubble-shield-can-block-solar-radiation.jpeg","publishedAt":"2022-06-25T19:32:44Z","content":"MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the suns rays, dubbed Space Bubbles.\r\nThis is a variation on the common geoenginee… [+3673 chars]"},{"source":{"id":null,"name":"Tech Explorist"},"author":"https://www.facebook.com/malewar.amit","title":"Tetraneutron – An Exotic State of Matter discovered - Tech Explorist","description":"It could lead to a better understanding of how the universe is put together.","url":"https://www.techexplorist.com/tetraneutron-exotic-state-of-matter-discovered/52105/","urlToImage":"https://www.techexplorist.com/wp-content/uploads/2022/06/Andrey-Shirokov.jpg","publishedAt":"2022-06-25T19:31:06Z","content":"A long-standing question in nuclear physics is whether chargeless nuclear systems can exist. Only neutron stars represent near-pure neutron systems, where neutrons are squeezed together by the gravit… [+6222 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"Eerie Sounds of Nebula NGC 2392 Released - Galaxy Reporters","description":"Nearly 5,000 years of light from the Earth, the great nebula NGC 2392 formed after the death of a star like our Sun. In this son-in-law act, the image is scanned clock like a radar. The radiator is mounted on a map so that it is elevated, so the distance from…","url":"https://galaxyreporters.com/eerie-sounds-of-nebula-ngc-2392-released/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2019/12/cepheus-nebula.jpg","publishedAt":"2022-06-25T19:12:27Z","content":"Nearly 5,000 years of light from the Earth, the great nebula NGC 2392 formed after the death of a star like our Sun.\r\nIn this son-in-law act, the image is scanned clock like a radar. The radiator is … [+1287 chars]"},{"source":{"id":null,"name":"Newsazi.com"},"author":"Eli Pacheco","title":"How Astronomers Are Investigating This Nebula Where Stars Are Being Born - News Azi","description":"Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses under its own gravity and gets hot, b","url":"https://newsazi.com/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/","urlToImage":"https://www.slashgear.com/img/gallery/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/l-intro-1656091252.jpg","publishedAt":"2022-06-25T19:12:26Z","content":"Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses u… [+1081 chars]"},{"source":{"id":null,"name":"Devdiscourse"},"author":"Devdiscourse News Desk","title":"NASA telescope captures this brilliant cascade of stars in a distant galaxy - Devdiscourse","description":"Read more about NASA telescope captures this brilliant cascade of stars in a distant galaxy on Devdiscourse","url":"https://www.devdiscourse.com/article/science-environment/2086849-nasa-telescope-captures-this-brilliant-cascade-of-stars-in-a-distant-galaxy","urlToImage":"https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/25_06_2022_22_39_44_0486008.jpg?width=920&format=jpeg","publishedAt":"2022-06-25T17:10:33Z","content":"The brilliant cascade of stars through the middle of this image is ESO 318-13, a galaxy that lies millions of light-years from Earth. The NASA/ESA Hubble Space Telescope captured this edge-on view of… [+1178 chars]"},{"source":{"id":null,"name":"Digital Trends"},"author":"Georgina Torbet","title":"See the crater left by a space junk impact on the moon - Digital Trends","description":"NASA's Lunar Reconnaissance Orbiter snapped an image showing the crater created by a Chinese rocket booster which crashed into the moon earlier this year.","url":"https://www.digitaltrends.com/space/moon-debris-impact-lro/","urlToImage":"https://www.digitaltrends.com/wp-content/uploads/2022/06/booster_0805_m1407760984r.map_.str01.enlarge3x.1100crop1.jpg?p=1","publishedAt":"2022-06-25T16:45:37Z","content":"Earlier this year, a Chinese rocket booster crashed into the lunar surface in a rare example of a piece of human-made debris colliding with the moon. Now, the site of this crash has been imaged by NA… [+2506 chars]"},{"source":{"id":null,"name":"Oup.com"},"author":null,"title":"Formation of S0s in extreme environments III: the role of environment in the formation pathways - Oxford Academic","description":null,"url":"https://academic.oup.com/HTTPHandlers/Sigma/LoginHandler.ashx?code=4NJJwk&state=749cf298-d584-41a8-9700-6651e3ab921dredirecturl%3Dhttpszazjzjacademiczwoupzwcomzjmnraszjadvancezyarticlezjdoizj10zw1093zjmnraszjstac1764zj6617996","urlToImage":null,"publishedAt":"2022-06-25T15:06:31Z","content":null},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Mars spacecraft gets Windows 98 update in 2022 to boost performance! Yes, you read it right - HT Tech","description":"Mars spacecraft from ESA is getting a Windows 98 update to boost its performance for improving its mission capabilities. Check details.","url":"https://tech.hindustantimes.com/tech/news/mars-spacecraft-gets-windows-98-update-in-2022-to-boost-performance-yes-you-read-it-right-71656167870785.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/Mars_Express_1656168025957_1656168036725.jpg","publishedAt":"2022-06-25T14:41:44Z","content":"Yes, you read that right. A spacecraft orbiting around Mars is finally getting a Windows 98 update to boost its performance. Sounds weird, right? Many of you reading this might now even know about Wi… [+2612 chars]"}]}