{"status":"ok","totalResults":52,"articles":[{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"Massachusetts Institute of Technology: A new spin on nuclear magnetic moments - India Education Diary","description":"A curious thing happened when MIT researchers Adam Vernon and Ronald Garcia Ruiz, along an international team of scientists, recently performed an experiment in which a sensitive laser spectroscopy technique was used to measure how the nuclear electr","url":"https://indiaeducationdiary.in/massachusetts-institute-of-technology-a-new-spin-on-nuclear-magnetic-moments/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg","publishedAt":"2022-07-16T10:30:06Z","content":"A curious thing happened when MIT researchers Adam Vernon and Ronald Garcia Ruiz, along an international team of scientists, recently performed an experiment in which a sensitive laser spectroscopy t… [+3538 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Express Web Desk","title":"Antarctica's sky dazzles in shades of purple after Tongan volcanic eruption - The Indian Express","description":"Following the volcanic eruption, aerosols made up of sulphate particles, sea salt and water vapour circulated in the air, bending and scattering sunlight and creating a glow in the sky with hues of pink, purple, violet and blue.","url":"https://indianexpress.com/article/world/antarctica-sky-purple-after-tonga-volcano-eruption-photos-8032874/","urlToImage":"https://images.indianexpress.com/2022/07/Turkish-Delight-Lunch-Scott-Base-2022-06-19-038-Pano.jpg","publishedAt":"2022-07-16T09:38:47Z","content":"Months after the Tongan volcanic eruption, the Antarctic sky has turned stunning shades of purple and violet due to the afterglow from the powerful eruption.The Hunga Tonga-Hunga Haapai volcano erupt… [+2203 chars]"},{"source":{"id":null,"name":"Orissapost.com"},"author":"Post News Network","title":"NASA’s James telescope reveals stunning images of Jupiter, its moon - OrissaPOST","description":"New Delhi: After releasing stunning coloured images of thousands of galaxies in our universe, NASA has now unveiled outstanding images of Jupiter and spectra of several asteroids taken by the James Webb Space Telescope. The data demonstrates Webb’s ability to…","url":"https://www.orissapost.com/nasas-james-telescope-reveals-stunning-images-of-jupiter-its-moon/","urlToImage":"https://www.orissapost.com/wp-content/uploads/2022/07/UPLOAD-NASA.jpg","publishedAt":"2022-07-16T09:27:27Z","content":"New Delhi: After releasing stunning coloured images of thousands of galaxies in our universe, NASA has now unveiled outstanding images of Jupiter and spectra of several asteroids taken by the James W… [+1686 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Aggressive China plans asteroid mission to compete against NASA DART mission. Space war brewing? - HT Tech","description":"China has been aggressively building the roadmap for its asteroid monitoring and defense system to track and hit Earth directed asteroids and deflect them. NASA is also working on a similar system with its DART mission.","url":"https://tech.hindustantimes.com/tech/news/aggressive-china-plans-asteroid-mission-to-compete-against-nasa-dart-mission-space-war-brewing-71657963225314.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/07/16/1600x900/NASA_DART_1633579074740_1657963261626_1657963261626.jpg","publishedAt":"2022-07-16T09:26:59Z","content":"The space war is getting intense and everyone is aiming to build a system to destroy dangerous asteroids. These anti-asteroid missions can take out any space rock threatening the Earth. In November 2… [+1997 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Process optimization for the rapid conversion of calcite into hydroxyapatite microspheres for chromatographic applications | Scientific Reports - Nature.com","description":"Scientific Reports - Process optimization for the rapid conversion of calcite into hydroxyapatite microspheres for chromatographic applications","url":"https://www.nature.com/articles/s41598-022-16579-4","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-16579-4/MediaObjects/41598_2022_16579_Fig1_HTML.png","publishedAt":"2022-07-16T09:14:36Z","content":"The calcium carbonate formed in our experiment is phase-pure without any additional peak, and matched well with the standard calcite JCPDS no: 05-0586 shown in Fig. 1a. The sharp peaks indicate that … [+16481 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Monit Khanna","title":"This AI Has The Intuition And Thinking Capabilities Of A Baby - Indiatimes.com","description":"Scientists are trying their best to get AI to levels as smart as human intelligence and while they've done a phenomenal job so far, things that come naturally to humans -- such as intuition and impulsive reactions -- are almost impossible to be taught to a co…","url":"https://www.indiatimes.com/technology/science-and-future/ai-thinks-like-a-baby-574685.html","urlToImage":"https://im.indiatimes.in/content/2022/Jul/Facebook-Image-97_62cecd0186ed8.jpg","publishedAt":"2022-07-16T08:58:14Z","content":"Scientists are trying their best to get AI to levels as smart as human intelligence and while they've done a phenomenal job so far, things that come naturally to humans -- such as intuition and impul… [+2864 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ETtech","title":"James Webb Space Telescope: humanity's eyes into the past - Economic Times","description":"The photographs from the James Webb Space Telescope, which show off the capabilities of the $10-billion telescope built to gaze far into space and time, are the finest quality views of the universe ever taken.","url":"https://economictimes.indiatimes.com/tech/technology/james-webb-space-telescope-humanitys-eyes-into-the-past/articleshow/92917441.cms","urlToImage":"https://img.etimg.com/thumb/msid-92917578,width-1070,height-580,imgsize-134978,overlay-ettech/photo.jpg","publishedAt":"2022-07-16T08:34:00Z","content":"Humanitys search for answers to the universes mysteries proves one thing trying to understand how something works doesnt detract from its beauty, it enhances it.\r\nEarlier this week, the James Webb Sp… [+5140 chars]"},{"source":{"id":null,"name":"Gadgets Now"},"author":"IANS","title":"Star-mapping ESA's Gaia spacecraft detects Jupiter-like planets - Gadgets Now","description":"The European Space Agency (Esa) star mapping Gaia spacecraft has discovered two new Jupiter-like planets in remote solar systems within the Milky Way galaxy.The development marks the first time that the Gaia spacecraft successfully detected new planets. Gaia …","url":"https://www.gadgetsnow.com/tech-news/star-mapping-esas-gaia-spacecraft-detects-jupiter-like-planets/articleshow/92917074.cms","urlToImage":"https://static.toiimg.com/thumb/resizemode-4,msid-92917074,imgsize-7390,width-800/92917074.jpg","publishedAt":"2022-07-16T08:02:00Z","content":"The European Space Agency (Esa) star mapping Gaia spacecraft has discovered two new Jupiter-like planets in remote solar systems within the Milky Way galaxy.The development marks the first time that … [+2256 chars]"},{"source":{"id":null,"name":"Tech Explorist"},"author":"Pranjal Mehar","title":"Scientists revealed for the first time the origin of neutrinos - Tech Explorist","description":"The main goal is to shed light on the origin of astrophysical neutrinos.","url":"https://www.techexplorist.com/scientists-revealed-first-time-origin-neutrinos/52525/","urlToImage":"https://www.techexplorist.com/wp-content/uploads/2022/07/blazar-accelerating-cosmic-rays-1.jpg","publishedAt":"2022-07-16T06:59:41Z","content":"Cosmic rays that consist of highly energized electrically charged particles continuously bombard the earth’s atmosphere. These particles come from deep outer space, they have traveled billions of lig… [+3454 chars]"},{"source":{"id":null,"name":"The Weather Channel"},"author":null,"title":"Cosmic Heartbeat? MIT Astronomers Detect Mysterious Heartbeat-Like Radio Signals Coming from a Faraway Galaxy - The Weather Channel","description":"The signal is a fast radio burst, or FRB, and this new signal persisted for up to three seconds — about 1,000 times longer than the average FRB. - Articles from The Weather Channel | weather.com","url":"https://weather.com/en-IN/india/space/news/2022-07-16-heartbeat-like-radio-signals-from-faraway-galaxy","urlToImage":"https://s.w-x.co/in-CHIME.jpg","publishedAt":"2022-07-16T05:16:29Z","content":"Astronomers have detected a strange and persistent radio signal from a far-off galaxy that appears to be flashing with surprising regularity, similar to a 'heartbeat'. \r\nThe signal is classified as a… [+2362 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"This 290-feet wide mammoth of an Asteroid will be near Earth tomorrow, says NASA - HT Tech","description":"According to NASA, a large 290-feet wide asteroid will make its closest approach to the Earth tomorrow, July 17. How likely is it to strike our planet? Find out.","url":"https://tech.hindustantimes.com/tech/news/this-290-feet-wide-mammoth-of-an-asteroid-will-be-near-earth-tomorrow-says-nasa-71657946087300.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/07/16/1600x900/asteroid-3628185_1920_1631933514992_1657946158840_1657946158840.jpg","publishedAt":"2022-07-16T04:38:10Z","content":"After a relatively quiet period of time, asteroids have begun swarming our planet. Just last week, NASA spotted a small 41-feet wide asteroid coming dangerously close to the Earth, and this week astr… [+1714 chars]"},{"source":{"id":null,"name":"Onmanorama.com"},"author":"Our Correspondent","title":"Two Keralites in NASA team decoding James Webb Space Telescope images - Onmanorama","description":"Manoj Puravankara, a native of Kozhikode, and Jessy Jose from Muvattupuzha are the two members of James Webb’s team of observers.","url":"https://www.onmanorama.com/news/kerala/2022/07/16/keralites-nasa-decoding-james-webb-space-telescope.html","urlToImage":"https://img.onmanorama.com/content/dam/mm/en/kerala/top-news/images/2022/7/16/nasa-malayali.jpg","publishedAt":"2022-07-16T04:36:51Z","content":"Kozhikode: Two Keralite astronomers are part of the National Aeronautics Space Administration (NASA) team that would observe the pictures captured by the James Webb Space Telescope, which is unravell… [+2078 chars]"},{"source":{"id":null,"name":"Eurasiantimes.com"},"author":"Parth Satam","title":"China’s Powerful Sun Gazing ASO-S Telescope Is Getting Ready To Capture The ‘Thundering Ball Of Fire’ - EurAsian Times","description":"China's powerful indigenous telescope, Advanced Space-Based Solar Observatory (ASO-S), meant to get up close and personal to study our system's thundering ball of fire, is set to lift off on its four-year mission this autumn.","url":"https://eurasiantimes.com/chinas-powerful-sun-gazing-aso-s-telescope-is-getting-ready/","urlToImage":"https://eurasiantimes.com/wp-content/uploads/2022/07/Mission-to-sun.jpg","publishedAt":"2022-07-16T03:02:15Z","content":"China’s powerful indigenous telescope, Advanced Space-Based Solar Observatory (ASO-S), meant to get up close and personal to study our system’s thundering ball of fire, is set to lift off on its four… [+4532 chars]"},{"source":{"id":null,"name":"DNA India"},"author":"DNA Web Team","title":"Watch: NASA's SpaceX CR-25 leaves for International Space Station - DNA India","description":"Taking to Twitter, the National Aeronautics and Space Administration, NASA, shared a video of the CR-25 launch.","url":"https://www.dnaindia.com/science/report-watch-nasa-s-spacex-cr-25-leaves-for-international-space-station-2969016","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/07/16/2522809-nasa.jpg","publishedAt":"2022-07-16T02:11:00Z","content":"Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Jul 16, 2022, 07:56 AM ISTAfter many delays, SpaceX's Dragon spacecraft finally lifted off to begin its journey to the Internation… [+1886 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"This Week in Science: The dangers of space junk - CityNews","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcF7uTiva8PE","urlToImage":null,"publishedAt":"2022-07-16T01:25:45Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"USC professor to conduct research with new James Webb Telescope - News 19 WLTX","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dvpb7CMNxJ8w","urlToImage":null,"publishedAt":"2022-07-15T22:54:13Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Dark Matter: Is a Revolution Coming to Physics? - SciTechDaily","description":"What is dark matter? It has never been observed, yet scientists estimate that it makes up 85% of the matter in the universe. The short answer is that no one knows what dark matter is. More than a century ago, Lord Kelvin offered it as an explanation for the v…","url":"https://scitechdaily.com/dark-matter-is-a-revolution-coming-to-physics/","urlToImage":"https://scitechdaily.com/images/Galaxy-Universe-Gravity-Spacetime.jpg","publishedAt":"2022-07-15T21:05:31Z","content":"What is dark matter? Does it even exist, or do we just need an adjustment to our theory of gravity?\r\nWhat is dark matter? It has never been observed, yet scientists estimate that it makes up 85% of t… [+4574 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":null,"title":"Research: Climate change associated with coastal glacier retreat - ThePrint","description":"Washington [US], July 15 (ANI): Researchers at the University of Texas Institute for Geophysics (UTIG) and Georgia Tech have developed a methodology that they think cracks the code to why coastal glaciers are retreating, and in turn, how much can be attribute…","url":"https://theprint.in/science/research-climate-change-associated-with-coastal-glacier-retreat/1041089/","urlToImage":null,"publishedAt":"2022-07-15T18:13:24Z","content":"Washington [US], July 15 (ANI): Researchers at the University of Texas Institute for Geophysics (UTIG) and Georgia Tech have developed a methodology that they think cracks the code to why coastal gla… [+3437 chars]"},{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Tristan Greene","title":"MIT's building a time-traveling dark matter detector that could save Einstein's legacy - TNW","description":"A team of physicists at MIT recently published a mind-blowing research paper detailing their successful efforts to use entanglement and 'quantum time-reversal' to create sensors capable ...","url":"https://thenextweb.com/news/mits-building-time-traveling-dark-matter-detector-could-save-einsteins-legacy","urlToImage":"https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2022%2F03%2Fclockuniverse.jpg&signature=2a13567703c44201e8bc3a7fc8b85484","publishedAt":"2022-07-15T18:12:00Z","content":"A team of physicists at MIT recently published a mind-blowing research paper detailing their successful efforts to use entanglement and quantum time-reversal to create sensors capable of incredibly d… [+6077 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Examining rocking shadows in protoplanetary disks - Phys.org","description":"Astronomers from the University of Warwick reveal a new phenomenon dubbed the \"rocking shadow\" effect that describes how disks in forming planetary systems are oriented, and how they move around their host star. The effect also gives clues as to how they migh…","url":"https://phys.org/news/2022-07-shadows-protoplanetary-disks.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/rocking-shadows-in-pro.jpg","publishedAt":"2022-07-15T17:46:58Z","content":"Astronomers from the University of Warwick reveal a new phenomenon dubbed the \"rocking shadow\" effect that describes how disks in forming planetary systems are oriented, and how they move around thei… [+2744 chars]"}]}