{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Astronomers Have Discovered an Especially Sneaky Black Hole - SciTechDaily","description":"Discovery Sheds Light on Star Death, Black Hole Formation and Gravitational Waves When it comes to field of black hole research, it seems there is always something new and exciting happening. In 1922, Albert Einstein first published his book explaining the th…","url":"https://scitechdaily.com/astronomers-have-discovered-an-especially-sneaky-black-hole/","urlToImage":"https://scitechdaily.com/images/Black-Hole-Police-Spot-Extragalactic-Black-Hole.gif","publishedAt":"2022-08-21T16:19:36Z","content":"ByIdan Ginsburg, Georgia State UniversityAugust 21, 2022\r\nVFTS 243 is a binary system of a large, hot blue star and a black hole orbiting each other, as seen in this animation. Credit: ESO/L.Calçada\r… [+7758 chars]"},{"source":{"id":null,"name":"Universe Today"},"author":"Andy Tomaswick","title":"Another of the Lucy Mission's Asteroids has a Moon - Universe Today","description":"There is still so much we don’t know about the asteroids. Various missions have already been sent to some near Earth and in the asteroid belt, but there are just so many that it is hard to keep track of them all. Lucy, NASA’s mission to the Trojan asteroids, …","url":"https://www.universetoday.com/157250/another-of-the-lucy-missions-asteroids-has-a-moon/","urlToImage":"https://www.universetoday.com/wp-content/uploads/2022/08/7469.jpg","publishedAt":"2022-08-21T16:07:49Z","content":"There is still so much we don’t know about the asteroids. Various missions have already been sent to some near Earth and in the asteroid belt, but there are just so many that it is hard to keep track… [+3564 chars]"},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Mert Erdemir","title":"New study proves that water separates into two different liquids at low temperatures - Interesting Engineering","description":"A research team from the University of Birmingham and Sapienza Università di Roma has found that water can change from one form of liquid into a denser form of liquid.","url":"https://interestingengineering.com/science/new-study-proves-water-separates-in-two-different-liquids","urlToImage":"https://inteng-storage.s3.amazonaws.com/2022/08/21/image/jpeg/ZwOR3NbBa1k819kr8xkG0gt1IeE9ykU4D3m8QqWN.jpg","publishedAt":"2022-08-21T15:27:17Z","content":"\"This colloidal model of water provides a magnifying glass into molecular water, and enables us to unravel the secrets of water concerning the tale of two liquids,\" said Chakrabarti. \r\nThe team antic… [+1795 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"ESO's telescope captures enthralling cosmic dance after collision of two massive galaxies - Republic World","description":"ESO's Very Large Telescope has captured the clearest image of the galaxy NGC 7727 which was formed after the collision of two smaller galaxies.","url":"https://www.republicworld.com/science/space/esos-telescope-captures-enthralling-cosmic-dance-after-collision-of-two-massive-galaxies-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/cwq4dk788zforgct_1661091932.jpeg","publishedAt":"2022-08-21T15:08:00Z","content":"The European Southern Observatory's Very Large Telescope (ESO's VLT) has managed to capture a spectacular picture of the aftermath of two galaxies that collided with each other. This collision, which… [+2491 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":"Lisa Jennings","title":"See the largest photo ever taken by the James Webb Space Telescope - BollyInside","description":"A team of scientists using the James Webb Space Telescope has just released the largest image captured by the telescope to date. The image is a mosaic of","url":"https://www.bollyinside.com/news/see-the-largest-photo-ever-taken-by-the-james-webb-space-telescope","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/See-the-largest-photo-ever-taken-by-the-James-Webb.jpeg","publishedAt":"2022-08-21T14:56:27Z","content":"A team of scientists using the James Webb Space Telescope has just released the largest image captured by the telescope to date. The image is a mosaic of 690 individual images taken with the telescop… [+3076 chars]"},{"source":{"id":null,"name":"Mysmartprice.com"},"author":null,"title":"What Did Hubble See on Your Birthday? Find Out Using New NASA's Web Tool - MySmartPrice","description":"NASA launched a new tool earlier in 2022 which allows public to find out what did Hubble see on any given date.","url":"https://www.mysmartprice.com/gear/what-did-hubble-see-on-your-birthday/","urlToImage":"https://assets.mspimages.in/wp-content/uploads/2022/08/hubble.jpg","publishedAt":"2022-08-21T14:43:34Z","content":null},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"Farming on Mars must be started with THIS plant before tastier vegetables, study suggests - Republic World","description":"A new study suggests that the plant alfalfa could be initially used to grow crops on Mars before cultivating more complex and nutrient-rich vegetables.","url":"https://www.republicworld.com/science/space/farming-on-mars-must-be-started-with-this-plant-before-tastier-vegetables-study-suggests-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/webhfdu3ecznmg88_1661088166.jpeg","publishedAt":"2022-08-21T13:57:00Z","content":"When the first human settlement is established on Mars, ensuring food security for a sustainable environment would be a major challenge. In order to overcome this challenge, a team of researchers has… [+2114 chars]"},{"source":{"id":null,"name":"Tech Times"},"author":"Griffin Davis","title":"Planetary Photobombers Can Lead to Data Analysis Errors, Says New Study; Here's What NASA Experts Reveal - Tech Times","description":"Here's what a new NASA study revealed.","url":"https://www.techtimes.com/articles/279442/20220821/planetary-photobombers-lead-data-analysis-errors-new-study-heres-what.htm","urlToImage":"https://1734811051.rsc.cdn77.org/data/images/full/405967/planetary-photobombers-can-lead-to-data-analysis-errors-says-new-study-heres-what-nasa-experts-reveal.jpg","publishedAt":"2022-08-21T13:49:51Z","content":"Planetary photobombers may be quite interesting for some people. But, these exoplanets can actually affect NASA and other space agencies, especially during data analysis. \r\nOn Earth, photobombers can… [+2564 chars]"},{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"University of Pennsylvania: New analysis shows how sulfur clouds can form in Venus’ atmosphere - India Education Diary","description":"High in the atmosphere of Venus, a swirl of sulfur-containing clouds blankets the planet. Dark spots in these clouds correspond with areas of high ultraviolet light absorption, but researchers have yet to confirm the chemical culprit responsible for","url":"https://indiaeducationdiary.in/university-of-pennsylvania-new-analysis-shows-how-sulfur-clouds-can-form-in-venus-atmosphere/","urlToImage":"https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/07/University-of-Pennsylvania.jpg?fit=1024%2C512&ssl=1","publishedAt":"2022-08-21T12:10:40Z","content":"High in the atmosphere of Venus, a swirl of sulfur-containing clouds blankets the planet. Dark spots in these clouds correspond with areas of high ultraviolet light absorption, but researchers have y… [+4365 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"Asteroid sample fetched by Japan's Hayabusa2 found with particles older than the Sun - Republic World","description":"Samples of asteroid Ryugu, which were brought to Earth by Japan's Hayabusa2 spacecraft, have been found to have dust grains that are older than the sun.","url":"https://www.republicworld.com/science/space/asteroid-sample-fetched-by-japans-hayabusa2-found-with-particles-older-than-the-sun-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/pe4fd71lmpxzwqo5_1661080857.jpeg","publishedAt":"2022-08-21T11:41:00Z","content":"Scientists examining the asteroid samples fetched by Japans Hayabusa2 spacecraft have made a significant discovery. In their study published in the journal Astrophysical Journal Letters, the experts … [+2133 chars]"},{"source":{"id":null,"name":"Transcontinentaltimes.com"},"author":"Russell Chattaraj","title":"SpaceX Dragon Cargo Returns from the ISS Carrying Tonnes of Scientific Equipment — Transcontinental Times - Transcontinental Times","description":"UNITED STATES: On Saturday, August 20, a SpaceX Dragon cargo ship carrying tonnes of scientific equipment from the International Space Station made its way back to Earth with an ocean splashdown. After barely more than a month onboard the space station, the u…","url":"https://www.transcontinentaltimes.com/2022/08/21/spacex-dragon-cargo/","urlToImage":"https://www.transcontinentaltimes.com/wp-content/uploads/2022/08/befunky_2022-7-0_16-40-16.jpg","publishedAt":"2022-08-21T11:30:00Z","content":"UNITED STATES: On Saturday, August 20, a SpaceX Dragon cargo ship carrying tonnes of scientific equipment from the International Space Station made its way back to Earth with an ocean splashdown.\r\nAf… [+2956 chars]"},{"source":{"id":null,"name":"Upjobsnews.com"},"author":null,"title":"The project to create more durable space drugs & More Latest News Here - upjobsnews","description":"","url":"https://upjobsnews.com/the-project-to-create-more-durable-space-drugs-more-latest-news-here/","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/The-project-to-create-more-durable-space-drugs.jpeg","publishedAt":"2022-08-21T10:31:45Z","content":"Access to medical supplies is a major concern for astronauts. Difficulty sleeping, pain, congestion, and allergies are common complaints from extraterrestrial missionaries.\r\nDrug use by US crew membe… [+5281 chars]"},{"source":{"id":null,"name":"DNA India"},"author":"DNA Web Team","title":"New study model hints on how organs communicate with one another - DNA India","description":"Researchers have used other methods, such as viral approaches, to understand protein secretion and the ways that organs communicate with each other.","url":"https://www.dnaindia.com/health/report-new-study-model-hints-on-how-organs-communicate-with-one-another-2977449","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/21/2531020-dna-52.png","publishedAt":"2022-08-21T10:30:00Z","content":"Researchers uncover the proteins involved in key communication networks, which could help us better understand conditions like cancer and obesity.\r\nAs the researchers described in Open Biology on Aug… [+3466 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"Astronomers obtain sharpest image of the most massive star ever discovered - Republic World","description":"A star named R136a1, located 1,60,000 light-years away, has been photographed in the most detailed form thanks to the International Gemini Observatory.","url":"https://www.republicworld.com/science/space/astronomers-obtain-sharpest-image-of-the-most-massive-star-ever-discovered-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/tfapjeoqozzwrus5_1661075190.jpeg","publishedAt":"2022-08-21T10:12:00Z","content":"A team of astronomers using the International Gemini Observatory (IGO) has made a significant breakthrough by obtaining the sharpest image of the most massive star discovered to date. Lying 1,60,000 … [+2269 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Strong Solar Flare slams into Earth, Geomagnetic Storm unrest set to continue today, beautiful auroras expected - HT Tech","description":"After the continuous Geomagnetic unrest due to the strong solar flare which impacted Earth magnetosphere, sky watchers can expect auroras today.","url":"https://tech.hindustantimes.com/tech/news/strong-solar-flare-slams-into-earth-geomagnetic-storm-unrest-set-to-continue-today-beautiful-auroras-expected-71661076472706.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/21/1600x900/sun-11030_1631065589823_1661076561990_1661076561990.jpg","publishedAt":"2022-08-21T10:09:52Z","content":"The Sun has been extremely active over the recent weeks and has been shooting of huge amounts of energy in the form of solar flares, some of which has safely dissipated out in space, but then some ca… [+2166 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Samantha Mathewson","title":"Hubble Space Telescope photo shows star-studded globular cluster near Milky Way's core - Space.com","description":"The Hubble Space Telescope captured a new star-studded view of globular cluster NGC 6540, located in the constellation Sagittarius.","url":"https://www.space.com/hubble-space-telescope-photo-sagittarius-globular-cluster","urlToImage":"https://cdn.mos.cms.futurecdn.net/aWrBPkL4eDztCFFSayiJXk-1200-80.jpg","publishedAt":"2022-08-21T10:00:46Z","content":"A new image from the Hubble Space Telescope captures a star-studded cluster in the constellation Sagittarius. \r\nThis stellar grouping, known as globular cluster\r\n NGC 6540, shines brightly with ​​ten… [+2456 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Rod Pyle","title":"A month on 'Mars': Flags and footprints of the moon and Arctic - Space.com","description":"The Apollo lunar landing missions have often been referred to as \"flags and footprints\" sorties. We too are planting flags and leaving footprints, but in a very different way.","url":"https://www.space.com/month-on-mars-flags-and-footprints","urlToImage":"https://cdn.mos.cms.futurecdn.net/ku8BBwGMz6hWjKnmqMvLeN-1200-80.jpg","publishedAt":"2022-08-21T10:00:06Z","content":"The Apollo lunar landing missions have often been referred to as \"flags and footprints\" sorties. \r\nIt's a somewhat derisive term, referring to America's mad dash to reach the moon before the Soviet U… [+6302 chars]"},{"source":{"id":null,"name":"DNA India"},"author":"DNA Web Team","title":"Astronomy was revolutionised by NASA's Copernicus 50 years ago - DNA India","description":"Copernicus was NASA's first multiwavelength astronomy observatory, featuring the largest ultraviolet telescope in space and four X-ray sensors.","url":"https://www.dnaindia.com/science/report-astronomy-was-revolutionised-by-nasa-s-copernicus-50-years-ago-2978300","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/21/2531874-astronomy-was-revolutionised-by-nasa-s-copernicus-50-years-ago.jpg","publishedAt":"2022-08-21T09:06:00Z","content":"Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Aug 21, 2022, 03:48 PM ISTThe Copernicus satellite, the largest and most complicated space observatory of its day, was launched i… [+2803 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"Space news weekly recap: Artemis program, colliding black holes and more - The Indian Express","description":"From NASA's Artemis missions, to colliding black holes, to a malfunctioning cosmonaut space suit, here is our weekly science news recap.","url":"https://indianexpress.com/article/technology/science/space-news-weekly-recap-nasa-artemis-moon-black-hole-cosmonaut-8102993/","urlToImage":"https://images.indianexpress.com/2022/08/NASA-BioSentinel-Yeast-16082022.jpg","publishedAt":"2022-08-21T09:02:14Z","content":"Last week, NASA revealed some of the science and technology payloads that will be hitching a ride to deep space with the agency’s Artemis I moon mission. In the same week, a Russian cosmonaut had to … [+6757 chars]"},{"source":{"id":null,"name":"Transcontinentaltimes.com"},"author":"Russell Chattaraj","title":"Russia Pauses Its Spacewalk Due to a Spacesuit Issue — Transcontinental Times - Transcontinental Times","description":"RUSSIA: A Russian spacewalk from the International Space Station (ISS) had to be aborted this week due to a problem with cosmonaut Oleg Artemyev’s spacesuit. On Wednesday, August 17, Artemyev and co-pilot Denis Matveev were engaged in a six-and-a-half-hour sp…","url":"https://www.transcontinentaltimes.com/2022/08/21/russia-pauses-its-space/","urlToImage":"https://www.transcontinentaltimes.com/wp-content/uploads/2022/08/Twii.jpg","publishedAt":"2022-08-21T08:25:45Z","content":"RUSSIA: A Russian spacewalk from the International Space Station (ISS) had to be aborted this week due to a problem with cosmonaut Oleg Artemyev’s spacesuit.\r\nOn Wednesday, August 17, Artemyev and co… [+2293 chars]"}]}