{"status":"ok","totalResults":70,"articles":[{"source":{"id":"usa-today","name":"USA Today"},"author":"Jordan Mendoza","title":"Ever wanted to name a planet? Here's how to name one found by the James Webb Telescope - USA TODAY","description":"It's not often you get the chance to name planets in space. The International Astronomical Union is now giving you the chance to do so.","url":"https://www.usatoday.com/story/news/world/2022/08/15/james-webb-telescope-name-planet/10324529002/","urlToImage":"https://www.gannett-cdn.com/presto/2022/03/22/USAT/4e96dfad-ec93-47fe-afdd-ea3bd474d5ec-5K_Exo_Beauty_LoRes_FINAL.png?crop=1911,1075,x4,y0&width=1911&height=1075&format=pjpg&auto=webp","publishedAt":"2022-08-15T16:18:19Z","content":"Anyone can name a star online, but the International Astronomical Union is offering a rare space opportunity: to name a planet discovered by the groundbreaking James Webb Telescope. \r\nThe IAU is resp… [+3128 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Scientists develop gel made from spider silk proteins for biomedical applications - Science Daily","description":"Researchers have discovered that spider silk proteins can be fused to biologically active proteins and be converted into a gel at body temperature. One of the goals is to develop an injectable protein solution that forms a gel inside the body, which could be …","url":"https://www.sciencedaily.com/releases/2022/08/220815105610.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-15T16:02:55Z","content":"Researchers at Karolinska Institutet in Sweden and the Swedish University of Agricultural Sciences have discovered that spider silk proteins can be fused to biologically active proteins and be conver… [+3481 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Unexpected quantum effects in natural double-layer graphene - Science Daily","description":"An international research team has detected novel quantum effects in high-precision studies of natural double-layer graphene. This research provides new insights into the interaction of the charge carriers and the different phases, and contributes to the unde…","url":"https://www.sciencedaily.com/releases/2022/08/220815105554.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-15T16:02:54Z","content":"An international research team led by the University of Göttingen has detected novel quantum effects in high-precision studies of natural double-layer graphene and has interpreted them together with … [+2727 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Monisha Ravisetti","title":"New Webb Space Telescope Target: Possibly the Youngest Exoplanet on Record - CNET","description":"If this foreign world truly exists, it would challenge established theories of planet formation. NASA's JWST is on the case.","url":"https://www.cnet.com/science/space/new-webb-space-telescope-target-possibly-the-youngest-exoplanet-on-record/","urlToImage":"https://www.cnet.com/a/img/resize/38e372de507824b3fcc7090e11bb325b8bb1dcc7/2022/08/10/030a1505-7995-4409-a803-3f7d2b8157ca/as-209-a-sierra-cropped.png?auto=webp&fit=crop&height=630&width=1200","publishedAt":"2022-08-15T16:01:06Z","content":"Astronomers said last week that the world's largest radio telescope, the Atacama Large Millimeter/submillimeter Array in Chile, might've picked up a signal from the youngest exoplanet discovered to d… [+4768 chars]"},{"source":{"id":null,"name":"PetaPixel"},"author":"Jaron Schneider","title":"New $70M Supercomputer Generates Highly Detailed Image of a Supernova - PetaPixel","description":"When finished, the new computer will be 30 times more powerful than current systems.","url":"https://petapixel.com/2022/08/15/new-70m-supercomputer-generates-highly-detailed-image-of-a-supernova/","urlToImage":"https://petapixel.com/assets/uploads/2022/08/Detailed-Photo-of-a-Supernova-Remnant-Generated-by-New-70M-Computer-.jpg","publishedAt":"2022-08-15T15:54:07Z","content":"Australia’s newest supercomputer, Setonix, has created a highly-detailed image of a supernova remnant using an enormous amount of data collected by the ASKAP (Australian Square Kilometre Array Pathfi… [+2579 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Network science to study the origins of life - Nature.com","description":"Nature Computational Science - Network science to study the origins of life","url":"https://www.nature.com/articles/s43588-022-00308-y","urlToImage":null,"publishedAt":"2022-08-15T15:37:09Z","content":"Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\r\n the best experience, we recommend you use a more up to date browser (or turn off compatibi… [+139 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"First organic magnesium electride is stable at room temperature - Chemistry World","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LmNoZW1pc3RyeXdvcmxkLmNvbS9uZXdzL2ZpcnN0LW9yZ2FuaWMtbWFnbmVzaXVtLWVsZWN0cmlkZS1pcy1zdGFibGUtYXQtcm9vbS10ZW1wZXJhdHVyZS80MDE2MDQzLmFydGljbGXSAQA?oc=5","urlToImage":null,"publishedAt":"2022-08-15T15:33:13Z","content":null},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Christopher McFadden","title":"This stunning image shows a \"golden swirl\" of newly born stars in a distant galaxy - Interesting Engineering","description":"A new Very Large Telescope image of the galaxy NGC 4303 (Messier 61) shows a golden swirling cloud of baby stars.","url":"https://interestingengineering.com/science/golden-swirl-newly-born-stars","urlToImage":"https://inteng-storage.s3.amazonaws.com/2022/08/15/image/jpeg/Bv8MnhLNsguEzBEJm8NOgtJWJMxfCZxrGQ6uxVhQ.jpg","publishedAt":"2022-08-15T15:13:21Z","content":"\"It has an unusually high amount of stars being born and has been used by astronomers as a laboratory to better understand the fascinating phenomena of star formation,\" the ESO explains.\r\nAn example … [+756 chars]"},{"source":{"id":null,"name":"Zoom"},"author":"TN Science Desk","title":"Watch out! Five asteroids are on their way to Earth this week, Two asteroids to fly by tomorrow (Aug 16) - Times Now","description":"Last week, we saw different asteroids passing by Earth every day, this week again two Asteroids are scheduled to fly by our Planet Earth on Tuesday, August 16.","url":"https://www.timesnownews.com/technology-science/watch-out-five-asteroids-are-on-their-way-to-earth-this-week-two-asteroids-to-fly-by-tomorrow-aug-16-article-93576672","urlToImage":"https://static.tnn.in/thumb/msid-93576672,imgsize-100,width-1280,height-720,resizemode-75/93576672.jpg","publishedAt":"2022-08-15T15:12:12Z","content":"Independence Day 2022: Quotes, wishes, messages, WhatsApp statuses, greetings and images to celebrate freedom on August 15"},{"source":{"id":null,"name":"Azooptics.com"},"author":null,"title":"Using a Fiber-Tip Microforce Sensor for Interfacial Adhesion Forces Measurement - AZoOptics","description":"A newly developed Fiber-Tip Microforce Sensor (FTMS) displays unseen levels of micronewton sensitivity to measure adhesion forces.","url":"https://www.azooptics.com/News.aspx?newsID=27785","urlToImage":"https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_27785_16605751813897317.jpg","publishedAt":"2022-08-15T15:02:00Z","content":"High resolution, high sensitivity measurements of adhesion forces can potentially transform many applications. A newly developed Fiber-Tip Microforce Sensor (FTMS) by Professor Yiping Wang and collea… [+5583 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Scientists clarify how best known superconductor works - Phys.org","description":"In a series of experiments on lanthanum superhydride with impurities, researchers from Skoltech, Lebedev Physical Institute of RAS and their colleagues from the United States, Germany and Japan, have established the mechanism behind the highest-temperature su…","url":"https://phys.org/news/2022-08-scientists-superconductor.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/scientists-clarify-how.jpg","publishedAt":"2022-08-15T14:17:03Z","content":"In a series of experiments on lanthanum superhydride with impurities, researchers from Skoltech, Lebedev Physical Institute of RAS and their colleagues from the United States, Germany and Japan, have… [+5095 chars]"},{"source":{"id":null,"name":"DIYphotography"},"author":"Dunja Djudjic","title":"How far can the James Webb telescope see? This video puts it into perspective - DIYphotography","description":"Thanks to its infrared vision, James Webb Space Telescope can pierce through dust clouds and see further than any telescope has ever seen. As you may have read, it can take photos of the universe as it was over 13 billion years ago. But how far is that exactl…","url":"https://www.diyphotography.net/how-far-can-the-james-webb-telescope-see-this-video-puts-it-into-perspective/","urlToImage":"https://www.diyphotography.net/wp-content/uploads/2022/08/cartwheel-1.jpg","publishedAt":"2022-08-15T13:55:17Z","content":"Thanks to its infrared vision, James Webb Space Telescope can pierce through dust clouds and see further than any telescope has ever seen. As you may have read, it can take photos of the universe as … [+1128 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Andrew Griffin","title":"Scientists discover why asteroid is ejecting material – but now how it is doing it - The Independent","description":"Scientists have finally discovered what the material that is being spat out of an asteroid is – but not exactly how it is happening.","url":"https://www.independent.co.uk/space/nasa-bennu-asteroid-material-meteor-b2145339.html","urlToImage":"https://static.independent.co.uk/2021/11/07/17/bennu-beauty.jpg?quality=75&width=1200&auto=webp","publishedAt":"2022-08-15T13:33:58Z","content":"Scientists have finally discovered what the material that is being spat out of an asteroid is  but not exactly how it is happening.\r\nThe discovery is a step towards understanding a phenomenon that ha… [+2868 chars]"},{"source":{"id":null,"name":"India.com"},"author":"India.com News Desk","title":"NASA Vehicle To Hit Asteroid Racing Towards Earth, Change Its Course To Save Planet - India.com","description":"On September 26, the DART mission is going to change the direction of one such asteroid that is zipping towards the earth by colliding with it.","url":"https://www.india.com/science/nasa-vehicle-to-hit-asteroid-racing-towards-earth-change-its-course-to-save-planet-5573880/","urlToImage":"https://static.india.com/wp-content/uploads/2022/08/QT-dart-mission.jpg","publishedAt":"2022-08-15T13:25:27Z","content":"DART Mission: Every month or two we come across news that some asteroid is racing towards the earth. Sometimes far and sometimes near. But if the real danger to the earth is from any object, then it … [+1972 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Scientists doubt that DeepMind's AI is as good for fractional-charge systems as it seems - Phys.org","description":"In their paper published in Science in December 2021, a DeepMind team showed how neural networks can be used to describe electron interactions in chemical systems more accurately than existing methods. A team of researchers from Skoltech, Zelinsky Institute o…","url":"https://phys.org/news/2022-08-scientists-deepmind-ai-good-fractional-charge.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/scientists-doubt-that.jpg","publishedAt":"2022-08-15T13:18:03Z","content":"In their paper published in Science in December 2021, a DeepMind team showed how neural networks can be used to describe electron interactions in chemical systems more accurately than existing method… [+5137 chars]"},{"source":{"id":null,"name":"Ommcomnews.com"},"author":"OMMCOM NEWS","title":"Oxygen With Magnets May Help Astronauts Breathe Easy | Science & Tech - Ommcom News","description":"London:  Keeping astronauts breathing aboard the International Space Station (ISS) and other space vehicles is a complicated and costly process. An international team of scientists have proposed a potentially better way to make oxygen for astronauts","url":"https://ommcomnews.com/science-tech/oxygen-with-magnets-may-help-astronauts-breathe-easy","urlToImage":"https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/08/15184520/4f691d5b2814bb76a33bcf4454dfd075.jpg","publishedAt":"2022-08-15T13:16:04Z","content":"London:  Keeping astronauts breathing aboard the International Space Station (ISS) and other space vehicles is a complicated and costly process. An international team of scientists have proposed a po… [+2254 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"A HUGE solar flare hurled out by the Sun at over million miles per hour, set to spark scary Geomagnetic storm - HT Tech","description":"A huge solar flare has erupted on the surface of the Sun. It will likely spark a geomagnetic storm on Earth, which can destroy communications infra here","url":"https://tech.hindustantimes.com/tech/news/a-huge-solar-flare-hurled-out-by-the-sun-at-over-million-miles-per-hour-set-to-spark-scary-geomagnetic-storm-71660566634087.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/15/1600x900/faintyoung_1652920721271_1660566758670_1660566758670.jpg","publishedAt":"2022-08-15T12:33:16Z","content":"The Sun is getting more and more active day by day as it reaches the peak of its 11-year solar cycle while unleashing more volatile solar flares and CMEs. Recently, space agencies warned that a stron… [+1971 chars]"},{"source":{"id":null,"name":"ExtremeTech"},"author":"Ryan Whitwam","title":"Hubble Helps Demystify Dimming Supergiant Star Betelgeuse - ExtremeTech","description":"With the aid of the Hubble Space Telescope, scientists from the Harvard-Smithsonian Center for Astrophysics have identified the cause of Betelgeuse's 2019 dimming: an unfathomably large Surface Mass Ejection (SME), which is something we've never observed befo…","url":"https://www.extremetech.com/?p=338802","urlToImage":"https://www.extremetech.com/wp-content/uploads/2015/04/Hubble-640x353.jpg","publishedAt":"2022-08-15T12:12:00Z","content":"The enormous star known as Betelgeuse has been a target of study since the early days of astronomy. As one of the brightest objects in the sky, it’s visible even without a telescope. But in 2019, it … [+2553 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"NASA Hubble Space Telescope captures Orion Nebula- check mind-blowing image - HT Tech","description":"Image of the Orion Nebula- closest large star-forming region to Earth has been captured by Hubble Space Telescope. Here is what NASA informs.","url":"https://tech.hindustantimes.com/tech/news/nasa-hubble-space-telescope-captures-orion-nebula-check-mind-blowing-image-71660565072445.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/15/1600x900/FaEPb2RXEAAfJsZ_1660565143942_1660565163038_1660565163038.jpg","publishedAt":"2022-08-15T12:08:55Z","content":"Do you know which is the closest large star-forming region to Earth? You will be surprised to know that NASA's Hubble Space Telescope has captured an image of the same. Orion Nebula is the closest la… [+1927 chars]"},{"source":{"id":null,"name":"Mid-day"},"author":null,"title":"New study by scientists sheds light on the origin of the Moon - mid-day.com","description":"The discovery, published in the journal Science Advances, adds to the already strong constraints on the currently favoured \"Giant Impact\" theory that hypothesises the Moon was formed by a massive collision between Earth and another celestial body","url":"https://www.mid-day.com/lifestyle/nature-and-wildlife/article/new-study-by-scientists-sheds-light-on-the-origin-of-the-moon-23241071","urlToImage":"https://images.mid-day.com/images/images/2022/aug/Moonistock_d.jpg","publishedAt":"2022-08-15T11:30:00Z","content":"The discovery, published in the journal Science Advances, adds to the already strong constraints on the currently favoured \"Giant Impact\" theory that hypothesises the Moon was formed by a massive col… [+3657 chars]"}]}