{"status":"ok","totalResults":64,"articles":[{"source":{"id":null,"name":"Zoom"},"author":"TN Science Desk","title":"NASA's new Space Launch System moon rocket Artemis 1 rolled out to launch pad ahead of August 29 - Times Now","description":"The National Aeronautics and Space Administration's (NASA's) giant new Space Launch System moon rocket was rolled out to the Kennedy Space Center launch pad on Wednesday. The Orion is stacked atop the rocket.","url":"https://www.timesnownews.com/technology-science/nasas-new-space-launch-system-moon-rocket-artemis-1-rolled-out-to-launch-pad-ahead-of-august-29-article-93625900","urlToImage":"https://static.tnn.in/thumb/msid-93625900,imgsize-100,width-1280,height-720,resizemode-75/93625900.jpg","publishedAt":"2022-08-17T23:40:13Z","content":"Independence Day 2022: Quotes, wishes, messages, WhatsApp statuses, greetings and images to celebrate freedom on August 15"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Rocket built in New Orleans going to the moon - WWLTV","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DAy9Deh9gYUg","urlToImage":null,"publishedAt":"2022-08-17T23:25:59Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"ESO telescope images a spectacular cosmic dance - Science Daily","description":"ESO's Very Large Telescope (VLT) has imaged the result of a spectacular cosmic collision -- the galaxy NGC 7727. This giant was born from the merger of two galaxies, an event that started around a billion years ago. At its center lies the closest pair of supe…","url":"https://www.sciencedaily.com/releases/2022/08/220817135606.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-17T19:37:30Z","content":"ESO's Very Large Telescope (VLT) has imaged the result of a spectacular cosmic collision -- the galaxy NGC 7727. This giant was born from the merger of two galaxies, an event that started around a bi… [+2770 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"New quantum technology combines free electrons and photons - Phys.org","description":"Faster computers, tap-proof communication, better car sensors—quantum technologies have the potential to revolutionize our lives just as the invention of computers or the internet once did. Experts worldwide are trying to implement findings from basic researc…","url":"https://phys.org/news/2022-08-quantum-technology-combines-free-electrons.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/new-quantum-technology.jpg","publishedAt":"2022-08-17T19:24:44Z","content":"Faster computers, tap-proof communication, better car sensorsquantum technologies have the potential to revolutionize our lives just as the invention of computers or the internet once did. Experts wo… [+3345 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Researchers explore how impacts 'break in' a new planet - Phys.org","description":"The harder you hit something—a ball, a walnut, a geode—the more likely it is to break open. Or, if it does not break open, it's more likely to at least lose a little bit of its structural integrity, the way new baseball gloves do when players pummel them to m…","url":"https://phys.org/news/2022-08-explore-impacts-planet.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/breaking-in-new-planet.jpg","publishedAt":"2022-08-17T19:23:29Z","content":"The harder you hit somethinga ball, a walnut, a geodethe more likely it is to break open. Or, if it does not break open, it's more likely to at least lose a little bit of its structural integrity, th… [+3242 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Black hole collisions could help us measure how fast the universe is expanding: Astronomers propose 'spectral siren' method to understand evolution of the universe - Science Daily","description":"Astrophysicists have laid out a method for how to use pairs of colliding black holes to measure how fast our universe is expanding -- and thus help illuminate how the universe evolved, what it is made out of, and where it's going.","url":"https://www.sciencedaily.com/releases/2022/08/220817104049.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-17T18:14:28Z","content":"A black hole is usually where information goes to disappear -- but scientists may have found a trick to use its last moments to tell us about the history of the universe. In a new study, two Universi… [+4893 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Big splash: Scientists present a new model for predicting droplet splashing behavior on solid surfaces: The new model provides important insights that could enable advances in agriculture, epidemiology, and printing technology - Science Daily","description":"Understanding liquid droplet behavior has major implications in coating industry, agriculture, and epidemiology, among others. Although well-studied and extensively researched, the mechanism of droplet splashing after impingement still remains unclear. Now, s…","url":"https://www.sciencedaily.com/releases/2022/08/220817104026.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-17T17:44:40Z","content":"The study of liquid droplets and their behavior upon impingement is of major importance in many fields, including agriculture, engineering, and medicine. Droplet behavior prediction has use in spray … [+3249 chars]"},{"source":{"id":null,"name":"Nationworldnews.com"},"author":"https://www.facebook.com/nationworldnews1","title":"Knowing The Mahapar Stone At Taskmalaya, It Is Said That It Has Been In Existence Since 6000 BC. - Nation World News","description":"Nation World News - In a new study, researchers found that the earliest known fruit-eating bird was an ancient bird called Jeholornis that lived 120 million","url":"https://nationworldnews.com/knowing-the-mahapar-stone-at-taskmalaya-it-is-said-that-it-has-been-in-existence-since-6000-bc/","urlToImage":"https://nationworldnews.com/wp-content/uploads/2022/08/Knowing-the-Mahapar-stone-at-Taskmalaya-it-is-said-that.jpg","publishedAt":"2022-08-17T17:38:53Z","content":"Nation World News – In a new study, researchers found that the earliest known fruit-eating bird was an ancient bird called Jeholornis that lived 120 million years ago.\r\nHundreds of animals living on … [+5224 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Calla Cofield","title":"Test chamber for NASA's new cosmic mapmaker makes dramatic entrance - Phys.org","description":"After three years of design and construction, a monthlong boat ride across the Pacific Ocean, and a lift from a 30-ton crane, the customized test chamber for NASA's upcoming SPHEREx mission has finally reached its destination at Caltech's Cahill Center for As…","url":"https://phys.org/news/2022-08-chamber-nasa-cosmic-mapmaker-entrance.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/test-chamber-for-nasas.jpg","publishedAt":"2022-08-17T16:34:14Z","content":"After three years of design and construction, a monthlong boat ride across the Pacific Ocean, and a lift from a 30-ton crane, the customized test chamber for NASA's upcoming SPHEREx mission has final… [+5082 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Explained Desk","title":"Did asteroids bring water to Earth? Findings of the Hayabusa-2 probe, explained - The Indian Express","description":"The Hayabusa-2 probe brought 5.4 grams of rocks and dust from the asteroid Ryugu to Earth in December 2020. Here is what its study has revealed.","url":"https://indianexpress.com/article/explained/explained-sci-tech/did-asteroids-bring-water-to-earth-findings-hayabusa-2-probe-explained-8096144/","urlToImage":"https://images.indianexpress.com/2020/12/hayabusa2-759x422-1.jpg","publishedAt":"2022-08-17T16:18:26Z","content":"How did the Earth, believed to have been covered in bubbling oceans of magma billions of years ago, transform into the blue planet and become covered in water? In an article published in the journal … [+5026 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"Sun's 'Cannibal Coronal Mass Ejections’ to trigger geomagnetic storms on August 18 - Moneycontrol","description":"According to NASA, Coronal Mass Ejections (CMEs) can carry the mass of over 250 elephants and has the energy of 75 trillion lightning strikes.","url":"https://www.moneycontrol.com/news/trends/suns-cannibal-coronal-mass-ejections-to-trigger-geomagnetic-storms-on-august-18-9046851.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/08/Collage-Maker-17-Aug-2022-09.06-PM-770x435.jpg","publishedAt":"2022-08-17T15:42:12Z","content":"Earthlings better brace for geostorms on August 18 as a phenomenon called  Cannibal Coronal Mass Ejections caused by the Sun is likely to result in power grid fluctuations, impact satellite operation… [+2500 chars]"},{"source":{"id":null,"name":"Daily Mail"},"author":"Shivali Best","title":"Earth's shifting continents could WIPE OUT marine life in deepest oceans, study warns - Daily Mail","description":"Researchers from University of California, Riverside have warned that movement of Earth's continents could wipe out marine life in the deepest parts of the oceans by starving them of oxygen.","url":"https://www.dailymail.co.uk/sciencetech/article-11120083/Earths-shifting-continents-WIPE-marine-life-deepest-oceans-study-warns.html","urlToImage":"https://i.dailymail.co.uk/1s/2022/08/17/14/61469285-0-image-a-40_1660743568154.jpg","publishedAt":"2022-08-17T15:00:46Z","content":"It's not something you'd be able to tell from up here on the surface, but Earth's continents are constantly on the move.\r\nNow, a new study has warned that this movement could wipe out marine life in … [+5457 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"NASA Identified the Strange Tangled Object Found on Mars - Mashable","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D5iO99MLq_TE","urlToImage":null,"publishedAt":"2022-08-17T14:22:51Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Shaurya Tomer","title":"Huge asteroid, clocked at an amazing 64800kmph, sets up close encounter with Earth on August 22 - HT Tech","description":"NASA has warned that Asteroid 2020 QW3 has been observed heading for Earth at staggering speed. It will miss Earth by just a few million miles.","url":"https://tech.hindustantimes.com/tech/news/huge-asteroid-clocked-at-an-amazing-64800kmph-sets-up-close-encounter-with-earth-on-august-22-71660744550305.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/17/1600x900/asteroid-6025507_1920_1648098187847_1660744600734_1660744600734.jpg","publishedAt":"2022-08-17T13:58:08Z","content":"A 92 feet wide asteroid named Asteroid 2020 QW3, nearly the size of an aeroplane, will just miss Earth on August 22. The close encounter between the Earth and the asteroid will happen at 06:41am, acc… [+1727 chars]"},{"source":{"id":"cbc-news","name":"CBC News"},"author":null,"title":"Humans are heading back to the moon — and Canada is playing a bigger role than you may realize - CBC News","description":"As NASA prepares to launch the Artemis I moon rocket, Canada is heavily involved — from a new Canadarm to an astronaut who will be on the next phase of the mission.","url":"https://www.cbc.ca/news/science/canada-artemis-moon-1.6552605","urlToImage":"https://i.cbc.ca/1.6552790.1660673865!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/artemis-i.jpeg","publishedAt":"2022-08-17T13:50:29Z","content":"If all goes as planned, NASA's most powerful rocket yet will roar to life on the morning of Aug. 29, as part of the Artemis I mission to the moon.\r\nWhile the mission will be uncrewed the only passeng… [+6085 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Jeffrey Cooke","title":"Scientists are turning data into sound to listen to the whispers of the universe (and more) - Phys.org","description":"We often think of astronomy as a visual science with beautiful images of the universe. However, astronomers use a wide range of analysis tools beyond images to understand nature at a deeper level.","url":"https://phys.org/news/2022-08-scientists-universe.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/scientists-are-turning.jpg","publishedAt":"2022-08-17T13:43:56Z","content":"We often think of astronomy as a visual science with beautiful images of the universe. However, astronomers use a wide range of analysis tools beyond images to understand nature at a deeper level.\r\nD… [+6363 chars]"},{"source":{"id":null,"name":"News18"},"author":"Buzz Staff","title":"NASA Lucy Mission Finds Trojan Asteroid Around Jupiter With Its Own Moon - News18","description":"The companion rock is reported to be roughly 200 kilometres away from Polymele and is 5 kilometres in diameter.","url":"https://www.news18.com/news/buzz/nasa-lucy-mission-finds-trojan-asteroid-around-jupiter-with-its-own-moon-5769469.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/trojan-asteroid-178-166073964116x9.png","publishedAt":"2022-08-17T12:37:47Z","content":"US space agency NASAs Lucy mission has delivered one of the many exciting discoveries that are awaited and expected from the probe spacecraft. Lucys team has detected that one of the Trojan asteroids… [+1653 chars]"},{"source":{"id":null,"name":"The Weather Channel"},"author":null,"title":"Baby Exoplanet, Possibly the Youngest on Record, Spotted 395 Light-Years Away; May Help Us Understand Planet Formation - The Weather Channel","description":"Until recently, astronomers puzzled over planet formation simply because they never really got to see this process in action. - Articles from The Weather Channel | weather.com","url":"https://weather.com/en-IN/india/space/news/2022-08-17-baby-exoplanet-spotted-395-light-years-away","urlToImage":"https://s.w-x.co/in-AS-209-A-Sierra.jpg","publishedAt":"2022-08-17T12:08:54Z","content":"Until recently, astronomers puzzled over planet formation simply because they never really got to see this process in action. The planets in and around our solar system are ancientour Earth, for inst… [+3706 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Elizabeth Howell","title":"The κ-Cygnid meteor shower reaches its peak on Aug. 18. Here's what to expect. - Space.com","description":"Look carefully, because at best you will spot about three meteors per hour.","url":"https://www.space.com/k-cygnid-meteor-shower-peak-2022","urlToImage":"https://cdn.mos.cms.futurecdn.net/WpDzN4dvrDfzvtXnH7LxNP-1200-80.jpg","publishedAt":"2022-08-17T12:04:27Z","content":"If you're up for an observing challenge, the κ-Cygnid (Kappa Cygnid) meteor shower will produce a few bright shooting stars during its peak Thursday (Aug. 18).\r\nUp to three meteors per hour will be v… [+2121 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Claire Reilly","title":"How NASA Will Bring Mars Rocks -- and Air -- to Earth - CNET","description":"In 2033, scientists hope to get their hands on the first pieces of Mars, collected by a rover and ferried back by a team of robots, helicopters and a rocket.","url":"https://www.cnet.com/science/space/how-nasa-esa-will-bring-mars-rocks-and-atmosphere-to-earth/","urlToImage":"https://www.cnet.com/a/img/resize/b34ceadc294ea2009fb6755978a750cc24745f27/2022/07/28/681cdee8-2a47-4539-b706-b94509909603/msr-graphic-arm.jpg?auto=webp&fit=crop&height=630&width=1200","publishedAt":"2022-08-17T12:00:00Z","content":"Since it landed on Mars in 2021, NASA's Perseverance Rover has been pottering around the red planet, doing what Dad does at Costco: quietly hoovering up samples. And just like Dad does with those tas… [+1662 chars]"}]}