{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"NASA satellite spots peculiar cloud over the Caspian Sea - The Indian Express","description":"Unlike the diffused and dispersed cloud cover that is typically observed, this cloud spotted over the Caspian Sea had well-defined edged, like something out a of a cartoon.","url":"https://indianexpress.com/article/technology/science/nasa-satellite-spots-peculiar-cloud-over-the-caspian-sea/","urlToImage":"https://images.indianexpress.com/2022/06/Peculiar-shape-cloud-caspian-sea.jpg","publishedAt":"2022-06-19T10:35:40Z","content":"It is not unusual to spot clouds hovering over at least part of the largest inland body of water on the planet, the Caspian Sea. but on May 28, NASA’s Moderate Resolution Imaging Spectroradiometer (M… [+1809 chars]"},{"source":{"id":null,"name":"Thetimeshub.in"},"author":"Kumar Natasha","title":"An Earth-like planet found near a star adjacent to the Sun - The Times Hub","description":"Photo : pixabay.comAn Earth-like planet found near a star adjacent to the Sun Exoplanet Ross 508 b has a minimum mass of four Earth masses","url":"https://thetimeshub.in/an-earth-like-planet-found-near-a-star-adjacent-to-the-sun/1182/","urlToImage":null,"publishedAt":"2022-06-19T10:17:31Z","content":"Photo : pixabay.comAn Earth-like planet found near a star adjacent to the Sun\r\nExoplanet Ross 508 b has a minimum mass of four Earth masses and revolves around its host every 10.75 days at a distance… [+1836 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"The James Webb Space Telescope has survived the impact of a micrometeorite - BollyInside","description":"Despite being hit by grain-sized debris flying across its path, scientists say the James Webb Space Telescope is still on track to send its first infrared","url":"https://www.bollyinside.com/news/the-james-webb-space-telescope-has-survived-the-impact-of-a-micrometeorite","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/The-James-Webb-Space-Telescope-has-survived-the-impact-of.jpeg","publishedAt":"2022-06-19T09:44:19Z","content":"Despite being hit by grain-sized debris flying across its path, scientists say the James Webb Space Telescope is still on track to send its first infrared images.\r\nMicrometeoroids struck the Universi… [+826 chars]"},{"source":{"id":null,"name":"physicsworld.com"},"author":null,"title":"Telescopes, accelerators and LIGO team up to probe neutron stars – Physics World - physicsworld.com","description":"Multimessenger astronomy observations combine with heavy-ion collision experiments to constrain the equation of state for super-dense stellar remnants","url":"https://physicsworld.com/a/telescopes-accelerators-and-ligo-team-up-to-probe-neutron-stars/","urlToImage":"https://physicsworld.com/wp-content/uploads/2022/06/artist_NSIllustration_CREDIT__NSF_LIGO_Sonoma_State_University_A._Simonnet_resized.jpg","publishedAt":"2022-06-19T09:20:30Z","content":"Cataclysm: Artists illustration of two merging neutron stars. (Courtesy: NSF/LIGO/Sonoma State University/A. Simonnet)\r\nPhysicists have created a framework for better understanding the super-dense ma… [+5127 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"Space news this week: 'Signs of aliens', cosmic cannibalism and the fastest-growing black hole - The Indian Express","description":"From a 'cosmic cannibal' ripping up an entire planetary system to reports of signs of extra-terrestrial life, here is some of the most exciting space news from last week.","url":"https://indianexpress.com/article/technology/science/space-news-this-week-aliens-cosmic-cannibalism-black-hole-797826/","urlToImage":"https://images.indianexpress.com/2022/06/Space-news-this-week-220619.jpg","publishedAt":"2022-06-19T07:45:41Z","content":"China said it may have detected signs of alien civilisations\r\nChina said that its massive Giant Eye telescope may have picked up signs of alien civilisations, according to a report by the state-backe… [+3936 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"China finds signs of water in moon's 'Ocean of Storms' - India Today","description":"The scientists said they found evidence of water in the form of hydroxyl encased in a crystalline mineral known as apatite.","url":"https://www.indiatoday.in/science/story/china-finds-signs-of-water-in-moon-s-ocean-of-storms-1964187-2022-06-19","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/china_rocket_reuters-647x363.jpeg?CJ1enWjCCee.pRhXR1DK8Xg8v.sxKZbJ","publishedAt":"2022-06-19T06:52:20Z","content":"Chinese scientists have found signs of water in samples retrieved by China from a lava plain on the moon, bringing them closer to understanding its origin there - a crucial question for future lunar … [+1691 chars]"},{"source":{"id":null,"name":"Jagran.com"},"author":"Simran Srivastav","title":"Australian Scientists Spot Fastest-Growing Black Hole That Can Consume One Earth Per Second - Jagran English","description":"","url":"https://english.jagran.com/trending/australian-scientists-spot-fastestgrowing-black-hole-that-can-consume-one-earth-per-second-10044902","urlToImage":"https://imgeng.jagran.com/images/2022/jun/BlackHole1655621314583.jpg","publishedAt":"2022-06-19T06:46:00Z","content":"New Delhi | Jagran Trending Desk: Astronomers from an Australian University have recently discovered a black hole, that can swallow one Earth each second. This black hole is also the fastest-growing … [+1782 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Elon Musk led SpaceX launches Globalstar satellite on Falcon 9 rocket - HT Tech","description":"SpaceX launched the Falcon 9 satellite carrying the Globalstar satellite. What will it do? Know the details here.","url":"https://tech.hindustantimes.com/tech/news/elon-musk-led-spacex-launches-globalstar-satellite-on-falcon-9-rocket-71655617371884.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/19/1600x900/SPACEX-FUNDRAISING--0_1655617502417_1655617588916.JPG","publishedAt":"2022-06-19T05:47:16Z","content":"SpaceX has launched its Falcon 9 rocket in the early hours of Sunday morning from Space Launch Complex 40 at the Cape Canaveral Space Force Station. The rocket took off with a Globalstar satellite ab… [+1990 chars]"},{"source":{"id":null,"name":"Wonderfulengineering.com"},"author":null,"title":"Scientists Have Disovered Viruses That ‘Secretly Rule The World’s Oceans’ - Wonderful Engineering","description":"Advertisement The recent study published in the journal Science on Thursday focuses on viruses that include RNA, a molecular cousin of DNA. In human illness, RNA viruses abound; coronaviruses and influenza viruses, for example, are both RNA-based. Scientists …","url":"https://wonderfulengineering.com/scientists-have-disovered-viruses-that-secretly-rule-the-worlds-oceans/","urlToImage":"https://wonderfulengineering.com/wp-content/uploads/2022/06/imgonline-com-ua-resize-puveuXx5RlV.jpg","publishedAt":"2022-06-19T05:45:06Z","content":"The recent study published in the journal Science on Thursday focuses on viruses that include RNA, a molecular cousin of DNA. In human illness, RNA viruses abound; coronaviruses and influenza viruses… [+3211 chars]"},{"source":{"id":null,"name":"Wonderfulengineering.com"},"author":null,"title":"Scientists Have Analyzed A Report About Signs Of Life On Venus – This Is What They Found - Wonderful Engineering","description":"Advertisement A team of researchers from the University of Cambridge has gone through an in-depth analysis to explore the possibility of life on the clouds of Venus, but the results reveal that there were no signs related to any kind of species encapsulating …","url":"https://wonderfulengineering.com/scientists-have-analyzed-a-report-about-signs-of-life-on-venus-this-is-what-they-found/","urlToImage":"https://wonderfulengineering.com/wp-content/uploads/2022/06/L6GRGgkt4PhNJhB6uTdgmS.jpg","publishedAt":"2022-06-19T05:38:34Z","content":"A team of researchers from the University of Cambridge has gone through an in-depth analysis to explore the possibility of life on the clouds of Venus, but the results reveal that there were no signs… [+2783 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"NASA Artemis I Moon mission wet dress rehearsal underway: watch it live - The Indian Express","description":"After three abortive attempts, the SLS rocket and Orion Spacecraft have begun a wet dress rehearsal ahead of NASA's Artemis I Moon mission.","url":"https://indianexpress.com/article/technology/science/nasa-artemis-i-moon-mission-wet-dress-rehearsal-live-7978092/","urlToImage":"https://images.indianexpress.com/2022/04/NASA-SLS-rocket-roll-back-wet-dress-rehearsal.jpg","publishedAt":"2022-06-19T05:14:37Z","content":"At around 2.30 AM today (IST), the launch team checked into their stations at the Launch Control Center at NASAs Kennedy Space Center in Florida to begin the wet dress rehearsal test for NASAs Artemi… [+2234 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"EVAN GOUGH, Universe Today","title":"Astronomers Unveil The Most Detailed Map of The Metal Asteroid Psyche Yet - ScienceAlert","description":"If you wanted to do a forensic study of the Solar System, you might head for the main asteroid belt between Mars and Jupiter. That's where you can find ancient rocks from the Solar System's early days. Out there in the cold vacuum of space, far from","url":"https://www.sciencealert.com/astronomers-unveil-the-most-detailed-map-of-the-asteroid-psyche-yet","urlToImage":"https://www.sciencealert.com/images/2022-06/processed/PsycheAsteroidIllustrationNASA_1024.jpg","publishedAt":"2022-06-19T04:17:39Z","content":"If you wanted to do a forensic study of the Solar System, you might head for the main asteroid belt between Mars and Jupiter. That's where you can find ancient rocks from the Solar System's early day… [+10149 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"A MAJOR solar flare can have a huge impact on Earth- power, phones to internet! - HT Tech","description":"A solar flare is a massive outburst of energy from the Sun. What if we are directly hit by a major one? This is how solar flares can impact us.","url":"https://tech.hindustantimes.com/tech/news/a-major-solar-flare-can-have-a-huge-impact-on-earth-power-phones-to-internet-71655609947833.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/19/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1655610096651.jpg","publishedAt":"2022-06-19T03:42:43Z","content":"The Sun is essential for the survival of plants as well as humans on Earth, but this giant energy source can also disrupt all kinds of technology on Earth including the largest communication system t… [+2329 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":null,"title":"Mummified remains of 16th-century man could help crack history of E. coli evolution - ThePrint","description":"ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.","url":"https://theprint.in/scientifix/mummified-remains-of-16th-century-man-could-help-crack-history-of-e-coli-evolution/1000779/","urlToImage":"https://static.theprint.in/wp-content/uploads/2022/06/Mummified-Italian.jpg","publishedAt":"2022-06-19T03:19:57Z","content":"New Delhi: Using fragments extracted from the mummified remains of an Italian nobleman who died over 400 years ago, researchers have identified and reconstructed the first ancient genome of E. coli b… [+6019 chars]"},{"source":{"id":null,"name":"Eurasiantimes.com"},"author":null,"title":"Outpacing NASA By 10 Times, China Sets Sight To Develop A Giant Telescope To Search For ‘Things That Matter’ - EurAsian Times","description":"To gain an edge over the US space agency NASA, Chinese scientists aim to develop a next-gen space observatory to search for dark matter. The ambitious project – known as the Very Large Area gamma-ray Space Telescope, or VLAST – is currently in its early stage…","url":"https://eurasiantimes.com/china-is-in-the-race-to-develop-a-giant-telescope-to-search-for-dark-matte/","urlToImage":"https://eurasiantimes.com/wp-content/uploads/2022/06/Dark-Matter.jpg","publishedAt":"2022-06-19T02:18:57Z","content":"To gain an edge over the US space agency NASA, Chinese scientists aim to develop a next-gen space observatory to search for dark matter. The ambitious project known as the Very Large Area gamma-ray S… [+4781 chars]"},{"source":{"id":null,"name":"Playcrazygame.com"},"author":"Abhishek Pratap","title":"The sky is not the limit | Explosion in China, “snake” and garbage on Mars and more! - Play Crazy Game","description":"Explosions on Jupiter and here on Earth, more strange things photographed on Mars and alien signals (or not) are some of the themes that have been prominent in recent times in astronomy and space. And let's not forget about NASA, which is doing yet another te…","url":"https://playcrazygame.com/2022/06/19/the-sky-is-not-the-limit-explosion-in-china-snake-and-garbage-on-mars-and-more/","urlToImage":"https://t.ctcdn.com.br/MWPf9DGmqZurzxCr6GYLvOhc51w=/1280x720/smart/i603302.png","publishedAt":"2022-06-19T02:18:17Z","content":"Explosions on Jupiter and here on Earth, more strange things photographed on Mars and alien signals (or not) are some of the themes that have been prominent in recent times in astronomy and space. An… [+5835 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Research shows that scientists serendipitously discover rare cluster compound - ANI News","description":"Kyoto [Japan], June 19 (ANI): Scientists at Kyoto University's Institute for Cell-Material Sciences have discovered a new compound from the group that could prove to be a catalyst. The compounds known as polyoxometalates contain a large group of metal oxides …","url":"https://www.aninews.in/news/science/research-shows-that-scientists-serendipitously-discover-rare-cluster-compound20220619065909","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/pexe02022061901033820220619012816.jpg","publishedAt":"2022-06-19T01:29:00Z","content":"Kyoto [Japan], June 19 (ANI): Scientists at Kyoto University's Institute for Cell-Material Sciences have discovered a new compound from the group that could prove to be a catalyst. The compounds know… [+2606 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Research shows electrons take fast and slow tracks at same time - ANI News","description":"Cambridge [UK], June 19 (ANI): Imagine a highway with two lanes in each direction. One lane is for slow cars and the other is for fast cars. For electrons moving along a quantum wire, the Cambridge and Frankfurt researchers found that there are also two 'trac…","url":"https://www.aninews.in/news/science/research-shows-electrons-take-fast-and-slow-tracks-at-same-time20220619062919","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/Collage_Maker-19-Jun-2022-06.22-AM20220619005256.jpg","publishedAt":"2022-06-19T00:59:00Z","content":"ANI | Updated: Jun 19, 2022 06:29 IST\r\nCambridge [UK], June 19 (ANI): Imagine a highway with two lanes in each direction. One lane is for slow cars and the other is for fast cars. For electrons movin… [+2577 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"Deep space astronomers discovered a lopsided magnetic field. I was hiding a star - BollyInside","description":"Two stars that were born in the same stellar nursery but at opposing ends appear to have found each other. But there were no angels singing or destinies","url":"https://www.bollyinside.com/news/deep-space-astronomers-discovered-a-lopsided-magnetic-field-i-was-hiding-a-star","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/Deep-space-astronomers-discovered-a-lopsided-magnetic-field-I-was.jpeg","publishedAt":"2022-06-18T23:44:17Z","content":"Two stars that were born in the same stellar nursery but at opposing ends appear to have found each other. But there were no angels singing or destinies falling into place when these stars aligned. T… [+4056 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Deep Underground Experiment Results Confirm Anomaly: Possible New Fundamental Physics - SciTechDaily","description":"Sterile neutrino, physics fundamentals among interpretations of anomalous results. New scientific results confirm an anomaly seen in previous experiments, which may point to an as-yet-unconfirmed new elementary particle, the sterile neutrino, or indicate the …","url":"https://scitechdaily.com/?p=177742","urlToImage":"https://scitechdaily.com/images/Plasma-Particle-Physics-Art-Concept.jpg","publishedAt":"2022-06-18T23:33:51Z","content":"New results from the Baksan Experiment on Sterile Transitions (BEST) experiment confirm anomaly suggesting new physics possibility.\r\nSterile neutrino, physics fundamentals among interpretations of an… [+4452 chars]"}]}