{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Artemis I Flight Readiness Review Briefing - NASA Video","description":"Following the Aug. 22 flight readiness review, NASA managers provide a news update on the Artemis I mission, scheduled to launch at 8:33 a.m. EDT (12:33 UTC)...","url":"https://www.youtube.com/watch?v=4an27_S7b_8","urlToImage":"https://i.ytimg.com/vi/4an27_S7b_8/maxresdefault_live.jpg","publishedAt":"2022-08-23T00:00:48Z","content":null},{"source":{"id":null,"name":"Freethink.com"},"author":"Kristin Houser","title":"NASA thinks it may snow upside down on Europa - Freethink","description":"A study of “underwater snow” on Earth is informing NASA’s hunt for habitable locations on Jupiter’s icy moon Europa.","url":"https://www.freethink.com/space/icy-moon-europa-clipper","urlToImage":"https://www.freethink.com/wp-content/uploads/2022/08/icy-moon-europa-clipper-a-thumb.jpg?resize=1200,630","publishedAt":"2022-08-22T22:00:00Z","content":null},{"source":{"id":null,"name":"CNET"},"author":"Monisha Ravisetti","title":"Universe's Most Massive Known Star Captured With Unprecedented Clarity - CNET","description":"It's a tad bit smaller than scientists expected, but it's still an absolute unit.","url":"https://www.cnet.com/science/space/universes-most-massive-known-star-captured-with-unprecedented-clarity/","urlToImage":"https://www.cnet.com/a/img/resize/467c9e55ca2a6b7615f7edcc46d913a32d8c3acd/2022/08/22/171f3df7-560a-46ee-98ec-f2e76d3afa74/image-of-star.jpg?auto=webp&fit=crop&height=630&width=1200","publishedAt":"2022-08-22T21:59:26Z","content":"To put it simply, the universe's most massive known star is less massive than scientists once believed. But even docked a few levels, this staggering ball of gas is still the universe's most massive … [+5420 chars]"},{"source":{"id":null,"name":"Thetimeshub.in"},"author":"Kumar Natasha","title":"The astronaut took a picture of the polar sky - The Times Hub","description":"Photo: twitter.com/astro_farmerbobPolar sky Polar sky was evicted by a coronal sweep from Sontsya, which triggered geomagnetic storms on the Earth's G2 level. Astronaut Robert Hines","url":"https://thetimeshub.in/the-astronaut-took-a-picture-of-the-polar-sky/30776/","urlToImage":null,"publishedAt":"2022-08-22T21:16:57Z","content":"Photo: twitter.com/astro_farmerbobPolar sky\r\n Astronaut Robert Hines captured the glaring polar sky images from the International Space Station. The stench of’appeared after the anger of two coronal … [+610 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Lessons from natural photosynthesis: Conversion of CO2 to raw materials for plastic - Science Daily","description":"Researchers have successfully synthesized fumarate (fumaric acid), a raw material for unsaturated polyester resin, by combining carbon dioxide (CO2) with pyruvate (derived from biomass), using two biocatalysts: malate dehydrogenase and fumarase. Fumarate is c…","url":"https://www.sciencedaily.com/releases/2022/08/220822130338.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-22T21:08:56Z","content":"In plants, natural photosynthesis binds carbon dioxide (CO2) to organic compounds, which can then be converted into glucose or starch. These useful molecules can be sequestered, storing the carbon in… [+1651 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Noor Al-Sibai","title":"Scientists Intrigued by Sharks That Can Walk on Land for Two Hours - Futurism","description":"Do not panic when you read the following sentence: there are now walking sharks who have come out of the ocean to walk on land.","url":"https://futurism.com/walking-sharks-epaulettes-locomotion","urlToImage":"https://wp-assets.futurism.com/2022/08/walking-sharks-epaulettes-locomotion.jpg","publishedAt":"2022-08-22T20:40:33Z","content":"Do not panic when you read the following sentence: there are sharks that have developed legs who can walk on land.\r\nNo, this isn't a creature feature a la \"Sharknado\" or \"Snakes on a Plane.\" This is … [+2788 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Anjali Marar","title":"IIA researchers develop model to find exomoons around distant stars - The Indian Express","description":"Two researchers from the Indian Institute of Astrophysics (IIA), Bengaluru, have developed a model that can use the data obtained from the recently-launched James Webb Space Telescope (JWST) to confirm the presence of these elusive exomoons.","url":"https://indianexpress.com/article/cities/pune/iia-researchers-develop-model-to-find-exomoons-around-distant-stars-8105778/","urlToImage":"https://images.indianexpress.com/2022/08/galaxy.jpg","publishedAt":"2022-08-22T19:14:48Z","content":"SOON, ASTRONOMERS peering into the deep skies could get a tad luckier in identifying the yet undiscovered exomoons – a moon which revolves around distant stars. Two researchers from the Indian Instit… [+1697 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Russian spacewalk cut short by bad battery - AP Archive","description":"(17 Aug 2022) RESTRICTION SUMMARY: MUST CREDIT NASANASA - MUST CREDIT NASASpace - 17 August 20221. Cosmonauts outside of International Space Station2. Helmet...","url":"https://www.youtube.com/watch?v=EdRN7xLnafw","urlToImage":"https://i.ytimg.com/vi/EdRN7xLnafw/hqdefault.jpg","publishedAt":"2022-08-22T19:05:05Z","content":null},{"source":{"id":null,"name":"Space.com"},"author":"Robert Lea","title":"Galaxy's violent destruction was a 'black hole delivery service' - Space.com","description":"A small galaxy swallowed by a larger spiral galaxy deposited a supermassive black hole as it was violently ripped apart and consumed.","url":"https://www.space.com/black-hole-delivery-service-nikhull","urlToImage":"https://cdn.mos.cms.futurecdn.net/R8sswrR4xHkUfud3JCbKWj-1200-80.jpg","publishedAt":"2022-08-22T18:29:28Z","content":"The absorption of a small galaxy into a larger spiral galaxy seems to have acted as a 'black hole delivery system' leaving a distant galaxy with two supermassive black holes that will eventually coll… [+3182 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Andrew Jones","title":"NASA's new 3D sky-mapping space telescope gets a custom test chamber - Space.com","description":"The customized chamber will prepare the SPHEREx space telewscope's sensitive infrared optics for deep views of universe.","url":"https://www.space.com/nasa-spherex-telescope-test-chamber","urlToImage":"https://cdn.mos.cms.futurecdn.net/bVwU5zECzKenzuNhCFwZsE-1200-80.jpg","publishedAt":"2022-08-22T18:00:38Z","content":"A custom-built test chamber for a new NASA space telescope has arrived at Caltech in Pasadena to help ready the spacecraft for launch in 2025.\r\nThe Spectro-Photometer for the History of the Universe,… [+2237 chars]"},{"source":{"id":null,"name":"Scroll.in"},"author":"Alice Gorman, The Conversation","title":"Voyager 2 left Earth 45 years ago, but its 5-billion-year legacy is just beginning - Scroll.in","description":"In the void of interstellar space, the most distant emissary of humankind carries a message that will last for billions of years.","url":"https://scroll.in/article/1030945/voyager-2-left-earth-45-years-ago-but-its-5-billion-year-legacy-is-just-beginning","urlToImage":"https://s01.sgp1.cdn.digitaloceanspaces.com/book/178754-qenkysbqjl-1661056807.jpg","publishedAt":"2022-08-22T18:00:00Z","content":"On August 20, 1977, an extraordinary spacecraft left this planet on a journey like no other. Voyager 2 was going to show us, for the first time, what the outer solar system planets looked like close-… [+5229 chars]"},{"source":{"id":null,"name":"ZME Science"},"author":"Alexandru Micu","title":"This humble forage crop could help to make Mars green - ZME Science","description":"This widespread but largely unknown forage crop could help bring agriculture to Mars.","url":"https://www.zmescience.com/science/mars-crop-for-agriculture-2352362362/","urlToImage":"https://cdn.zmescience.com/wp-content/uploads/2022/08/Alfalfa.jpg","publishedAt":"2022-08-22T17:43:52Z","content":"Space, the final frontier. But as any good frontiersman knows, you can’t explore on an empty stomach. Eventually, then, we will have to grow food in space for astronauts to dine on — but what should … [+5668 chars]"},{"source":{"id":null,"name":"DNA India"},"author":"DNA Web Team","title":"James Webb Space Telescope captures Jupiter’s auroras, tiny moons like never before, pic surfaces - DNA India","description":"Jupiter's Great Red Spot, a storm big enough to swallow Earth, stands out brightly along countless smaller storms in James Webb Space Telescope pic.","url":"https://www.dnaindia.com/technology/report-james-webb-space-telescope-captures-jupiters-auroras-tiny-moons-like-never-before-pic-surfaces-2978663","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/22/2532246-dna-83.png","publishedAt":"2022-08-22T17:42:00Z","content":"The world's newest and biggest space telescope is showing Jupiter as never before, auroras and all.\r\nScientists released the shots Monday of the solar system's biggest planet.\r\nThe James Webb Space T… [+1361 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":"Lisa Jennings","title":"Space flight: the race to the moon resumes - BollyInside","description":"The Danuri robotic probe is currently heading towards the Sun to take advantage of the star’s massive gravity and propel itself towards its final","url":"https://www.bollyinside.com/news/space-flight-the-race-to-the-moon-resumes","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/Space-flight-the-race-to-the-moon-resumes.jpeg","publishedAt":"2022-08-22T17:08:29Z","content":"The Danuri robotic probe is currently heading towards the Sun to take advantage of the stars massive gravity and propel itself towards its final destination: the Moon. This is the first Korean missio… [+8119 chars]"},{"source":{"id":null,"name":"PetaPixel"},"author":"Jaron Schneider","title":"Planetary 'Photobombers' Complicate the Search for Another Earth - PetaPixel","description":"Photobombing is relevant to astronomy, too.","url":"https://petapixel.com/2022/08/22/planetary-photobombers-complicate-the-search-for-another-earth/","urlToImage":"https://petapixel.com/assets/uploads/2022/08/Astronomers-Are-Studying-How-to-Remove-Planetary-Photobombers.jpg","publishedAt":"2022-08-22T17:01:05Z","content":"Scientists say that their attempts to find exoplanets that could host life — basically, another Earth — could be obscured by what they refer to as planetary “photobombers,” which could dramatically a… [+3836 chars]"},{"source":{"id":null,"name":"Universe Today"},"author":"Brian Koberlein","title":"Gravitational Waves Will Give Astronomers a new way to Look Inside Neutron Stars - Universe Today","description":"Astronomers can use gravitational wave data to study the interiors of neutron stars, thanks to new gravitational wave models.","url":"https://www.universetoday.com/157257/gravitational-waves-will-give-astronomers-a-new-way-to-look-inside-neutron-stars/","urlToImage":"https://www.universetoday.com/wp-content/uploads/2022/08/merger-scaled.jpg","publishedAt":"2022-08-22T16:46:10Z","content":"It’s difficult to study neutron stars. They are light years away and only about 20 kilometers across. They are also made of the most dense material in the universe. So dense that atomic nuclei merge … [+3681 chars]"},{"source":{"id":null,"name":"Futurity: Research News"},"author":"Louise Lerner-Chicago","title":"Black hole collisions may clarify how fast the universe is expanding - Futurity: Research News","description":"A new technique may provide a unique window into the \"teenage\" years of the universe that are hard to study with other methods.","url":"https://www.futurity.org/black-holes-universe-expanding-2787072-2/","urlToImage":"https://www.futurity.org/wp/wp-content/uploads/2022/08/black-hole-collisions-universe-expanding-1600.jpg","publishedAt":"2022-08-22T16:21:05Z","content":"A black hole is usually where information goes to disappearbut scientists may have found a trick to use its last moments to tell us about the history of the universe.\r\nIn a new study, two astrophysic… [+5135 chars]"},{"source":{"id":null,"name":"CNBCTV18"},"author":"CNBCTV18.com","title":"Global warming sparked off rise of the reptiles: New study - CNBCTV18","description":"Scientists so far believed that the reptile population explosion was due to the extinction of their competitors. However, this new study led by Harvard University indicates that extreme climate change, rather than mass extinction, was behind the boom millions…","url":"https://www.cnbctv18.com/environment/global-warming-sparked-off-rise-of-the-reptiles-new-study-14559722.htm","urlToImage":"https://images.cnbctv18.com/wp-content/uploads/2019/04/Crocodile.jpg","publishedAt":"2022-08-22T15:43:00Z","content":"Scientists so far believed that the reptile population explosion was due to the extinction of their competitors. However, this new study led by Harvard University indicates that extreme climate chang… [+2877 chars]"},{"source":{"id":null,"name":"India.com"},"author":"Zee Media Bureau","title":"Sound of black hole! NASA releases fresh audio from outer space, listen here - Zee News","description":"Quashing the popular belief that there is no sound presence in the other space, the American space research agency NASA on Monday released an audio clip of the sound waves of a black hole. Taking to Twitter, NASA Exoplanets shared the audio clip.","url":"https://zeenews.india.com/world/sound-of-black-hole-nasa-releases-fresh-audio-from-outer-space-listen-here-2500357.html","urlToImage":"https://english.cdn.zeenews.com/sites/default/files/2022/08/22/1080818-black-hole-sound.png","publishedAt":"2022-08-22T15:42:26Z","content":"New Delhi: Quashing the popular belief that there is no sound presence in the other space, the American space research agency NASA on Monday released an audio clip of the sound waves of a black hole.… [+1659 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Matt Williams","title":"Were Phobos and Deimos once a single Martian moon that split up? Not likely, says new study - Phys.org","description":"The origin of Phobos and Deimos, the two Martian moons, has been a mystery to astronomers. These two bodies are a fraction of the size and mass of the Moon, measuring just 22.7 km (14 mi) and 12.6 km (7.83 mi) in diameter. Both have a rapid orbital period, ta…","url":"https://phys.org/news/2022-08-phobos-deimos-martian-moon.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/were-phobos-and-deimos.jpg","publishedAt":"2022-08-22T15:31:30Z","content":"The origin of Phobos and Deimos, the two Martian moons, has been a mystery to astronomers. These two bodies are a fraction of the size and mass of the Moon, measuring just 22.7 km (14 mi) and 12.6 km… [+8077 chars]"}]}