{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"Ommcomnews.com"},"author":"OMMCOM NEWS","title":"SpaceX Launches 3 Rockets In 36 Hours | Science & Tech - Ommcom News","description":"San Francisco: SpaceX has launched and landed three rockets in a span of 36 hours, media reports said.A two-stage Falcon 9 rocket was launched from Florida's Cape Canaveral Space Force Station on Sunday (June 19) at 12:27 a.m. EDT, carrying a communi","url":"https://ommcomnews.com/science-tech/spacex-launches-3-rockets-in-36-hours","urlToImage":"https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/06/19200812/fa27bdd05e5d8ce41a311c79ad3f8425.jpg","publishedAt":"2022-06-19T14:38:33Z","content":"San Francisco: SpaceX has launched and landed three rockets in a span of 36 hours, media reports said.\r\nA two-stage Falcon 9 rocket was launched from Florida’s Cape Canaveral Space Force Station on S… [+1044 chars]"},{"source":{"id":null,"name":"Devdiscourse"},"author":"ANI","title":"Cerebellum contributes to higher cognitive functions: Study - Devdiscourse","description":"A research study explains how dopamine in the cerebellum modulates social behaviours via its action on D2 receptors (D2R). The cerebellum is essential for but also contributes to higher cognitive functions including social behaviours.","url":"https://www.devdiscourse.com/article/health/2078725-cerebellum-contributes-to-higher-cognitive-functions-study","urlToImage":"https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_06_2022_13_25_34_7410766.jpg?width=920&format=jpeg","publishedAt":"2022-06-19T13:25:36Z","content":"A research study explains how dopamine in the cerebellum modulates social behaviours via its action on D2 receptors (D2R). The cerebellum is essential for but also contributes to higher cognitive fun… [+2844 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Jeff Spry","title":"Hubble Space Telescope starstruck by a globular cluster - Space.com","description":"This mesmerizing new composite image might help astronomers solve a cosmic puzzle","url":"https://www.space.com/hubble-space-telescope-starstruck-cluster-photo","urlToImage":"https://cdn.mos.cms.futurecdn.net/xSd5fHqxUqBaHqRWtsPri9-1200-80.jpg","publishedAt":"2022-06-19T13:01:40Z","content":"A celestial workhorse and its dedicated team of astronomers are at it again by delivering a hypnotic new image of a globular cluster and its infinite depth of stars.\r\nBut while a new image from the H… [+2317 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"NASA to shut Voyager probes' instruments gradually as they continue drifting in space - Republic World","description":"NASA physicist Ralph McNutt recently revealed that scientists will continue powering down the Voyager probes as their power source will soon run out completely.","url":"https://www.republicworld.com/science/space/nasa-to-shut-voyager-probes-instruments-gradually-as-they-continue-drifting-in-space-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/lvxgthwsou849jcn_1655641328.jpeg","publishedAt":"2022-06-19T12:57:00Z","content":"Made to last just five years, the two Voyager spacecraft are still pushing through the vacuum of space, representing humanity beyond the influence of the Sun. Both Voyager 1 and Voyager 2 were launch… [+2446 chars]"},{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"University of Vienna: Parasitic worms reveal new insights into the evolution of sex and sex chromosomes - India Education Diary","description":"Two unrelated worm phyla give clues on how sex chromosomes might have evolvedStudying two highly divergent phyla of worms that contain numerous parasites that cause human and livestock diseases, the research group of Qi Zhou from the University of Vi","url":"https://indiaeducationdiary.in/university-of-vienna-parasitic-worms-reveal-new-insights-into-the-evolution-of-sex-and-sex-chromosomes/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2021/03/vienna-vv.jpg","publishedAt":"2022-06-19T12:53:28Z","content":"Two unrelated worm phyla give clues on how sex chromosomes might have evolved\r\nStudying two highly divergent phyla of worms that contain numerous parasites that cause human and livestock diseases, th… [+3373 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"Most detailed maps of asteroid Psyche reveal an ancient world of rock and metal - The Indian Express","description":"Researchers have published the most detailed maps of the asteroid Psyche to date.","url":"https://indianexpress.com/article/technology/science/asteroid-psyche-most-detailed-map-rock-metal-7978781/","urlToImage":"https://images.indianexpress.com/2022/06/Psyche-asteroid-detailed-maps.jpg","publishedAt":"2022-06-19T12:48:31Z","content":"NASA is set to launch a probe the size of a tennis court to the asteroid belt between the orbits of Mars and Jupiter this year; where the remnants of the early solar system circle the sun. After the … [+3202 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"Best Places to Sky Watch around the world - BollyInside","description":"This list is about the Best Places to Sky Watch around the world. We will try our best so that you understand this list Best Places to Sky Watch around","url":"https://www.bollyinside.com/articles/best-places-to-sky-watch-around-the-world/","urlToImage":"https://www.bollyinside.com/articles/wp-content/uploads/sites/4/2022/06/Best-Places-to-Sky-Watch-around-the-world.jpg","publishedAt":"2022-06-19T12:17:47Z","content":"This list is about the Best Places to Sky Watch around the world. We will try our best so that you understand this list Best Places to Sky Watch around the world. I hope you like this list Best Place… [+9404 chars]"},{"source":{"id":null,"name":"TweakTown"},"author":"Adam Hunt","title":"Atom laser that can run forever built by physicists after breakthrough - TweakTown","description":"University of Amsterdam physicists have made a sustainable Bose-Einstein Condensate, and thus an atom laser that can run forever.","url":"https://www.tweaktown.com/news/86944/atom-laser-that-can-run-forever-built-by-physicists-after-breakthrough/index.html","urlToImage":"https://static.tweaktown.com/news/8/6/86944_01_physicists-say-theyve-built-an-atom-laser-that-can-run-forever_full.jpg","publishedAt":"2022-06-19T12:14:55Z","content":"A study on the atom laser titled \"Continuous Bose-Einstein condensation\" has been published in the journal Nature.\r\nConventional lasers produce a coherent wave of light, meaning all of the light vibr… [+1326 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"NASA satellite spots peculiar cloud over the Caspian Sea - The Indian Express","description":"Unlike the diffused and dispersed cloud cover that is typically observed, this cloud spotted over the Caspian Sea had well-defined edged, like something out a of a cartoon.","url":"https://indianexpress.com/article/technology/science/nasa-satellite-spots-peculiar-cloud-over-the-caspian-sea/","urlToImage":"https://images.indianexpress.com/2022/06/Peculiar-shape-cloud-caspian-sea.jpg","publishedAt":"2022-06-19T10:35:40Z","content":"It is not unusual to spot clouds hovering over at least part of the largest inland body of water on the planet, the Caspian Sea. but on May 28, NASA’s Moderate Resolution Imaging Spectroradiometer (M… [+1809 chars]"},{"source":{"id":null,"name":"Thetimeshub.in"},"author":"Kumar Natasha","title":"An Earth-like planet found near a star adjacent to the Sun - The Times Hub","description":"Photo : pixabay.comAn Earth-like planet found near a star adjacent to the Sun Exoplanet Ross 508 b has a minimum mass of four Earth masses","url":"https://thetimeshub.in/an-earth-like-planet-found-near-a-star-adjacent-to-the-sun/1182/","urlToImage":null,"publishedAt":"2022-06-19T10:17:31Z","content":"Photo : pixabay.comAn Earth-like planet found near a star adjacent to the Sun\r\nExoplanet Ross 508 b has a minimum mass of four Earth masses and revolves around its host every 10.75 days at a distance… [+1836 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"The James Webb Space Telescope has survived the impact of a micrometeorite - BollyInside","description":"Despite being hit by grain-sized debris flying across its path, scientists say the James Webb Space Telescope is still on track to send its first infrared","url":"https://www.bollyinside.com/news/the-james-webb-space-telescope-has-survived-the-impact-of-a-micrometeorite","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/The-James-Webb-Space-Telescope-has-survived-the-impact-of.jpeg","publishedAt":"2022-06-19T09:44:19Z","content":"Despite being hit by grain-sized debris flying across its path, scientists say the James Webb Space Telescope is still on track to send its first infrared images.\r\nMicrometeoroids struck the Universi… [+826 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"Kennedy Space Center marks 60 years and draws lessons from six decades of experience - BollyInside","description":"It was 1962 when NASA began construction on Merritt Island, a swamp in Central Florida, of a gigantic site from which Americans would soar into the sky","url":"https://www.bollyinside.com/news/kennedy-space-center-marks-60-years-and-draws-lessons-from-six-decades-of-experience","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/Kennedy-Space-Center-marks-60-years-and-draws-lessons-from.jpeg","publishedAt":"2022-06-19T09:20:37Z","content":"It was 1962 when NASA began construction on Merritt Island, a swamp in Central Florida, of a gigantic site from which Americans would soar into the sky and walk on the moon.\r\nBob Sieck, former Space … [+2536 chars]"},{"source":{"id":null,"name":"physicsworld.com"},"author":null,"title":"Telescopes, accelerators and LIGO team up to probe neutron stars – Physics World - physicsworld.com","description":"Multimessenger astronomy observations combine with heavy-ion collision experiments to constrain the equation of state for super-dense stellar remnants","url":"https://physicsworld.com/a/telescopes-accelerators-and-ligo-team-up-to-probe-neutron-stars/","urlToImage":"https://physicsworld.com/wp-content/uploads/2022/06/artist_NSIllustration_CREDIT__NSF_LIGO_Sonoma_State_University_A._Simonnet_resized.jpg","publishedAt":"2022-06-19T09:20:30Z","content":"Cataclysm: Artists illustration of two merging neutron stars. (Courtesy: NSF/LIGO/Sonoma State University/A. Simonnet)\r\nPhysicists have created a framework for better understanding the super-dense ma… [+5127 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"Space news this week: 'Signs of aliens', cosmic cannibalism and the fastest-growing black hole - The Indian Express","description":"From a 'cosmic cannibal' ripping up an entire planetary system to reports of signs of extra-terrestrial life, here is some of the most exciting space news from last week.","url":"https://indianexpress.com/article/technology/science/space-news-this-week-aliens-cosmic-cannibalism-black-hole-797826/","urlToImage":"https://images.indianexpress.com/2022/06/Space-news-this-week-220619.jpg","publishedAt":"2022-06-19T07:45:41Z","content":"China said it may have detected signs of alien civilisations\r\nChina said that its massive Giant Eye telescope may have picked up signs of alien civilisations, according to a report by the state-backe… [+3936 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"China finds signs of water in moon's 'Ocean of Storms' - India Today","description":"The scientists said they found evidence of water in the form of hydroxyl encased in a crystalline mineral known as apatite.","url":"https://www.indiatoday.in/science/story/china-finds-signs-of-water-in-moon-s-ocean-of-storms-1964187-2022-06-19","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/china_rocket_reuters-647x363.jpeg?CJ1enWjCCee.pRhXR1DK8Xg8v.sxKZbJ","publishedAt":"2022-06-19T06:52:20Z","content":"Chinese scientists have found signs of water in samples retrieved by China from a lava plain on the moon, bringing them closer to understanding its origin there - a crucial question for future lunar … [+1691 chars]"},{"source":{"id":null,"name":"Jagran.com"},"author":"Simran Srivastav","title":"Australian Scientists Spot Fastest-Growing Black Hole That Can Consume One Earth Per Second - Jagran English","description":"","url":"https://english.jagran.com/trending/australian-scientists-spot-fastestgrowing-black-hole-that-can-consume-one-earth-per-second-10044902","urlToImage":"https://imgeng.jagran.com/images/2022/jun/BlackHole1655621314583.jpg","publishedAt":"2022-06-19T06:46:00Z","content":"New Delhi | Jagran Trending Desk: Astronomers from an Australian University have recently discovered a black hole, that can swallow one Earth each second. This black hole is also the fastest-growing … [+1782 chars]"},{"source":{"id":null,"name":"Wonderfulengineering.com"},"author":null,"title":"Scientists Have Disovered Viruses That ‘Secretly Rule The World’s Oceans’ - Wonderful Engineering","description":"Advertisement The recent study published in the journal Science on Thursday focuses on viruses that include RNA, a molecular cousin of DNA. In human illness, RNA viruses abound; coronaviruses and influenza viruses, for example, are both RNA-based. Scientists …","url":"https://wonderfulengineering.com/scientists-have-disovered-viruses-that-secretly-rule-the-worlds-oceans/","urlToImage":"https://wonderfulengineering.com/wp-content/uploads/2022/06/imgonline-com-ua-resize-puveuXx5RlV.jpg","publishedAt":"2022-06-19T05:45:06Z","content":"The recent study published in the journal Science on Thursday focuses on viruses that include RNA, a molecular cousin of DNA. In human illness, RNA viruses abound; coronaviruses and influenza viruses… [+3211 chars]"},{"source":{"id":null,"name":"Wonderfulengineering.com"},"author":null,"title":"Scientists Have Analyzed A Report About Signs Of Life On Venus – This Is What They Found - Wonderful Engineering","description":"Advertisement A team of researchers from the University of Cambridge has gone through an in-depth analysis to explore the possibility of life on the clouds of Venus, but the results reveal that there were no signs related to any kind of species encapsulating …","url":"https://wonderfulengineering.com/scientists-have-analyzed-a-report-about-signs-of-life-on-venus-this-is-what-they-found/","urlToImage":"https://wonderfulengineering.com/wp-content/uploads/2022/06/L6GRGgkt4PhNJhB6uTdgmS.jpg","publishedAt":"2022-06-19T05:38:34Z","content":"A team of researchers from the University of Cambridge has gone through an in-depth analysis to explore the possibility of life on the clouds of Venus, but the results reveal that there were no signs… [+2783 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Tech Desk","title":"NASA Artemis I Moon mission wet dress rehearsal underway: watch it live - The Indian Express","description":"After three abortive attempts, the SLS rocket and Orion Spacecraft have begun a wet dress rehearsal ahead of NASA's Artemis I Moon mission.","url":"https://indianexpress.com/article/technology/science/nasa-artemis-i-moon-mission-wet-dress-rehearsal-live-7978092/","urlToImage":"https://images.indianexpress.com/2022/04/NASA-SLS-rocket-roll-back-wet-dress-rehearsal.jpg","publishedAt":"2022-06-19T05:14:37Z","content":"At around 2.30 AM today (IST), the launch team checked into their stations at the Launch Control Center at NASAs Kennedy Space Center in Florida to begin the wet dress rehearsal test for NASAs Artemi… [+2234 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"A MAJOR solar flare can have a huge impact on Earth- power, phones to internet! - HT Tech","description":"A solar flare is a massive outburst of energy from the Sun. What if we are directly hit by a major one? This is how solar flares can impact us.","url":"https://tech.hindustantimes.com/tech/news/a-major-solar-flare-can-have-a-huge-impact-on-earth-power-phones-to-internet-71655609947833.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/19/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1655610096651.jpg","publishedAt":"2022-06-19T03:42:43Z","content":"The Sun is essential for the survival of plants as well as humans on Earth, but this giant energy source can also disrupt all kinds of technology on Earth including the largest communication system t… [+2329 chars]"}]}