{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"EastMojo"},"author":"360info.org","title":"How to plan Earth’s defence against cosmic objects - EastMojo","description":"A large asteroid or comet on track for Earth would be a global threat. It would require national and international efforts to stop it. When a 2-metre-wide","url":"http://www.eastmojo.com/space/2022/07/04/how-to-plan-earths-defence-against-cosmic-objects/","urlToImage":"https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/07/baseimage-72.jpg?fit=1400%2C875&ssl=1","publishedAt":"2022-07-04T03:50:00Z","content":"A large asteroid or comet on track for Earth would be a global threat. It would require national and international efforts to stop it.\r\nWhen a 2-metre-wide asteroid hit Earths atmosphere in March, it… [+9272 chars]"},{"source":{"id":null,"name":"Tech Times"},"author":"April Fowell","title":"The Largest Alcohol Molecule in Space Near the Center of the Milky Way Has Been Identified, May Lead to a New Star Formation - Tech Times","description":"Researchers are getting closer to identifying how stars and comets are formed in the galaxy.","url":"https://www.techtimes.com/articles/277553/20220703/the-largest-alcohol-molecule-in-space-near-the-center-of-the-milky-way-has-been-identified-may-lead-to-a-new-star-formation.htm","urlToImage":"https://1734811051.rsc.cdn77.org/data/images/full/407581/chile-astronomy-alma.jpg","publishedAt":"2022-07-04T03:40:00Z","content":"Researchers may have discovered the largest alcohol in space in the form of propanol. For the first time, normal-propanol has been detected in a star-forming region, along with isopropanol that has n… [+2850 chars]"},{"source":{"id":null,"name":"Abplive.com"},"author":"Radifah Kabir","title":"Ten Years Of God Particle Discovery: All About The Higgs Boson, Its Link To SN Bose | EXPLAINED - ABP Live","description":"God particle: The Higgs boson provides evidence for the Standard Model of Physics, which describes how various particles make the universe. Without the Higgs boson, the Standard Model would fail.","url":"https://news.abplive.com/science/god-particle-discovery-10-years-anniversary-all-about-the-higgs-boson-its-link-to-sn-bose-explained-1540627","urlToImage":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/07/04/cf54b286120045f3937db1be42c4348c_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628","publishedAt":"2022-07-04T03:09:12Z","content":"July 4 is the 10th anniversary of the discovery of the Higgs boson, also known as God’s particle. After a search of more than 40 years, the particle was discovered in experiments on the Large Hadron … [+3978 chars]"},{"source":{"id":null,"name":"India.com"},"author":"IANS","title":"Astronauts May Lose Bone Density After Returning To Earth: Study - India.com","description":"A new study revealed how long duration space missions might affect the lose of bone density in astronauts after returning to earth.","url":"https://www.india.com/science/astronauts-may-lose-bone-density-after-returning-to-earth-study-5491312/","urlToImage":"https://static.india.com/wp-content/uploads/2022/07/astronauts-f.jpg","publishedAt":"2022-07-04T02:33:46Z","content":"Toronto: Aging entails natural health issues, but a recent study finds that astronauts on long-duration flights tend to have a permanent loss of bone density. The findings, published in Scientific Re… [+2427 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Nature used 57 recipes to create Earth's 10500-plus 'mineral kinds' - ANI News","description":"Washington [US], July 4 (ANI): A 15-year study details the origins and diversity of every known mineral on Earth, a landmark body of work that will help reconstruct the history of life on Earth, guide the search for new minerals and ore deposits, predict poss…","url":"https://www.aninews.in/news/science/nature-used-57-recipes-to-create-earths-10500-plus-mineral-kinds20220704065458","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/Undsfdastitled-120220704012433.jpg","publishedAt":"2022-07-04T01:24:00Z","content":"Washington [US], July 4 (ANI): A 15-year study details the origins and diversity of every known mineral on Earth, a landmark body of work that will help reconstruct the history of life on Earth, guid… [+5298 chars]"},{"source":{"id":null,"name":"The New Daily"},"author":null,"title":"NASA’s second Arnhem Land rocket launch postponed - The New Daily","description":"NASA's second rocket launch from the Arnhem Space Centre has been delayed due to poor weather conditions, the centre's owner and operator has announced.","url":"https://thenewdaily.com.au/life/tech/2022/07/04/nasa-arnhem-land-rocket-launch-delay/","urlToImage":"https://thenewdaily.com.au/wp-content/uploads/2022/06/1656292441-Image-1-Rocket-Launch-Supplied-by-NASA.jpg?resize=960,600","publishedAt":"2022-07-04T01:01:43Z","content":"NASA’s second rocket launch from the Arnhem Space Centre has been delayed due to bad weather.\r\nThe launch was scheduled for Monday night but had been postponed for 24 hours, the space centre’s owner … [+1159 chars]"},{"source":{"id":null,"name":"Eurasia Review"},"author":"Eurasia Review","title":"Galaxy Revving-Up In The Early Universe - Eurasia Review","description":"Astronomers have observed signs of rotation in a galaxy which existed a mere 500 million years after the Big Bang. This is by far the earliest galaxy with possible rotation. But the speed of the ro…","url":"https://www.eurasiareview.com/04072022-galaxy-revving-up-in-the-early-universe/","urlToImage":"https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2022/07/b-25.png?fit=800%2C450&ssl=1","publishedAt":"2022-07-04T00:33:29Z","content":"Astronomers have observed signs of rotation in a galaxy which existed a mere 500 million years after the Big Bang. This is by far the earliest galaxy with possible rotation. But the speed of the rota… [+1741 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Study: Dinosaurs takes over amid ice not warmth - ANI News","description":"Washington [US], July 4 (ANI): A new study of ancient mass extinction suggests that ancient high latitudes, to which early dinosaurs were largely relegated, regularly froze over, and that the creatures adapted an apparent key to their later dominance.","url":"https://www.aninews.in/news/science/study-dinosaurs-takes-over-amid-ice-not-warmth20220704053715","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/dinosaur20220122052122_-_Copy2022012205414920220703234857.jpg","publishedAt":"2022-07-04T00:10:45Z","content":"Washington [US], July 4 (ANI): A new study of ancient mass extinction suggests that ancient high latitudes, to which early dinosaurs were largely relegated, regularly froze over, and that the creatur… [+7772 chars]"},{"source":{"id":null,"name":"Forbes"},"author":"Jamie Carter","title":"Earth Furthest From The Sun As Moon Glides Across The Scorpion: What To See In The Night Sky This Week - Forbes","description":"It’s a good week to let the Moon guide you to two of the most important stars in the northern hemisphere’s night sky—Spica in Virgo and the red supergiant star Antares in Scorpius.","url":"https://www.forbes.com/sites/jamiecartereurope/2022/07/03/earth-furthest-from-the-sun-as-moon-glides-across-the-scorpion-what-to-see-in-the-night-sky-this-week/","urlToImage":"https://imageio.forbes.com/specials-images/imageserve//1134061963/0x0.jpg?format=jpg&crop=5400,2531,x0,y531,safe&width=1200","publishedAt":"2022-07-04T00:00:00Z","content":"The 7-day old First Quarter Moon on May 21, 2018 A single shot with the Sony a7III camera on the ... [+] 130mm Astro-Physics apo refractor with a 2X Barlow for an effective focal length of 1600mm at … [+3012 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Anderson Cooper","title":"NASA begins search for ancient life on Mars after arrival of Perseverance, Ingenuity spacecrafts - 60 Minutes - CBS News","description":"Anderson Cooper reports on the nerve-wracking Mars landing of the rover Perseverance, the painstaking process of launching the tiny helicopter Ingenuity, and the extraordinary images the two have already sent back to Earth.","url":"https://www.cbsnews.com/news/mars-life-ingenuity-helicopter-perseverance-rover-60-minutes-2022-07-03/","urlToImage":"https://assets3.cbsnewsstatic.com/hub/i/r/2021/05/09/4c529582-7e4c-4817-91a6-f60cd9697b1f/thumbnail/1200x630/4330c4e89659bf5615f1ec37ca2e57af/perseverancearticle.jpg","publishedAt":"2022-07-03T22:56:48Z","content":"It's been nearly two years since the tiny helicopter Ingenuity and the one-ton rover Perseverance left planet Earth and they've come a very long way since then. In February, last year, they landed in… [+14186 chars]"},{"source":{"id":null,"name":"Maui Now"},"author":null,"title":"UH-developed tool can detect ancient life on Earth and beyond - Maui Now","description":"An innovative scientific instrument developed by University of Hawaiʻi at Mānoa researchers is expected to be a game changer in the search for life — existing or extinct — on Earth and other planets.","url":"https://mauinow.com/2022/07/03/uh-developed-tool-can-detect-ancient-life-on-earth-and-beyond/","urlToImage":"https://media.mauinow.com/file/mauinow/2022/07/unnamed.jpg","publishedAt":"2022-07-03T21:15:00Z","content":"White light (left) and Biofinder (middle) images of Green River formation fish fossil. Right: Biofinder looking at fossil sample. Photos credit: Anupam Misra\r\nAn innovative scientific instrument deve… [+3178 chars]"},{"source":{"id":null,"name":"Inverse"},"author":"Andy Tomaswick, Universe Today","title":"A monster sunspot just doubled in size — and it's pointing right at Earth - Inverse","description":"Active Region 3038 (AR3038), a sunspot that happens to be facing Earth, could produce some minor solar flares.","url":"https://www.inverse.com/science/giant-sunspot","urlToImage":"https://imgix.bustle.com/uploads/image/2022/7/1/a77c141d-fc1b-4955-b8e8-6579e7524977-april-30-x1-flare_131-171-304-1536x1536.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg","publishedAt":"2022-07-03T20:00:25Z","content":"Sunspots are typically\r\n no real reason to worry, even if they double in size overnight and grow to twice the size of the Earth itself. \r\nThats just what happened with Active Region 3038 (AR3038), a … [+3054 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Jacinta Bowler","title":"Nearly 1,000 Microbe Species Have Just Been Discovered in 'Extreme' Tibetan Glaciers - ScienceAlert","description":"Living as a microbe on the Tibetan Plateau isn't easy. Frigid temperatures, high levels of solar radiation, not a lot to eat, and you'd regularly get frozen and then thawed depending on the time of year.","url":"https://www.sciencealert.com/scientists-found-968-species-of-bacteria-in-the-extreme-environments-of-tibetan-glaciers","urlToImage":"https://www.sciencealert.com/images/2022-06/processed/SatelliteImageOfIcyTibetianPlateu_1024.jpg","publishedAt":"2022-07-03T18:02:25Z","content":"Living as a microbe on the Tibetan Plateau isn't easy. Frigid temperatures, high levels of solar radiation, not a lot to eat, and you'd regularly get frozen and then thawed depending on the time of y… [+2974 chars]"},{"source":{"id":null,"name":"Digital Trends"},"author":"Georgina Torbet","title":"Hubble captures a glittering cluster of thousands of stars - Digital Trends","description":"This week's image from the Hubble Space Telescope shows a stunning field of stars called a globular cluster.","url":"https://www.digitaltrends.com/space/hubble-globular-cluster-ngc-6569/","urlToImage":"https://www.digitaltrends.com/wp-content/uploads/2022/07/potw2226a1.jpg?p=1","publishedAt":"2022-07-03T17:53:34Z","content":"This week’s image from the Hubble Space Telescope shows a stunning field of stars called a globular cluster. Taken with Hubble’s Wide Field Camera 3 and Advanced Camera for Surveys instruments, the v… [+1931 chars]"},{"source":{"id":null,"name":"Digital Trends"},"author":"Georgina Torbet","title":"A Chinese orbiter has mapped the entire surface of Mars - Digital Trends","description":"The Chinese Tianwen-1 orbiter has completed imaging the entire surface of Mars, the China National Space Administration (CNSA) announced this week.","url":"https://www.digitaltrends.com/space/tianwen-1-orbiter-mapping/","urlToImage":"https://www.digitaltrends.com/wp-content/uploads/2022/07/qCVCmEP8cV2MncGhHqVPuP-970-80.jpg1_.webp?p=1","publishedAt":"2022-07-03T17:20:09Z","content":"The Chinese Tianwen-1 orbiter has completed imaging the entire surface of Mars, the China National Space Administration (CNSA) announced this week. The orbiter, which traveled to Mars along with the … [+2280 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"A `record-fast` nova was visible for a day and then vanished - WION","description":"A nova differes from a supernova. It is usually observed in binary star system","url":"https://www.wionews.com/science/a-record-fast-nova-was-visible-for-a-day-and-then-vanished-494189","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/03/276291-nova.jpg","publishedAt":"2022-07-03T16:22:41Z","content":"Supernova is an outright explosion of the star. The phenomenon is associated with death of a star. But a 'Nova' is a different type of explosion. It is a transient (short-lived) phenomenon in the uni… [+1918 chars]"},{"source":{"id":null,"name":"Vaughantoday.ca"},"author":"Jillian Castillo","title":"The world's largest telescope gets a little closer to the stars - Vaughan Today","description":"The Extremely Large Telescope (ELT), the most powerful optical instrument ever built that will greatly increase the observation power of astronomers, is slowly emerging from Earth in northern Chile, one…","url":"https://www.vaughantoday.ca/the-worlds-largest-telescope-gets-a-little-closer-to-the-stars/","urlToImage":null,"publishedAt":"2022-07-03T15:48:33Z","content":"The Extremely Large Telescope (ELT), the most powerful optical instrument ever built that will greatly increase the observation power of astronomers, is slowly emerging from Earth in northern Chile, … [+3713 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"NASA to dig deeper on Mars after research makes new revelations about life ingredients - Republic World","description":"NASA's new study suggests that its rovers will have to dig deeper on Mars as the cosmic rays break down amino acids much faster than previously thought.","url":"https://www.republicworld.com/science/space/nasa-to-dig-deeper-on-mars-after-research-makes-new-revelations-about-life-ingredients-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/tyqp1as4epl7tnsa_1656862129.jpeg","publishedAt":"2022-07-03T15:42:00Z","content":"NASA now knows where to look for life on Mars after a new study suggested digging deeper. Led by Alexander Pavlov of NASAs Goddard Space Flight Center, the study revealed that space radiations break … [+2341 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":null,"title":"Study: Dog ancestry traces back to two wolf populations - ThePrint","description":"Washington [US], July 3 (ANI): According to the publications in the ‘Nature’ journal, a recent study conducted by an international team of Francis Crick Institute’s archaeologists and geneticists has found that a dog’s ancestry can be traced back to at least …","url":"https://theprint.in/health/study-dog-ancestry-traces-back-to-two-wolf-populations/1023259/","urlToImage":null,"publishedAt":"2022-07-03T15:13:54Z","content":"Washington [US], July 3 (ANI): According to the publications in the ‘Nature’ journal, a recent study conducted by an international team of Francis Crick Institute’s archaeologists and geneticists has… [+4659 chars]"},{"source":{"id":null,"name":"Reportdoor.com"},"author":"Sharon Ross","title":"Solar storm could cause power grid and satellite problems - REPORT DOOR - Report Door","description":"A solar storm that zoomed past Earth recently might create problems for satellites and the country’s power grid, experts say. The nearby solar eruption","url":"https://www.reportdoor.com/solar-storm-could-cause-power-grid-and-satellite-problems/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2022/07/solar-storm-sun-getty-02.jpg?w=1024","publishedAt":"2022-07-03T14:43:11Z","content":"A solar storm that zoomed past Earth recently might create problems for satellites and the countrys power grid, experts say.\r\nThe nearby solar eruption snowplowed dense plasma towards the Earth trigg… [+2081 chars]"}]}