{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Nanowerk"},"author":null,"title":"Space study offers clearest understanding yet of the life cycle of supermassive black holes - Nanowerk","description":"Research uses X-ray telescopes and a new data analysis technique to describe space objects.","url":"https://www.nanowerk.com/news2/space/newsid=61139.php","urlToImage":"https://www.nanowerk.com/news2/space/id61139_1.jpg","publishedAt":"2022-07-26T15:38:31Z","content":"Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"},{"source":{"id":null,"name":"Azoquantum.com"},"author":null,"title":"High-Temperature Superconducting Magnet Could Improve the Performance of Spherical Tokamak Fusion Devices - AZoQuantum","description":"At the US Department of Energy’s (DOE) Princeton Plasma Physics Laboratory (PPPL), a new approach has been discovered by researchers to construct strong magnets that are smaller than before. This helps in the design and construction of machines.","url":"https://www.azoquantum.com/News.aspx?newsID=9117","urlToImage":"https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_9117_16588400632312260.jpg","publishedAt":"2022-07-26T15:23:00Z","content":"At the US Department of Energy’s (DOE) Princeton Plasma Physics Laboratory (PPPL), a new approach has been discovered by researchers that enables them to construct smaller, stronger magnets. This hel… [+4656 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"Video gamers have better decision-making skills, says study - WION","description":"Wanted more reasons to play video games? Take this one","url":"https://www.wionews.com/science/video-gamers-have-better-decision-making-skills-says-study-500884","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/22/150941-untitled-design-10.jpg","publishedAt":"2022-07-26T14:42:39Z","content":"Almost all of us have got scolded for playing too much video games. Doesn't matter if it an all-guns-blazing frenzy or careful, methodic manoeuvres in a strategy game, the interruptions from our folk… [+1734 chars]"},{"source":{"id":null,"name":"Abplive.com"},"author":"Radifah Kabir","title":"An Asteroid Collision With Earth 50,000 Years Ago Formed Diamonds With Unique Properties - ABP Live","description":"Scientists have found that diamonds formed during a high-energy shock wave resulting from an asteroid collision 50,000 years ago have unique and exceptional properties.","url":"https://news.abplive.com/science/an-asteroid-collision-with-earth-50000-years-ago-formed-diamonds-with-unique-properties-1544277","urlToImage":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/07/25/bb7047b566fcb49a45244847ff872e9f1658721501_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628","publishedAt":"2022-07-26T14:15:48Z","content":"Asteroids colliding with Earth result in shockwaves which create materials with a range of complex carbon structures. According to a study led by researchers at University College London and Hungaria… [+3840 chars]"},{"source":{"id":null,"name":"AZoM"},"author":null,"title":"Researchers Create Stretchable, Composite Layered 2D Materials - AZoM","description":"Nature produces layered materials, such as bone and mother-of-pearl that become less sensitive to flaws as they age.","url":"https://www.azom.com/news.aspx?newsID=59633","urlToImage":"https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_59633_16588436248035614.jpg","publishedAt":"2022-07-26T13:55:00Z","content":"Nature produces layered materials, such as bone and mother-of-pearl, that become less sensitive to flaws as they age. Scientists have created composite layered 2D materials that are resistant to crac… [+2850 chars]"},{"source":{"id":null,"name":"Hardwoodparoxysm.com"},"author":"Shannon Bailey","title":"No, Samantha Cristoforetti did not take a selfie from the most beautiful space in history - Hardwood Paroxysm","description":"We dreamed for 2 nanoseconds, just long enough to realize that no, this wasn't the selfie of the century. But Samantha, as we know, can do it all, and it","url":"https://hardwoodparoxysm.com/no-samantha-cristoforetti-did-not-take-a-selfie-from-the-most-beautiful-space-in-history/","urlToImage":"https://www.greenme.it/wp-content/uploads/2022/07/selfie_cristof.jpg","publishedAt":"2022-07-26T13:24:15Z","content":"We dreamed for 2 nanoseconds, just long enough to realize that no, this wasn’t the selfie of the century. But Samantha, as we know, can do it all, and it leaves her with the advantage of being the fi… [+1641 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Robert Sanders","title":"Heaviest neutron star to date is a 'black widow' eating its mate - Phys.org","description":"A dense, collapsed star spinning 707 times per second—making it one of the fastest spinning neutron stars in the Milky Way galaxy—has shredded and consumed nearly the entire mass of its stellar companion and, in the process, grown into the heaviest neutron st…","url":"https://phys.org/news/2022-07-heaviest-neutron-star-date-black.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/psr-j0952-0607-the-fas.jpg","publishedAt":"2022-07-26T13:21:26Z","content":"A dense, collapsed star spinning 707 times per secondmaking it one of the fastest spinning neutron stars in the Milky Way galaxyhas shredded and consumed nearly the entire mass of its stellar compani… [+8772 chars]"},{"source":{"id":null,"name":"ThePrint"},"author":"ANI","title":"Study: Explosive volcanic eruption produced rare mineral on Mars - ThePrint","description":"Washington [US], July 26 (ANI): Planetary scientists have an answer to a mystery that’s puzzled the Mars research community since NASA’s Curiosity rover discovered a mineral called tridymite in Gale Crater. Tridymite is a high-temperature, low-pressure form o…","url":"https://theprint.in/science/study-explosive-volcanic-eruption-produced-rare-mineral-on-mars/1056221/","urlToImage":null,"publishedAt":"2022-07-26T13:20:37Z","content":"Washington [US], July 26 (ANI): Planetary scientists have an answer to a mystery that’s puzzled the Mars research community since NASA’s Curiosity rover discovered a mineral called tridymite in Gale … [+3566 chars]"},{"source":{"id":null,"name":"Futurity: Research News"},"author":"Talia Ogliore-WUSTL","title":"Traits for mating can align with traits for surviving heat - Futurity: Research News","description":"\"...reproduction can sometimes actually be the leading reason for many of the adaptations that animals have for dealing with their local climate.\"","url":"https://www.futurity.org/temperature-animal-mating-2772062-2/","urlToImage":"https://www.futurity.org/wp/wp-content/uploads/2022/07/temperature_mating_1600.jpg","publishedAt":"2022-07-26T12:45:34Z","content":"New research looks at the impact of rising temperatures on animal reproduction.\r\nBiologists have, for good reason, spent a huge amount of time trying to understand how animals can survive in the clim… [+5462 chars]"},{"source":{"id":null,"name":"Azoquantum.com"},"author":null,"title":"New Technologies Could Bring Quantum Clocks Closer to Real World Applications - AZoQuantum","description":"Quantum clocks are shrinking, thanks to new technologies developed at the University of Birmingham-led UK Quantum Technology Hub Sensors and Timing.","url":"https://www.azoquantum.com/News.aspx?newsID=9116","urlToImage":"https://dwg31ai31okv0.cloudfront.net/images/news/ThumbForNews_9116_16588391368541232.jpg","publishedAt":"2022-07-26T12:38:00Z","content":"Quantum clocks are shrinking, thanks to new technologies developed at the University of Birmingham-led UK Quantum Technology Hub Sensors and Timing.\r\nWorking in collaboration with and partly funded b… [+4921 chars]"},{"source":{"id":null,"name":"NewsBytes"},"author":"Athik Saleh","title":"Astronomers observe star formation in dwarf galaxies using Indian telescope - NewsBytes","description":"Have you ever wondered how stars are formed in distant dwarf galaxies? If you have, a group of astronomers from India, France, and the US led by Pune's IUCAA have something for you","url":"https://www.newsbytesapp.com/news/science/astronomers-spot-birth-of-stars-in-dwarf-galaxies/story","urlToImage":"https://i.cdn.newsbytesapp.com/images/l48220220726132301.jpeg","publishedAt":"2022-07-26T12:29:43Z","content":"Astronomers observe star formation in dwarf galaxies using Indian telescope\r\nJul 26, 2022, 05:59 pm3 min read\r\nHave you ever wondered how stars are formed in distant dwarf galaxies? If you have, a gr… [+2892 chars]"},{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"University of Pennsylvania: Inspired by nature, artificial microtubules can work against a current to transport tiny cargoes - India Education Diary","description":"Like a microscopic bucket brigrade, an artificial microtubule can rapidly transport tiny particles along magnetic stepping stones, delivering them to a precise location even when operating against a strong current.The technology, developed by a team","url":"https://indiaeducationdiary.in/university-of-pennsylvania-inspired-by-nature-artificial-microtubules-can-work-against-a-current-to-transport-tiny-cargoes/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png","publishedAt":"2022-07-26T12:23:03Z","content":"Like a microscopic bucket brigrade, an artificial microtubule can rapidly transport tiny particles along magnetic stepping stones, delivering them to a precise location even when operating against a … [+5175 chars]"},{"source":{"id":null,"name":"News9live.com"},"author":"News9 Staff","title":"Researchers use pneumatics to create necrobotic grippers from dead spiders - News9 LIVE","description":"Dead spiders are apparently naturally manufactured grippers for tiny objects","url":"https://www.news9live.com/science/researchers-use-pneumatics-to-create-necrobotic-grippers-from-dead-spiders-185184","urlToImage":"https://media.news9live.com/h-upload/2022/07/26/485006-necrobotic-spider.jpg","publishedAt":"2022-07-26T12:13:52Z","content":"Biomimicry is an approach by robotic scientists to create devices that leverage the wisdom of billions of years of evolution, such as robotic grippers that mimic the feet of geckos. Now researchers h… [+3895 chars]"},{"source":{"id":null,"name":"Global Times"},"author":null,"title":"Western media shows 'sour grapes' mentality to keep hyping Chinese rocket re-entry, despite flawless safety record - Global Times","description":"Right after China's successful launch of the Wentian lab module for the construction of the China Space Station, the Western media rapidly followed with a new round of smear campaign, hyping the","url":"https://www.globaltimes.cn/page/202207/1271442.shtml","urlToImage":"https://www.globaltimes.cn/Portals/0/attachment/2022/2022-07-24/2ec93256-9aa7-4adf-bee3-18cee5927cf4.jpeg","publishedAt":"2022-07-26T12:11:00Z","content":"China launches Wentian lab module for space station on July 24, 2022. Photo: Fan Wei/GT\r\nRight after China's successful launch of the Wentian lab module for the construction of the China Space Statio… [+4687 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"`Grand Canyon on Mars`: ESA clicks Martian feature that`s bigger than the original thing - WION","description":"We may have not found proof of life on Mars yet, but the red planet is full of interesting geological features","url":"https://www.wionews.com/science/grand-canyon-on-mars-esa-clicks-martian-feature-thats-bigger-than-the-original-thing-500812","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/26/282108-mars-2.jpg","publishedAt":"2022-07-26T11:58:19Z","content":"We Earth-dwellers have Earth-centric idea of the Universe and that's probably fine. From sunrise to sunset (and beyond), we eat, drink, work and sleep on one single planet. Human colonies on Moon and… [+1404 chars]"},{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"Goethe University: Electron highway for hydrogen and carbon dioxide storage discovered - India Education Diary","description":"Microbiologists at Goethe University Frankfurt, together with researchers from Marburg and Basel, have shed light on the structure of an enzyme that produces formic acid from molecular hydrogen (H2) and carbon dioxide (CO2). The enzyme of the bacteri","url":"https://indiaeducationdiary.in/goethe-university-electron-highway-for-hydrogen-and-carbon-dioxide-storage-discovered/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2022/07/goethe-uni-1024x427.jpg","publishedAt":"2022-07-26T11:55:05Z","content":"Microbiologists at Goethe University Frankfurt, together with researchers from Marburg and Basel, have shed light on the structure of an enzyme that produces formic acid from molecular hydrogen (H2) … [+5313 chars]"},{"source":{"id":null,"name":"Eletimes.com"},"author":"ELE Times","title":"Gauging battery performance with Computer Simulation - ELE Times - ELE Times","description":"A crucial but poorly-studied parameter that dictates battery performance is the migration barrier. It determines the rate at which ions move","url":"https://www.eletimes.com/gauging-battery-performance-with-computer-simulation","urlToImage":"https://www.eletimes.com/wp-content/uploads/2022/07/computer-simulations-a.jpg","publishedAt":"2022-07-26T11:48:24Z","content":"A crucial but poorly-studied parameter that dictates battery performance is the migration barrier. It determines the rate at which ions move through an electrode inside the battery, and ultimately th… [+3398 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Black Hole Police discovers the first dormant Stellar-Mass black hole outside Milky Way - HT Tech","description":"A team of astronomers known as the black hole police have discovered the first dormant stellar-mass black hole outside the Milky Way. The black hole was discovered in the Large Magellanic Cloud.","url":"https://tech.hindustantimes.com/tech/news/black-hole-police-discovers-the-first-dormant-stellar-mass-black-hole-outside-milky-way-71658834090136.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/07/26/1600x900/cd25eb509ace4fa4a3ad0acc07ea4270-cd25eb509ace4fa4a3ad0acc07ea4270-1_1628261176422_1658834126931_1658834126931.jpg","publishedAt":"2022-07-26T11:20:00Z","content":"For the first time ever, a dormant stellar-mass black hole has been discovered outside of the Milky Way galaxy. And who discovered it? The black hole police. Yes, a team of astronomers who are known … [+2446 chars]"},{"source":{"id":null,"name":"Orissapost.com"},"author":"Post News Network","title":"NASA to laser mark graffiti on Martian rocks - OrissaPOST","description":"Washington: NASA has laser-marked graffiti on Martian rocks to identify rock samples that will be brought to Earth for study. NASA’s Perseverance rover is currently collecting Martian samples from the 45-kilometre- wide Jezero crater for future return to Eart…","url":"https://www.orissapost.com/nasa-to-laser-mark-graffiti-on-martian-rocks/","urlToImage":"https://www.orissapost.com/wp-content/uploads/2022/07/UPLOAD-CAMERA.jpg","publishedAt":"2022-07-26T10:57:05Z","content":"Washington: NASA has laser-marked graffiti on Martian rocks to identify rock samples that will be brought to Earth for study.\r\nNASA’s Perseverance rover is currently collecting Martian samples from t… [+1615 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Hubble Telescope captures mirror image of gravitationally lensed galaxy; Here’s everything you need to know about it - The Financial Express","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvc2NpZW5jZS9odWJibGUtdGVsZXNjb3BlLWNhcHR1cmVzLW1pcnJvci1pbWFnZS1vZi1ncmF2aXRhdGlvbmFsbHktbGVuc2VkLWdhbGF4eS1oZXJlcy1ldmVyeXRoaW5nLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtaXQvMjYwNjc5Ny_SAQA?oc=5","urlToImage":null,"publishedAt":"2022-07-26T10:33:12Z","content":null}]}