{"status":"ok","totalResults":50,"articles":[{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"Technical University of Munich: Shining some light on the obscure proteome - India Education Diary","description":"Histone deacetylase (HDAC) inhibitors are a class of drugs used in oncology. An international research team involving scientists at the Technical University of Munich (TUM), Cornell University in Ithaca (USA), the German Cancer Research Center (DKFZ)","url":"https://indiaeducationdiary.in/technical-university-of-munich-shining-some-light-on-the-obscure-proteome/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2021/02/1200px-Logo_of_the_Technical_University_of_Munich.svg-1024x783.png","publishedAt":"2022-06-30T03:48:03Z","content":"Histone deacetylase (HDAC) inhibitors are a class of drugs used in oncology. An international research team involving scientists at the Technical University of Munich (TUM), Cornell University in Ith… [+2872 chars]"},{"source":{"id":null,"name":"News18"},"author":"Buzz Staff","title":"China's Mars Probe Has Sent Back Some Otherworldly Photos of the Red Planet - News18","description":"The Tianwen-1 consists of a lander, an obiter and a rover named Zhurong.","url":"https://www.news18.com/news/buzz/chinas-mars-probe-has-sent-back-some-otherworldly-photos-of-the-red-planet-5462293.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/china-mars-165655904716x9.png","publishedAt":"2022-06-30T03:17:54Z","content":"After reaching Mars in May last year, China first Mars mission, Tianwen-1, has completed its scientific explorations tasks on the Red Planet. It has now sent the latest pictures from Mars that have c… [+2342 chars]"},{"source":{"id":null,"name":"Asiafinancial.com"},"author":null,"title":"China Denies Rocket Caused Mystery Moon Crater – Forbes - Asia Financial","description":"Asia Financial News - Read the latest Asian stock market news and analysis, today China business news. AsiaFinancial.com brings you the Asian business, finance, economy and tech stories.","url":"https://www.asiafinancial.com/","urlToImage":"https://www.asiafinancial.com/wp-content/uploads/2021/05/AF-News-General-large.png","publishedAt":"2022-06-30T02:35:39Z","content":"Asia Financial is owned by Capital Link International Holdings Ltd,\r\n902, Wilson House 19-27 Wyndham Street, Central, Hong Kong. www.capitallinkintl.com"},{"source":{"id":null,"name":"India Education Diary"},"author":"India Education Diary Bureau Admin","title":"CAPSTONE Launches to Test New Orbit for NASA’s Artemis Moon Missions - India Education Diary","description":"California: NASA’s CubeSat designed to test a unique lunar orbit is safely in space and on the first leg of its journey to the Moon. The spacecraft is heading toward an orbit intended in the future for Gateway, a lunar space station built by the agen","url":"https://indiaeducationdiary.in/capstone-launches-to-test-new-orbit-for-nasas-artemis-moon-missions/","urlToImage":"https://indiaeducationdiary.in/wp-content/uploads/2022/06/capstone_liftoff-682x1024.jpg","publishedAt":"2022-06-30T02:02:27Z","content":"California: NASAs CubeSat designed to test a unique lunar orbit is safely in space and on the first leg of its journey to the Moon. The spacecraft is heading toward an orbit intended in the future fo… [+5643 chars]"},{"source":{"id":null,"name":"Thewire.in"},"author":"Vasudevan Mukunth","title":"AdS/CFT: 25 Years of the 'Bridge' to an Unknowable Universe - The Wire Science","description":"In 1997, Argentine physicist Juan Maldacena published what would become the most highly cited physics paper in history – with good reason.","url":"https://science.thewire.in/the-sciences/ads-cft-correspondence-maldacena-25-years/","urlToImage":"https://cdn.thewire.in/wp-content/uploads/2022/06/29153934/Black_hole_NASA.jpg","publishedAt":"2022-06-30T01:59:57Z","content":"An artist’s impression of a black hole and its accretion disk. Illustration: XMM-Newton, ESA, NASA\r\n<ul><li>In 1997, physicist Juan Maldacena found a way to mathematically bridge theories with and wi… [+9759 chars]"},{"source":{"id":null,"name":"News18"},"author":"Entertainment Bureau","title":"World Asteroid Day 2022: Must-Watch 6 Movies Featuring Earth-Threatening Asteroids - News18","description":"Space and asteroids have been top choices as genres of filmmaking. It proves to be a crowd-pulling and blockbuster genre","url":"https://www.news18.com/news/movies/world-asteroid-day-2022-must-watch-6-movies-featuring-earth-threatening-asteroids-5463955.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/world-asteroid-day-1-165651544516x9.jpg","publishedAt":"2022-06-30T01:50:45Z","content":"WORLD ASTEROID DAY 2022: World Asteroid Day is observed every year on 30 June. It is a United Nations-sanctioned day for public awareness of the risks of asteroid impacts on the world. The day is obs… [+2588 chars]"},{"source":{"id":null,"name":"Thefederal.com"},"author":null,"title":"Mars news: Key life matter found, public help sought for cloud-spotting - The Federal","description":"For the first time, NASA scientists have measured the total organic carbon – a key component in the molecules of life – in Martian rocks","url":"https://thefederal.com/science/mars-news-key-life-matter-found-public-help-sought-for-cloud-spotting/","urlToImage":"https://thefederal.com/wp-content/uploads/2022/06/mars-rocks.jpg","publishedAt":"2022-06-30T01:00:33Z","content":"For the first time, NASA scientists, using data from the Curiosity Rover, have measured the total organic carbon a key component in the molecules of life in Martian rocks.\r\nAccording to the National … [+4732 chars]"},{"source":{"id":null,"name":"Newsazi.com"},"author":"Eli Pacheco","title":"This Mars Orbiter Is Finally Getting A Software Update From Windows 98 - News Azi","description":"The MARSIS instrument works by firing low-frequency radio waves at the surface of Mars. Some of these waves bounce off the surface, while others travel deeper — and some of these bounce off layers below, like ice or rock. This lets sci","url":"https://newsazi.com/this-mars-orbiter-is-finally-getting-a-software-update-from-windows-98/","urlToImage":"https://www.slashgear.com/img/gallery/this-mars-orbiter-is-finally-getting-a-software-update-from-windows-98/l-intro-1656545607.jpg","publishedAt":"2022-06-29T23:47:21Z","content":"The MARSIS instrument works by firing low-frequency radio waves at the surface of Mars. Some of these waves bounce off the surface, while others travel deeper and some of these bounce off layers belo… [+2069 chars]"},{"source":{"id":null,"name":"Arab News"},"author":"Issam AHMED | AFP","title":"Webb telescope: NASA to reveal deepest image ever taken of Universe - Arab News","description":"WASHINGTON: NASA administrator Bill Nelson said Wednesday the agency will reveal the “deepest image of our Universe that has ever been taken” on July 12, thanks to the newly operational James Webb Space Telescope. “If you think about that, this is farther tha…","url":"https://www.arabnews.com/node/2113651","urlToImage":"https://www.arabnews.com/sites/default/files/main-image/2022/06/29/3311291-1124096637.jpeg","publishedAt":"2022-06-29T20:59:03Z","content":"WASHINGTON: NASA administrator Bill Nelson said Wednesday the agency will reveal the deepest image of our Universe that has ever been taken on July 12, thanks to the newly operational James Webb Spac… [+2953 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Amanda Kooser","title":"Satellite Snaps Wowza Space Selfie With Off-the-Shelf Camera - CNET","description":"NanoAvionics raises the bar for self-portraits in space.","url":"https://www.cnet.com/science/satellite-snaps-wowza-space-selfie-with-off-the-shelf-camera/","urlToImage":"https://www.cnet.com/a/img/resize/3aa90a375281309de99d709d90e6dcbf4c1aa2d3/2022/06/29/1cd784e5-1f2e-40ed-b21d-7561d0165157/nanoavionicsselfie.jpg?auto=webp&fit=crop&height=630&width=1200","publishedAt":"2022-06-29T19:23:14Z","content":"There's a new entry in the book for spacecraft selfies, and it may be one of the prettiest ever taken. NanoAvionic's MP42 microsatellite captured a photo and video of itself in orbit using an off-the… [+1727 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"How Seismic Waves From Earthquakes Can Be Used to Reveal Changes in the Earth's Core - Galaxy Reporters","description":"In May 1997, a massive earthquake trembled the Kermadec Islands region in the South Pacific Ocean. Roughly over 20 years later, in September 2018, a second earthquake struck the exact location, with waves of seismic energy originating from the same region. “T…","url":"https://galaxyreporters.com/how-seismic-waves-from-earthquakes-can-be-used-to-reveal-changes-in-the-earths-core/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2022/06/shutterstock_714451717-scaled.jpg","publishedAt":"2022-06-29T18:28:22Z","content":"In May 1997, a massive earthquake trembled the Kermadec Islands region in the South Pacific Ocean. Roughly over 20 years later, in September 2018, a second earthquake struck the exact location, with … [+1574 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"Researchers Introduced Method That could be Used to Attain a High-Level of Control Over Phononic Waveguides - Galaxy Reporters","description":"Most quantum computing technologies depend on proficiency in producing, manipulating, and observing non-classical states of light. Non-classical states are quantum states that cannot directly be generated through traditional sources of light, such as lamps an…","url":"https://galaxyreporters.com/researchers-introduced-method-that-could-be-used-to-attain-a-high-level-of-control-over-phononic-waveguides/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2022/06/shutterstock_1457191784-scaled.jpg","publishedAt":"2022-06-29T18:22:34Z","content":"Most quantum computing technologies depend on proficiency in producing, manipulating, and observing non-classical states of light. Non-classical states are quantum states that cannot directly be gene… [+1566 chars]"},{"source":{"id":null,"name":"ANI News"},"author":null,"title":"Dogs trace ancestry to two separate wolf populations, study reveals - ANI News","description":"Washington [US], June 29 (ANI): According to a new study by an international group of geneticists and archaeologists of the Francis Crick Institute, have discovered that the ancestry of dogs can be traced to at least two populations of ancient wolves. The stu…","url":"https://www.aninews.in/news/science/dogs-trace-ancestry-to-two-separate-wolf-populations-study-reveals20220629233007","urlToImage":"https://aniportalimages.s3.amazonaws.com/media/details/vaudsheihfiewfihfi2022062917310020220629175356.jpg","publishedAt":"2022-06-29T18:00:00Z","content":"Washington [US], June 29 (ANI): According to a new study by an international group of geneticists and archaeologists of the Francis Crick Institute, have discovered that the ancestry of dogs can be t… [+4554 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"Astronomers Are Watching As Red Supergiant 'VY Canis Majoris' Gets Swallowed by a Black Hole - Galaxy Reporters","description":"Three-dimensional prototypes of astronomical objects can be highly complicated. They can vary from black holes, so light doesn’t escape the sheer size of the universe and everything within. However, not every object has attained the attention required to deve…","url":"https://galaxyreporters.com/astronomers-are-watching-as-red-supergiant-vy-canis-majoris-gets-swallowed-by-a-black-hole/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_1769715404-scaled.jpg","publishedAt":"2022-06-29T17:13:15Z","content":"Three-dimensional prototypes of astronomical objects can be highly complicated. They can vary from black holes, so light doesn’t escape the sheer size of the universe and everything within. However, … [+1534 chars]"},{"source":{"id":null,"name":"Giantfreakinrobot.com"},"author":null,"title":"NASA Says They Can Grow Food In Space Without Soil - Giant Freakin Robot","description":"NASA seems to think they can grow food without soil. Seriously? As gross as it was, even Matt Damon needed soil in The Martian.","url":"https://www.giantfreakinrobot.com/sci/nasa-food-space.html","urlToImage":"https://www.giantfreakinrobot.com/wp-content/uploads/2020/09/nasa-1-e1656542840750.jpg","publishedAt":"2022-06-29T16:55:47Z","content":"By Charlene Badasie\r\n| 2 hours ago\r\nAs humanitys exploration of space continues, NASA is looking for ways to provide astronauts with nutrients in a long-lasting, easily absorbed form. The best way to… [+3430 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Elizabeth Howell","title":"NASA sun mission spots stunning solar eclipse in space - Space.com","description":"The moon's mountains were 'backlit by solar fire' at the peak.","url":"https://www.space.com/solar-eclipse-seen-from-space-june-2022","urlToImage":"https://cdn.mos.cms.futurecdn.net/3hF5sNJqWbzZh6UPajGYZd-1200-80.gif","publishedAt":"2022-06-29T16:23:50Z","content":"A sungazing spacecraft captured the moon passing in front of the face of the sun Wednesday (June 29).\r\nNASA's Solar Dynamics Observatory caught the solar eclipse in action from its unique vantage poi… [+2290 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"Catch a glimpse of ‘mysterious markings’ on Mars surface. Find out what it is - WION","description":"The polygons form when the water ice, which is frozen in the soil, splits it apart. In spring, the edges of these polygons crack as the surface ice transforms into gas due to sublimation, as per the researchers of the University of Arizona, which manages the …","url":"https://www.wionews.com/science/catch-a-glimpse-of-mysterious-markings-on-mars-surface-find-out-what-it-is-493035","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/29/275230-polygons.jpg","publishedAt":"2022-06-29T16:16:04Z","content":"A bizarre picture, which was clicked and shared by the High-Resolution Imaging Experiment (HiRISE) camera onboard Mars Reconnaissance Orbiter, shows polygon-shaped markings on the surface of the red … [+1478 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Rachel Wallach","title":"NASA mission aims to study ice and water on the moon's surface - Phys.org","description":"In the fall of 2023, a U.S. rover will land at the south pole of the moon. Its mission: to explore the water ice that scientists know lurks within the lunar shadows, and which they believe could help sustain humans who may one day explore the moon or use it a…","url":"https://phys.org/news/2022-06-nasa-mission-aims-ice-moon.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/nasa-mission-aims-to-s.jpg","publishedAt":"2022-06-29T16:13:32Z","content":"In the fall of 2023, a U.S. rover will land at the south pole of the moon. Its mission: to explore the water ice that scientists know lurks within the lunar shadows, and which they believe could help… [+6465 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"By Amanda Morris","title":"Falling stardust, wobbly jets explain blinking gamma ray bursts - Phys.org","description":"A Northwestern University-led team of astrophysicists has developed the first-ever full 3D simulation of an entire evolution of a jet formed by a collapsing star, or a \"collapsar.\"","url":"https://phys.org/news/2022-06-falling-stardust-jets-gamma-ray.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/falling-stardust-wobbl.jpg","publishedAt":"2022-06-29T15:45:43Z","content":"A Northwestern University-led team of astrophysicists has developed the first-ever full 3D simulation of an entire evolution of a jet formed by a collapsing star, or a \"collapsar.\"\r\nBecause these jet… [+7339 chars]"},{"source":{"id":null,"name":"Livemint"},"author":"Livemint","title":"Zombie star survives Supernova blast but can Sun live through it too? | Mint - Mint","description":"Our sun cannot become a zombie star, however, because it lacks the requisite companion star.","url":"https://www.livemint.com/news/world/zombie-star-survives-supernova-blast-but-can-sun-live-through-it-too-11656506687110.html","urlToImage":"https://images.livemint.com/img/2022/06/29/600x338/SPACE-EXPLORATION-SUPERNOVA-0_1656508872616_1656508905577.JPG","publishedAt":"2022-06-29T13:26:37Z","content":"In an extraordinary feat, recently a star not only survived a stellar explosion called a supernova but emerged from it brighter than before the blast. The event in a relatively nearby galaxy was obse… [+2434 chars]"}]}