{"status":"ok","totalResults":69,"articles":[{"source":{"id":null,"name":"Futurity: Research News"},"author":"Louise Lerner-Chicago","title":"Black hole collisions may clarify how fast the universe is expanding - Futurity: Research News","description":"A new technique may provide a unique window into the \"teenage\" years of the universe that are hard to study with other methods.","url":"https://www.futurity.org/black-holes-universe-expanding-2787072-2/","urlToImage":"https://www.futurity.org/wp/wp-content/uploads/2022/08/black-hole-collisions-universe-expanding-1600.jpg","publishedAt":"2022-08-22T16:21:05Z","content":"A black hole is usually where information goes to disappearbut scientists may have found a trick to use its last moments to tell us about the history of the universe.\r\nIn a new study, two astrophysic… [+5135 chars]"},{"source":{"id":null,"name":"CNBCTV18"},"author":"CNBCTV18.com","title":"Global warming sparked off rise of the reptiles: New study - CNBCTV18","description":"Scientists so far believed that the reptile population explosion was due to the extinction of their competitors. However, this new study led by Harvard University indicates that extreme climate change, rather than mass extinction, was behind the boom millions…","url":"https://www.cnbctv18.com/environment/global-warming-sparked-off-rise-of-the-reptiles-new-study-14559722.htm","urlToImage":"https://images.cnbctv18.com/wp-content/uploads/2019/04/Crocodile.jpg","publishedAt":"2022-08-22T15:43:00Z","content":"Scientists so far believed that the reptile population explosion was due to the extinction of their competitors. However, this new study led by Harvard University indicates that extreme climate chang… [+2877 chars]"},{"source":{"id":null,"name":"India.com"},"author":"Zee Media Bureau","title":"Sound of black hole! NASA releases fresh audio from outer space, listen here - Zee News","description":"Quashing the popular belief that there is no sound presence in the other space, the American space research agency NASA on Monday released an audio clip of the sound waves of a black hole. Taking to Twitter, NASA Exoplanets shared the audio clip.","url":"https://zeenews.india.com/world/sound-of-black-hole-nasa-releases-fresh-audio-from-outer-space-listen-here-2500357.html","urlToImage":"https://english.cdn.zeenews.com/sites/default/files/2022/08/22/1080818-black-hole-sound.png","publishedAt":"2022-08-22T15:42:26Z","content":"New Delhi: Quashing the popular belief that there is no sound presence in the other space, the American space research agency NASA on Monday released an audio clip of the sound waves of a black hole.… [+1659 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Matt Williams","title":"Were Phobos and Deimos once a single Martian moon that split up? Not likely, says new study - Phys.org","description":"The origin of Phobos and Deimos, the two Martian moons, has been a mystery to astronomers. These two bodies are a fraction of the size and mass of the Moon, measuring just 22.7 km (14 mi) and 12.6 km (7.83 mi) in diameter. Both have a rapid orbital period, ta…","url":"https://phys.org/news/2022-08-phobos-deimos-martian-moon.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/were-phobos-and-deimos.jpg","publishedAt":"2022-08-22T15:31:30Z","content":"The origin of Phobos and Deimos, the two Martian moons, has been a mystery to astronomers. These two bodies are a fraction of the size and mass of the Moon, measuring just 22.7 km (14 mi) and 12.6 km… [+8077 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"NASA Delivers the Most Powerful Moon Rocket - NASA's Marshall Space Flight Center","description":null,"url":"https://www.youtube.com/supported_browsers?next_url=https:%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DFQOHUstpAfg","urlToImage":null,"publishedAt":"2022-08-22T15:25:42Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":null,"name":"Bollyinside.com"},"author":"Lisa Jennings","title":"NASA picks astrophysics mission ideas for research - BollyInside","description":"NASA has selected four mission concepts for additional research in the latest round of its astrophysics program, but budget constraints may cause some","url":"https://www.bollyinside.com/news/nasa-picks-astrophysics-mission-ideas-for-research","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/NASA-picks-astrophysics-mission-ideas-for-research.jpeg","publishedAt":"2022-08-22T14:08:32Z","content":"NASA has selected four mission concepts for additional research in the latest round of its astrophysics program, but budget constraints may cause some mission delays.\r\nNASA announced on August 18 tha… [+2778 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Water on Mars? NASA just made a shocking revelation Mars - HT Tech","description":"A new study connected the seismic data from NASA's Mars InSight mission to the properties of rocks, sediments, and ice on the red planet. Here's what has been revealed.","url":"https://tech.hindustantimes.com/tech/news/water-on-mars-nasa-just-made-a-shocking-revelation-mars-71661176538325.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/22/1600x900/AFP_1UY0J6_1596116367688_1661176635190_1661176635190.jpg","publishedAt":"2022-08-22T13:57:43Z","content":"The hunt for water on Mars has a long history. In the latest development, new analysis of seismic data from the Mars InSight mission of NASA has revealed some surprising facts about the red planet. N… [+1628 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"A 4 billion-year-old piece of the Earth’s crust found - HT Tech","description":"An ancient piece of Earth’s crust was found underneath the South-West of Western Australia.","url":"https://tech.hindustantimes.com/tech/news/a-4-billion-year-old-piece-of-the-earth-s-crust-found-71661175593357.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/22/1600x900/680_earth20110309-640-640x350_1648822247628_1661175947721_1661175947721.jpg","publishedAt":"2022-08-22T13:46:59Z","content":"Researchers from Curtin University have found evidence of an ancient piece of the Earth's crust beneath the South-West of Western Australia. The piece is reportedly almost four billion-year-old. Acco… [+1691 chars]"},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Rupendra Brahambhatt","title":"Mysterious sharks can walk on land without legs -thanks to evolution - Interesting Engineering","description":"These peculiar benthic sharks use their fins to walk on the surface, and they can survive in oxygen-deficient conditions for about two hours.","url":"https://interestingengineering.com/science/mysterious-sharks-can-walk-on-land","urlToImage":"https://inteng-storage.s3.amazonaws.com/2022/08/22/image/jpeg/wb9ybFQPzjDh3qS0pkJu5VtmMtbPffqA1CbV92o4.jpg","publishedAt":"2022-08-22T13:17:31Z","content":"The researchers claim that when it comes to survival-focused evolutionary development, epaulette sharks break all rules. However, more research is required to investigate further the factors affectin… [+2823 chars]"},{"source":{"id":null,"name":"ExtremeTech"},"author":"Ryan Whitwam","title":"Scientists Discover 5-Mile Wide Impact Crater Off the Coast of Africa - ExtremeTech","description":"Following the discovery of a second impact crater off the coast of Africa, we might have to rethink the end of the Cretaceous period.","url":"https://www.extremetech.com/?p=338954","urlToImage":"https://www.extremetech.com/wp-content/uploads/2013/02/asteroid-hurtling-towards-earth1-640x353.jpg","publishedAt":"2022-08-22T13:15:00Z","content":"The age of dinosaurs lasted 165 million years, but that changed one fateful spring day 66 million years ago. Scientists have long known that a large object smacked into the region we now know as the … [+2330 chars]"},{"source":{"id":null,"name":"Psu.edu"},"author":"Gail McCormick","title":"Revealed missing step in lipid formation could enable detection of past climate - Pennsylvania State University","description":"The missing step in the formation of a lipid molecule that allows certain single-celled organisms to survive the most extreme environments on Earth has now been deciphered. This new understanding, uncovered by a team of biochemists from Penn State, could impr…","url":"https://www.psu.edu/news/eberly-college-science/story/revealed-missing-step-lipid-formation-could-enable-detection-past/","urlToImage":"https://psu-gatsby-files-prod.s3.amazonaws.com/s3fs-public/styles/16_9_1000w/public/2022/08/GDGT-MAS-Structure_LR43.jpg?h=08b866d1&itok=daZJQYT5","publishedAt":"2022-08-22T13:04:10Z","content":"UNIVERSITY PARK, Pa. The missing step in the formation of a lipid molecule that allows certain single-celled organisms to survive the most extreme environments on Earth has now been deciphered. This … [+1682 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Tomasz Nowakowski","title":"Researchers detect dozens of new variable stars - Phys.org","description":"By observing the field of globular cluster Palomar 2 with the Indian Astronomical Observatory (IAO), astronomers have discovered 32 new variable stars. The newfound variables are mostly RR Lyrae stars and cluster members. The finding is reported in a paper pu…","url":"https://phys.org/news/2022-08-dozens-variable-stars.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/researchers-detect-doz.jpg","publishedAt":"2022-08-22T13:00:01Z","content":"By observing the field of globular cluster Palomar 2 with the Indian Astronomical Observatory (IAO), astronomers have discovered 32 new variable stars. The newfound variables are mostly RR Lyrae star… [+3218 chars]"},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Chris Young","title":"Einstein is right, again! Rotating black holes are stable - Interesting Engineering","description":"An international team of scientists finally found mathematical proof that slowly rotating Kerr black holes are stable.","url":"https://interestingengineering.com/science/rotating-black-holes-are-stable","urlToImage":"https://inteng-storage.s3.amazonaws.com/2022/08/22/image/jpeg/8YfkqzJ5WOf66wTsNNeouBjHgySx8sXULNkfvrUS.jpg","publishedAt":"2022-08-22T12:54:36Z","content":"Stable rotating black holes\r\nIf a black hole is stable, it will eventually revert to Kerr's mathematical description, even after receiving an intense jolt from gravitational waves. If these black hol… [+1354 chars]"},{"source":{"id":null,"name":"India Today"},"author":null,"title":"James Webb telescope spots rings around Jupiter | See inside - India Today","description":"The James Webb Telescope has looked at Jupiter and it has seen a new world like never before.","url":"https://www.indiatoday.in/science/story/james-webb-telescope-spots-rings-around-jupiter-see-inside-1991164-2022-08-22","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Jupiter_5-647x363.jpeg?x0xuKAGerIbfFi6m14OO.HVRI1Lgw7xV","publishedAt":"2022-08-22T12:51:30Z","content":"The James Webb Telescope is looking closer to home after capturing stunning phenomena from the edge of time itself. The world's most powerful spacecraft has captured Jupiter like never seen before. T… [+2675 chars]"},{"source":{"id":null,"name":"Upjobsnews.com"},"author":null,"title":"How many moons can Earth have at most? & More Latest News Here - upjobsnews","description":"","url":"https://upjobsnews.com/how-many-moons-can-earth-have-at-most-more-latest-news-here/","urlToImage":"https://www.vaughantoday.ca/wp-content/uploads/2020/11/21-1.jpg","publishedAt":"2022-08-22T12:47:26Z","content":"our solar system It has eight planets, plus a few dwarf planets, such as Pluto where Ceres. But we often forget to consider that they are not traveling alone in their constant race around Sun. Most o… [+2802 chars]"},{"source":{"id":null,"name":"Idiva.com"},"author":"Krithika Kumar","title":"Bring On Your Telescope Because We Found New Stars In The Galaxy And They’re Shining Bright - iDiva.com","description":"Lunar theories are spectacular. They surprise us with things that we could have never imagined, yet has a million unanswered secrets hidden within.They are also so much more than just astronomical coincidences. Backward dancing of the stars and the plants or …","url":"https://www.idiva.com/entertainment/bollywood/bring-on-your-telescope-because-we-found-new-stars-in-the-galaxy/18039672","urlToImage":"https://im.idiva.com/content/2022/Aug/Galaxy-1_63035cc52ebcb.jpg","publishedAt":"2022-08-22T12:12:09Z","content":"Lunar theories are spectacular. They surprise us with things that we could have never imagined, yet has a million unanswered secrets hidden within.\r\nThey are also so much more than just astronomical … [+1224 chars]"},{"source":{"id":null,"name":"PR Web"},"author":null,"title":"Othram Appoints Carla Davis as Chief Genetic Genealogist - PR Web","description":"THE WOODLANDS, Texas (PRWEB) August 22, 2022 \n\n Othram, the leading forensic sequencing laboratory for law enforcement, is pleased to announce the appointment of Carla Davis as Chief Genetic Genealo","url":"https://www.prweb.com/releases/2022/8/prweb18855784.htm","urlToImage":null,"publishedAt":"2022-08-22T12:05:45Z","content":"THE WOODLANDS, Texas (PRWEB)August 22, 2022\r\n Othram, the leading forensic sequencing laboratory for law enforcement, is pleased to announce the appointment of Carla Davis as Chief Genetic Genealogis… [+2523 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"Shaurya Tomer","title":"Asteroid 2020 QW3 just missed Earth; know all about it - HT Tech","description":"An asteroid just missed Earth this morning! Asteroid QW3 whizzed past Earth during the early hours today. Here’s what we know.","url":"https://tech.hindustantimes.com/tech/news/asteroid-2020-qw3-just-missed-earth-know-all-about-it-71661169185128.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/22/1600x900/asteroid-3628185_1920_1631933514992_1661169238081_1661169238081.jpg","publishedAt":"2022-08-22T11:55:24Z","content":"A 92 feet wide asteroid named Asteroid 2020 QW3 just missed Earth on August 22 at 06:41am, according to NASA. Although it was not on a collision course with Earth, it passed close enough to Earth for… [+1507 chars]"},{"source":{"id":null,"name":"TweakTown"},"author":"Adam Hunt","title":"Stunning photos of the Northern Lights caught from space station - TweakTown","description":"NASA astronaut Bob Hines has shared photos from the International Space Station (ISS) showing off the aurora borealis, or northern lights, from space.","url":"https://www.tweaktown.com/news/88056/stunning-photos-of-the-northern-lights-caught-from-space-station/index.html","urlToImage":"https://static.tweaktown.com/news/8/8/88056_01_solar-storm-captured-in-spellbinding-photos-taken-from-the-iss_full.jpg","publishedAt":"2022-08-22T11:34:02Z","content":"NASA astronaut Bob Hines took to Twitter to share photographs taken of Earth from the International Space Station (ISS) on Wednesday, August 17th.\r\nHines shared a collection of four photos from a lar… [+1410 chars]"},{"source":{"id":null,"name":"India Education Diary"},"author":"iednewsdesk","title":"Aalto University: A greener route to blue – a new method drastically reduces the amount of solvent needed to produce widely used organic dyes - India Education Diary","description":"Organic, or carbon-containing dyes have important roles in nature. For example, they are responsible for transporting oxygen and other gases in the body (as part of haemoglobin) and converting solar energy into chemical energy in photosynthesis (chlo","url":"https://indiaeducationdiary.in/aalto-university-a-greener-route-to-blue-a-new-method-drastically-reduces-the-amount-of-solvent-needed-to-produce-widely-used-organic-dyes-2/","urlToImage":"https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/Aalto-University.png?fit=1024%2C853&ssl=1","publishedAt":"2022-08-22T11:24:18Z","content":"Organic, or carbon-containing dyes have important roles in nature. For example, they are responsible for transporting oxygen and other gases in the body (as part of haemoglobin) and converting solar … [+3086 chars]"}]}