{"status":"ok","totalResults":66,"articles":[{"source":{"id":null,"name":"Lankatimes.com"},"author":"Izer","title":"Underwater snow reveals clues about Europe's ocean world - Lanka Times","description":"Underwater snow forms in the World Ocean and travels through the water to connect to submerged valleys and inverted ice caps, according to new research.","url":"https://www.lankatimes.com/underwater-snow-reveals-clues-about-europes-ocean-world/","urlToImage":"https://www.lankatimes.com/wp-content/uploads/2022/08/Underwater-snow-reveals-clues-about-Europes-ocean-world.jpg","publishedAt":"2022-08-18T23:24:22Z","content":"Underwater snow forms in the World Ocean and travels through the water to connect to submerged valleys and inverted ice caps, according to new research. This same phenomenon occurs beneath Earth’s ic… [+3644 chars]"},{"source":{"id":null,"name":"Upjobsnews.com"},"author":null,"title":"New Fines for Failure at Emiratization & More Latest News Here - upjobsnews","description":"","url":"https://upjobsnews.com/new-fines-for-failure-at-emiratization-more-latest-news-here/","urlToImage":"https://shrm-res.cloudinary.com/image/upload/c_crop,h_705,w_1254,x_0,y_128/w_auto:100,w_1200,q_35,f_auto/v1/Global%20HR/Dubai5m_d0frud.jpg","publishedAt":"2022-08-18T21:16:13Z","content":"Emiratization, an initiative to encourage companies to employ more United Arab Emirates nationals in UAE-based companies, has been in place in some form since 2006 in the UAE. Beginning January 2023,… [+5478 chars]"},{"source":{"id":null,"name":"Nationworldnews.com"},"author":"https://www.facebook.com/nationworldnews1","title":"How Dinosaurs Successfully Supported Their Body Revealed - Nation World News","description":"How dinosaurs supported their bodies is a very interesting mystery. How could an animal with a very large body really live?","url":"https://nationworldnews.com/how-dinosaurs-successfully-supported-their-body-revealed/","urlToImage":"https://nationworldnews.com/wp-content/uploads/2022/08/How-Dinosaurs-Successfully-Supported-Their-Body-Revealed.jpg","publishedAt":"2022-08-18T19:05:17Z","content":"How dinosaurs supported their bodies is a very interesting mystery. How could an animal with a very large body really live?\r\nDinosaurs are very famous ancient animals because they generally have larg… [+2718 chars]"},{"source":{"id":null,"name":"Zoom"},"author":"TN Science Desk","title":"Indian Scientists formulate model to trace elusive exo-moons using data from James Webb Space Telescope - Times Now","description":"Professor Sujan Sengupta and his graduate student Suman Saha have developed an analytical model that uses the radius and orbital properties of the host planet and its moon as parameters to model the photometric transit light curve of moon-hosting exoplanets","url":"https://www.timesnownews.com/technology-science/indian-scientists-formulate-model-to-trace-elusive-exo-moons-using-data-from-james-webb-space-telescope-article-93647199","urlToImage":"https://static.tnn.in/thumb/msid-93647199,imgsize-100,width-1280,height-720,resizemode-75/93647199.jpg","publishedAt":"2022-08-18T18:47:41Z","content":"This $1 billion telescope will be 4 times more powerful than James Webb Telescope, and 10 times more than Hubble; details"},{"source":{"id":null,"name":"Dailypioneer.com"},"author":"The Pioneer","title":"Russian spacewalk cut short by bad battery - Daily Pioneer","description":"A Russian spacewalker had to rush back inside the International Space Station on Wednesday when the battery voltage in his spacesuit suddenly dropped.\n\nRussian Mission Control ordered Oleg Artemyev, the station commander, to quickly return to the airlock so h…","url":"https://www.dailypioneer.com/2022/world/russian-spacewalk-cut-short-by-bad-battery.html","urlToImage":"https://www.dailypioneer.com/images/logo.jpg","publishedAt":"2022-08-18T18:31:03Z","content":"A Russian spacewalker had to rush back inside the International Space Station on Wednesday when the battery voltage in his spacesuit suddenly dropped.\r\nRussian Mission Control ordered Oleg Artemyev, … [+876 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Bob Yirka","title":"Grains of dust from asteroid Ryugu older than our solar system - Phys.org","description":"An international team of researchers studying dust samples retrieved by the Hayabusa-2 space probe, has found that some of its dust grains are older than the solar system. In their paper published in The Astrophysical Journal Letters, the group describes thei…","url":"https://phys.org/news/2022-08-grains-asteroid-ryugu-older-solar.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/grains-of-dust-from-as.jpg","publishedAt":"2022-08-18T17:30:02Z","content":"(a) Backscattered electron (BSE) image of Ryugu thin section A0058-2. Every black area consists of 20 NanoSIMS maps measured. (b) An area in section C0002 with a less altered lithology than the surro… [+3901 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Study first to explore 'walking' sharks on the move in early life stages - Phys.org","description":"A newly-discovered walking shark that breaks all of the rules for survival is the focus of a first-of-its-kind study by Florida Atlantic University and collaborators in Australia. Researchers investigated how walking and swimming changes in the epaulette shar…","url":"https://phys.org/news/2022-08-explore-sharks-early-life-stages.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/study-first-to-explore.jpg","publishedAt":"2022-08-18T16:50:44Z","content":"A newly-discovered walking shark that breaks all of the rules for survival is the focus of a first-of-its-kind study by Florida Atlantic University and collaborators in Australia. Researchers investi… [+5034 chars]"},{"source":{"id":null,"name":"Gadgets Now"},"author":"AP","title":"Moon rocket from NASA moved to launch pad for initial test flight - Gadgets Now","description":"NASA's new moon rocket arrived at the launch pad ahead of its debut flight in less than two weeks.  The 322-foot (98-meter) rocket emerged from its mammoth hangar late Tuesday night, drawing crowds of Kennedy Space Center workers, many of whom were not yet bo…","url":"https://www.gadgetsnow.com/tech-news/moon-rocket-from-nasa-moved-to-launch-pad-for-initial-test-flight/articleshow/93646057.cms","urlToImage":"https://static.toiimg.com/thumb/resizemode-4,msid-93646057,imgsize-85796,width-800/93646057.jpg","publishedAt":"2022-08-18T16:26:00Z","content":"NASA's new moon rocket arrived at the launch pad ahead of its debut flight in less than two weeks. The 322-foot (98-meter) rocket emerged from its mammoth hangar late Tuesday night, drawing crowds of… [+2314 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"Astrologists discover asteroid crater, it may be dinosaur killer`s baby cousin - WION","description":"Highlighting the possibility that Nadir might have struck the planet a million or two years on either side of the Mexican cataclysm, professor Sean Gulick said that to find out whether they are the same or not the rocks from the west African crater are inspec…","url":"https://www.wionews.com/science/astrologists-discover-new-asteroid-it-may-be-dinosaur-killers-baby-cousin-508171","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/07/260480-dino-1.jpg","publishedAt":"2022-08-18T15:41:36Z","content":"A new asteroid crater has been found approximately 400km off the coast of Guinea in Western Africa which could be the dinosaur killer's baby cousin.\r\nAstrologists believe that the asteroid created an… [+1743 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Science X staff","title":"Team investigates collective actuation of an elastic network of 'mini-robots' - Phys.org","description":"The physics of collective motion has been well-studied for the last thirty years. Until now, scientists have focused on the study of \"fluid\" movements, such as those of flocks of birds or schools of fish. Now, using an ingenious experimental device, researche…","url":"https://phys.org/news/2022-08-team-actuation-elastic-network-mini-robots.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/collective-actuation-o.jpg","publishedAt":"2022-08-18T15:13:29Z","content":"The physics of collective motion has been well-studied for the last thirty years. Until now, scientists have focused on the study of \"fluid\" movements, such as those of flocks of birds or schools of … [+3598 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Bill Nye Breaks Down Webb Telescope Space Images | WIRED - WIRED","description":"The James Webb Space Telescope has dazzled us with its first batch of images. WIRED got in touch with the one and only Bill Nye to break down some of these a...","url":"https://www.youtube.com/watch?v=piMfL12RzoA","urlToImage":"https://i.ytimg.com/vi/piMfL12RzoA/hqdefault.jpg","publishedAt":"2022-08-18T14:10:36Z","content":null},{"source":{"id":null,"name":"Samacharcentral.com"},"author":"Shweta Varshney","title":"‘Molecular movies’ shed light on enzyme involved in greenhouse gas production - Samachar Central","description":"T2Cu site during the MSOX series of a nitrite-soaked Br2DNiR crystal. (A) The T2Cu site after first exposure to 0.8-MGy X-rays (DS1) showing full occupancy of a single side-on nitrite","url":"https://samacharcentral.com/molecular-movies-shed-light-on-enzyme-involved-in-greenhouse-gas-production/","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/molecular-movies-shed.jpg","publishedAt":"2022-08-18T13:14:03Z","content":"T2Cu site during the MSOX series of a nitrite-soaked Br2DNiR crystal. (A) The T2Cu site after first exposure to 0.8-MGy X-rays (DS1) showing full occupancy of a single side-on nitrite coordinated to … [+4855 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Paul M. Sutter","title":"Astronomers obtain new images of R136, the most massive star ever found - Phys.org","description":"Meet R136a1, the most massive star known. Located in the Large Magellanic Cloud, it's a hulking behemoth weighing somewhere between 150 and 200 times the mass of the sun. Understanding the upper limit of stars helps astronomers piece together everything from …","url":"https://phys.org/news/2022-08-astronomers-images-r136-massive-star.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/r136-is-the-most-massi.jpg","publishedAt":"2022-08-18T12:45:00Z","content":"Meet R136a1, the most massive star known. Located in the Large Magellanic Cloud, it's a hulking behemoth weighing somewhere between 150 and 200 times the mass of the sun. Understanding the upper limi… [+2411 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Nancy Atkinson","title":"See the largest image the James Webb Space Telescope has taken to date - Phys.org","description":"A team of scientists using the James Webb Space Telescope have just released the largest image taken by the telescope so far. The image is a mosaic of 690 individual frames taken with the telescope's Near Infrared Camera (NIRCam) and it covers an area of sky …","url":"https://phys.org/news/2022-08-largest-image-james-webb-space.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/see-the-largest-image-3.jpg","publishedAt":"2022-08-18T12:44:36Z","content":"A team of scientists using the James Webb Space Telescope have just released the largest image taken by the telescope so far. The image is a mosaic of 690 individual frames taken with the telescope's… [+3576 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"A closer look at the James Webb space telescope - CP24","description":"The first batch of images from the James Webb Telescope has re-invigorated space exploration and the search for galaxies far beyond ours and with Canada's co...","url":"https://www.youtube.com/watch?v=aKocjotgG1M","urlToImage":"https://i.ytimg.com/vi/aKocjotgG1M/hqdefault.jpg","publishedAt":"2022-08-18T12:37:21Z","content":null},{"source":{"id":null,"name":"Tech Explorist"},"author":"Pranjal Mehar","title":"A plasma-based way to produce and separate oxygen within the Martian environment - Tech Explorist","description":"Harvesting resources on Mars with plasmas.","url":"https://www.techexplorist.com/plasma-based-way-produce-separate-oxygen-martian-environment/53161/","urlToImage":"https://www.techexplorist.com/wp-content/uploads/2022/08/Carbon-dioxide-plasma.jpg","publishedAt":"2022-08-18T11:59:52Z","content":"The fourth naturally occurring state of matter, plasma, includes free-floating charged particles like electrons and ions. Due to their small weight and ease of electric field acceleration, electrons … [+1751 chars]"},{"source":{"id":null,"name":"DNA India"},"author":null,"title":"Study: Black hole collisions can help in understanding the rate of universe's expansion - DNA India","description":"In a new study, two University of Chicago astrophysicists laid out a method for using pairs of colliding black holes to measure how fast the universe is expanding, and thus understand how the universe evolved, what it is made out of, and where it's going. In …","url":"https://www.dnaindia.com/india/video-study-black-hole-collisions-can-help-in-understanding-the-rate-of-universe-s-expansion-2977628","urlToImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/18/2531169-1800000003.jpg","publishedAt":"2022-08-18T11:26:28Z","content":null},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Spotlight Special","title":"45 years in space: NASA's twin Voyager spacecraft still solving mysteries - Economic Times","description":"The Voyager Mission, comprising 2 spacecraft, Voyager 1 and Voyager 2, completes 45 years in space, becoming the longest-running NASA space mission.","url":"https://economictimes.indiatimes.com/news/international/us/45-years-in-space-nasas-twin-voyager-spacecraft-still-solving-mysteries/articleshow/93639089.cms","urlToImage":"https://img.etimg.com/thumb/msid-93639168,width-1070,height-580,imgsize-169734,overlay-economictimes/photo.jpg","publishedAt":"2022-08-18T10:33:00Z","content":"It is interesting to note that NASA's Voyager 2 was released into space before Voyager 1. On August 20th, 1977, Voyager 2 was launched into space, whereas Voyager 1 was launched on September 3rd, 197… [+2528 chars]"},{"source":{"id":null,"name":"Daily Mail"},"author":"Fiona Jackson","title":"Astrophotographer captures clear image of Saturn as it makes its closest approach to Earth this year - Daily Mail","description":"An astrophotographer captured his clearest ever photo of Saturn from Los Angeles, USA on Sunday. The gas giant also reached its closest point to Earth this year, and was therefore at its brightest.","url":"https://www.dailymail.co.uk/sciencetech/article-11123167/Astrophotographer-captures-clear-image-Saturn-makes-closest-approach-Earth-year.html","urlToImage":"https://i.dailymail.co.uk/1s/2022/08/18/10/61499429-0-image-a-200_1660814386208.jpg","publishedAt":"2022-08-18T10:23:14Z","content":"An astrophotographer has taken his clearest ever picture of Saturn while it made its closest approach to Earth this year.\r\nOur planet moved almost directly between Saturn and the sun on Sunday, in an… [+7389 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Keith Cooper","title":"James Webb Space Telescope will seek clouds of vaporized gems on exoplanets - Space.com","description":"Astronomers are looking for clouds made of vaporized gems and metals on faraway exoplanets.","url":"https://www.space.com/james-webb-space-telescope-exoplanet-atmosphere-gems","urlToImage":"https://cdn.mos.cms.futurecdn.net/QvqRbQtF9P87ymBzMNbdNe-1200-80.jpg","publishedAt":"2022-08-18T10:00:28Z","content":"Astronomers will be hoping for cloudy skies as the James Webb Space Telescope\r\n (JWST or Webb) turns its attention to exoplanetary atmospheres laden with vaporized rock and crystals such as corundum … [+6544 chars]"}]}