{"status":"ok","totalResults":61,"articles":[{"source":{"id":null,"name":"Hindustan Times"},"author":null,"title":"NASA Psyche asteroid mission suffers massive setback - HT Tech","description":"NASA put Psyche asteroid mission on hold Friday, blaming the late delivery of its own navigation software.","url":"https://tech.hindustantimes.com/tech/news/nasa-asteroid-mission-on-hold-due-to-late-software-delivery-71656145647525.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/pia24471-3-1041_1650699181614_1656149571811.jpg","publishedAt":"2022-06-26T04:17:50Z","content":"NASA put Psyche asteroid mission on hold Friday, blaming the late delivery of its own navigation software. The Psyche mission to a strange metal asteroid of the same name was supposed to launch this … [+2028 chars]"},{"source":{"id":null,"name":"News18"},"author":"Buzz Staff","title":"Massive Sunspot Twice the Size of Earth is Facing Our Home Planet - News18","description":"The sunspot has reportedly doubled its diameter in 24 hours, and it is pointed right at our planet. The magnetic field surrounding sunspot AR3038 has the potential to blast M-class solar flares toward our planet.","url":"https://www.news18.com/news/buzz/massive-sunspot-twice-the-size-of-earth-is-facing-our-home-planet-5439205.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/solar-flares-165615765116x9.png","publishedAt":"2022-06-26T02:30:39Z","content":"Celestial events are always interesting to witness and most recently we are witnessing a gigantic sunspot that has grown equal to twice the size of Earth. The sunspot has reportedly doubled its diame… [+1949 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Artificial Photosynthesis Can Produce Food in Complete Darkness - SciTechDaily","description":"Artificial photosynthesis is being developed by researchers to help make food production more energy-efficient on Earth, and maybe one day on Mars. For millions of years, photosynthesis has evolved in plants to turn water, carbon dioxide, and the energy from …","url":"https://scitechdaily.com/artificial-photosynthesis-can-produce-food-in-complete-darkness/","urlToImage":"https://scitechdaily.com/images/Plants-Growing-in-Complete-Darkness.jpg","publishedAt":"2022-06-26T01:21:33Z","content":"ByUniversity of California RiversideJune 25, 2022\r\nPlants are growing in complete darkness in an acetate medium that replaces biological photosynthesis. Credit: Marcus Harland-Dunaway/UCR\r\nArtificial… [+5242 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"A space traveler offers advice to aspiring astronauts - BollyInside","description":"More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an","url":"https://www.bollyinside.com/news/a-space-traveler-offers-advice-to-aspiring-astronauts","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/A-space-traveler-offers-advice-to-aspiring-astronauts.jpeg","publishedAt":"2022-06-26T00:08:37Z","content":"More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an astronaut.\r\nFor most people, working in space m… [+2485 chars]"},{"source":{"id":null,"name":"Universe Today"},"author":null,"title":"Despite its draining power, NASA's InSight Mars lander is determined to squeeze as much science as it can until the very last moment - Universe Today","description":"Its solar panels are caked with dust and the batteries are running out of juice, but NASA’s InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very last beep. To conserve energy, InSight was projected to shut…","url":"https://www.universetoday.com/156454/despite-its-draining-power-nasas-insight-mars-lander-is-determined-to-squeeze-as-much-science-as-it-can-until-the-very-last-moment/","urlToImage":"https://www.universetoday.com/wp-content/uploads/2022/06/FEATURED-IMAGE-7.jpg","publishedAt":"2022-06-25T21:57:07Z","content":"Its solar panels are caked with dust and the batteries are running out of juice, but NASAs InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very l… [+3906 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"NASA thinks Voyager space probes will run out of power soon - BollyInside","description":"The NASA Voyager Mission was launched in 1977 with a five-year design lifetime. The spacecraft has travelled 14.5 billion miles from Earth since then,","url":"https://www.bollyinside.com/news/nasa-thinks-voyager-space-probes-will-run-out-of-power-soon","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/NASA-thinks-Voyager-space-probes-will-run-out-of-power.jpeg","publishedAt":"2022-06-25T20:08:37Z","content":"The NASA Voyager Mission was launched in 1977 with a five-year design lifetime. The spacecraft has travelled 14.5 billion miles from Earth since then, researching interstellar space and making numero… [+1077 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"The Andromeda Galaxy shows the wounds of a disastrous collision - BollyInside","description":"Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic","url":"https://www.bollyinside.com/news/the-andromeda-galaxy-shows-the-wounds-of-a-disastrous-collision","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/The-Andromeda-Galaxy-shows-the-wounds-of-a-disastrous-collision.jpeg","publishedAt":"2022-06-25T19:44:18Z","content":"Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic evolution.\r\nAndromeda, located 2.5 million ligh… [+1461 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"ISS Booster Engine Firing on Cygnus Freighter Comes to an Early End - BollyInside","description":"A scheduled reboost manoeuvre of the International Space Station was aborted after only 5 seconds for unknown reasons. Cargo spacecraft moored to the","url":"https://www.bollyinside.com/news/iss-booster-engine-firing-on-cygnus-freighter-comes-to-an-early-end","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/ISS-Booster-Engine-Firing-on-Cygnus-Freighter-Comes-to-an.jpeg","publishedAt":"2022-06-25T19:33:38Z","content":"A scheduled reboost manoeuvre of the International Space Station was aborted after only 5 seconds for unknown reasons.\r\nCargo spacecraft moored to the International Space Station fire their thrusters… [+2076 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":null,"title":"Climate change: a ‘space bubble’ shield can block solar radiation - BollyInside","description":"MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the sun’s rays, dubbed ‘Space","url":"https://www.bollyinside.com/news/climate-change-a-space-bubble-shield-can-block-solar-radiation","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/06/Climate-change-a-space-bubble-shield-can-block-solar-radiation.jpeg","publishedAt":"2022-06-25T19:32:44Z","content":"MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the suns rays, dubbed Space Bubbles.\r\nThis is a variation on the common geoenginee… [+3673 chars]"},{"source":{"id":null,"name":"Tech Explorist"},"author":"https://www.facebook.com/malewar.amit","title":"Tetraneutron – An Exotic State of Matter discovered - Tech Explorist","description":"It could lead to a better understanding of how the universe is put together.","url":"https://www.techexplorist.com/tetraneutron-exotic-state-of-matter-discovered/52105/","urlToImage":"https://www.techexplorist.com/wp-content/uploads/2022/06/Andrey-Shirokov.jpg","publishedAt":"2022-06-25T19:31:06Z","content":"A long-standing question in nuclear physics is whether chargeless nuclear systems can exist. Only neutron stars represent near-pure neutron systems, where neutrons are squeezed together by the gravit… [+6222 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"Emerging Super Crab The Most Post Pulsar to Be Discovered - Galaxy Reporters","description":"Astronomers have found out what might be the most effective pulsar ever identified. They assume that the newfound object, VT 1137-0337, is a pulsar wind nebula and a neutron star that stimulates nearby charged particles at close to the velocity of light. The …","url":"https://galaxyreporters.com/emerging-super-crab-the-most-post-pulsar-to-be-discovered/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2022/06/Pulsar-1.webp","publishedAt":"2022-06-25T19:14:19Z","content":"Astronomers have found out what might be the most effective pulsar ever identified.\r\nThey assume that the newfound object, VT 1137-0337, is a pulsar wind nebula and a neutron star that stimulates nea… [+1389 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"Early Sound Exposure in Womb Identified as Necessary for Auditory Development - Galaxy Reporters","description":"Model research suggests that the abnormal location in the uterus improves the brain’s ability to interpret specific types of sound. Inside the uterus, the fetuses may begin to hear some sounds at about 20 weeks of gestation. However, due to the moving effect …","url":"https://galaxyreporters.com/early-sound-exposure-in-womb-identified-as-necessary-for-auditory-development/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2022/06/shutterstock_633509993-scaled.jpg","publishedAt":"2022-06-25T19:13:58Z","content":"Model research suggests that the abnormal location in the uterus improves the brain’s ability to interpret specific types of sound.\r\nInside the uterus, the fetuses may begin to hear some sounds at ab… [+3252 chars]"},{"source":{"id":null,"name":"Newsazi.com"},"author":"Eli Pacheco","title":"How Astronomers Are Investigating This Nebula Where Stars Are Being Born - News Azi","description":"Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses under its own gravity and gets hot, b","url":"https://newsazi.com/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/","urlToImage":"https://www.slashgear.com/img/gallery/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/l-intro-1656091252.jpg","publishedAt":"2022-06-25T19:12:26Z","content":"Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses u… [+1081 chars]"},{"source":{"id":null,"name":"Galaxyreporters.com"},"author":null,"title":"Astronomers Searching for Cosmic X-Ray Signposts of Gravitational Waves - Galaxy Reporters","description":"Over the past few years, astronomers have reached a remarkable milestone: the discovery of gravitational waves, the disappearance of weak waves in space, and the timing of some of the worst events in the universe, including the collision between black holes a…","url":"https://galaxyreporters.com/astronomers-searching-for-cosmic-x-ray-signposts-of-gravitational-waves/","urlToImage":"https://galaxyreporters.com/wp-content/uploads/2022/06/gravitational-waves.png","publishedAt":"2022-06-25T19:12:12Z","content":"Over the past few years, astronomers have reached a remarkable milestone: the discovery of gravitational waves, the disappearance of weak waves in space, and the timing of some of the worst events in… [+2922 chars]"},{"source":{"id":null,"name":"Digital Trends"},"author":"Georgina Torbet","title":"See the crater left by a space junk impact on the moon - Digital Trends","description":"NASA's Lunar Reconnaissance Orbiter snapped an image showing the crater created by a Chinese rocket booster which crashed into the moon earlier this year.","url":"https://www.digitaltrends.com/space/moon-debris-impact-lro/","urlToImage":"https://www.digitaltrends.com/wp-content/uploads/2022/06/booster_0805_m1407760984r.map_.str01.enlarge3x.1100crop1.jpg?p=1","publishedAt":"2022-06-25T16:45:37Z","content":"Earlier this year, a Chinese rocket booster crashed into the lunar surface in a rare example of a piece of human-made debris colliding with the moon. Now, the site of this crash has been imaged by NA… [+2506 chars]"},{"source":{"id":null,"name":"Oup.com"},"author":null,"title":"Formation of S0s in extreme environments III: the role of environment in the formation pathways - Oxford Academic","description":null,"url":"https://academic.oup.com/HTTPHandlers/Sigma/LoginHandler.ashx?code=4NJJwk&state=749cf298-d584-41a8-9700-6651e3ab921dredirecturl%3Dhttpszazjzjacademiczwoupzwcomzjmnraszjadvancezyarticlezjdoizj10zw1093zjmnraszjstac1764zj6617996","urlToImage":null,"publishedAt":"2022-06-25T15:06:31Z","content":null},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Mars spacecraft gets Windows 98 update in 2022 to boost performance! Yes, you read it right - HT Tech","description":"Mars spacecraft from ESA is getting a Windows 98 update to boost its performance for improving its mission capabilities. Check details.","url":"https://tech.hindustantimes.com/tech/news/mars-spacecraft-gets-windows-98-update-in-2022-to-boost-performance-yes-you-read-it-right-71656167870785.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/Mars_Express_1656168025957_1656168036725.jpg","publishedAt":"2022-06-25T14:41:44Z","content":"Yes, you read that right. A spacecraft orbiting around Mars is finally getting a Windows 98 update to boost its performance. Sounds weird, right? Many of you reading this might now even know about Wi… [+2612 chars]"},{"source":{"id":null,"name":"Gadgets Now"},"author":"IANS","title":"NASA ready with Artemis 1 moon mission test launch - Gadgets Now","description":"The US space agency has determined that its Space Launch System (SLS) megarocket is ready for the Artemis 1 flight test.The agency will now roll SLS and Orion back to the Vehicle Assembly Building (VAB) at Kennedy next week to prepare the rocket and spacecraf…","url":"https://www.gadgetsnow.com/tech-news/nasa-ready-with-artemis-1-moon-mission-test-launch/articleshow/92459370.cms","urlToImage":"https://static.toiimg.com/thumb/resizemode-4,msid-92459370,imgsize-173156,width-800/92459370.jpg","publishedAt":"2022-06-25T13:41:00Z","content":"The US space agency has determined that its Space Launch System (SLS) megarocket is ready for the Artemis 1 flight test.The agency will now roll SLS and Orion back to the Vehicle Assembly Building (V… [+1809 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"Astronaut shows what happens when you wring wet cloth in space - WION","description":"Now, if we do this on Earth, the water will come out of the wash cloth and drip to the ground. But in space, where there is no gravity, something strange happens","url":"https://www.wionews.com/science/astronaut-shows-what-happens-when-you-wring-wet-cloth-in-space-491755","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274061-astronaut.jpg","publishedAt":"2022-06-25T13:11:21Z","content":"It's real fun to observe astronauts in space bouncing around in zero gravity. Though we theoretically know that space does not have gravity, actually seeing zero gravity in action is amusing nonethel… [+1171 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"NASA`s Hubble Telescope clicks crisp image of a sparkling galaxy - WION","description":"Hubble has been sending us mesmerising images for years. Another image has joined the long list. The space telescope has clicked a crisp photo of a sparkling galaxy. NASA has shared the image on Instagram and other social media feeds","url":"https://www.wionews.com/science/nasa-hubble-telescope-clicks-crisp-image-of-a-sparkling-galaxy-491728","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274032-nasa.jpg","publishedAt":"2022-06-25T12:24:23Z","content":"The night sky is a sparkle to start with. The countless stars are just there for us to unravel their mystery. But just sometimes, when we are in the mood for some dreamy stargazing, weather plays a s… [+1202 chars]"}]}