{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Tech","title":"Cannibal CME set to trigger strong Geomagnetic Storm on Earth on August 18 - HT Tech","description":"Scientists and researchers have warned that Cannibal coronal mass ejection could trigger Geomagnetic Storm on August 18.","url":"https://tech.hindustantimes.com/tech/news/cannibal-cme-set-to-trigger-strong-geomagnetic-storm-on-earth-on-august-18-71660689362444.html","urlToImage":"https://images.hindustantimes.com/tech/img/2022/08/16/1600x900/Sun_flares_NASA_1639718330016_1660689530259_1660689530259.jpg","publishedAt":"2022-08-16T22:41:25Z","content":"With the Sun at its volatile best in recent weeks, it has been erupting frequently and generating solar storms that are being hurled towards Earth. Last week, an unexpected solar storm sparked stunni… [+1839 chars]"},{"source":{"id":null,"name":"Thehansindia.com"},"author":"The Hans India","title":"Underwater snow on Earth gives clues about Europas icy shell - The Hans India","description":"Studying a bizarre underwater snow below ice shelves on Earth can help understand the ice shell...","url":"https://www.thehansindia.com/hans/young-hans/underwater-snow-on-earth-gives-clues-about-europas-icy-shell-758059","urlToImage":"https://assets.thehansindia.com/h-upload/2022/08/16/1308220-sat.jpg","publishedAt":"2022-08-16T21:26:43Z","content":"Studying a bizarre underwater snow below ice shelves on Earth can help understand the ice shell Jupiter's moon Europa, according to researchers. \r\nEuropa is a rocky world about the size of the Earth'… [+1180 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Insights into Ag-NPs-mediated pathophysiology and ultrastructural aberrations in ovarian tissues of darkling beetles | Scientific Reports - Nature.com","description":"Scientific Reports - Insights into Ag-NPs-mediated pathophysiology and ultrastructural aberrations in ovarian tissues of darkling beetles","url":"https://www.nature.com/articles/s41598-022-17712-z","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-17712-z/MediaObjects/41598_2022_17712_Fig1_HTML.png","publishedAt":"2022-08-16T19:25:45Z","content":"<li>Ema, M., Okuda, H., Gamo, M. &amp; Honda, K. A review of reproductive and developmental toxicity of silver nanoparticles in laboratory animals. Reprod. Toxicol.67, 149164. https://doi.org/10.1016… [+14761 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Mechanochemical synthesis of inverse vulcanized polymers - Nature.com","description":"Inverse vulcanization is a process that enables to convert sulfur, a by-product of the petroleum industry, into polymers. Here the authors report a synthetic method of inverse vulcanization via mechanochemical synthesis; compared to thermal routes, a broader …","url":"https://www.nature.com/articles/s41467-022-32344-7","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-022-32344-7/MediaObjects/41467_2022_32344_Fig1_HTML.png","publishedAt":"2022-08-16T18:41:32Z","content":"Synthesis and characterizations of mechanochemically synthesized inverse vulcanized polymers\r\nWe synthesized ten polymers using a ball mill, starting from different crosslinkers ranging from aromatic… [+21085 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Eric Gedenk","title":"Identifying a new, cleaner source for white light - Phys.org","description":"When early humans discovered how to harness fire, they were able to push back against the nightly darkness that enveloped them. With the invention and widespread adoption of electricity, it became easier to separate heat from light, work through the night, an…","url":"https://phys.org/news/2022-08-cleaner-source-white.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/hpc-helps-identify-new.jpg","publishedAt":"2022-08-16T18:40:05Z","content":"Upon irradiation by infrared light, adamantane-based molecular clusters with the general composition [(RT)4E5] (with R = organic group; T = C, Si, Ge, Sn; E = O, S, Se, Te, NH, CH2, ON) emit highly d… [+7893 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Zheng Xinxin","title":"Differences found in antioxidant activities of astaxanthin isomers against singlet oxygen - Phys.org","description":"Recently, researchers led by Prof. Huang Qing from Institute of Intelligent Machines, Hefei Institutes of Physical Science (HFIPS) of Chinese Academy of Sciences (CAS) suggested a new method to evaluate the antioxidant activity of astaxanthin isomers against …","url":"https://phys.org/news/2022-08-differences-antioxidant-astaxanthin-isomers-singlet.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2022/differences-found-in-a.jpg","publishedAt":"2022-08-16T18:34:02Z","content":"by Zheng Xinxin, Zhao Weiwei, Hefei Institutes of Physical Science, Chinese Academy of Sciences Recently, researchers led by Prof. Huang Qing from Institute of Intelligent Machines, Hefei Institutes … [+2982 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"Virtual Telescope's webcast to show Saturn shine bright during 'opposition' on August 17 - Republic World","description":"Saturn, which is currently undergoing its 'opposition' phase, is illuminated more than usual. Watch the planet shine at its brightest during a live webcast.","url":"https://www.republicworld.com/science/space/virtual-telescopes-webcast-to-show-saturn-shine-bright-during-opposition-on-august-17-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/f3u8qyqkpsvpny0r_1660669505.jpeg","publishedAt":"2022-08-16T18:12:00Z","content":"Ringed planet Saturn is still shining at its brightest since August 14 owing to the phenomenon called 'opposition'. During opposition, Saturn is directly opposite to the sun in its orbit, which makes… [+2015 chars]"},{"source":{"id":null,"name":"News-Medical.Net"},"author":null,"title":"Scientists turn toward artificial intelligence for unraveling cell biology - News-Medical.Net","description":"For our cells to proliferate, differentiate or migrate, the nucleus needs the help of its cytoskeleton, the scaffold surrounding the nucleus which provides cells with shape and solid structure.","url":"https://www.news-medical.net/news/20220816/Scientists-turn-toward-artificial-intelligence-for-unraveling-cell-biology.aspx","urlToImage":"https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg","publishedAt":"2022-08-16T18:07:00Z","content":"For our cells to proliferate, differentiate or migrate, the nucleus needs the help of its cytoskeleton, the scaffold surrounding the nucleus which provides cells with shape and solid structure. The d… [+4200 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":"Lisa Jennings","title":"See the Earth through the eyes of an astronaut - BollyInside","description":"The Apollo missions to the Moon gave people a whole new look at the Earth and its natural satellites. Astronaut descriptions are now a scene in print and","url":"https://www.bollyinside.com/news/see-the-earth-through-the-eyes-of-an-astronaut","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/See-the-Earth-through-the-eyes-of-an-astronaut.jpeg","publishedAt":"2022-08-16T17:44:45Z","content":"The Apollo missions to the Moon gave people a whole new look at the Earth and its natural satellites. Astronaut descriptions are now a scene in print and television screens around the world. suggesti… [+4888 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"6G radiation can increase the size of brain cells, new study shows - WION","description":"While the observation initially confused the researchers, it was concluded that although the brain cells were increased at a rapid speed, they were able to remain healthy. As a result, the scientists will be studying them further to develop “therapies in orde…","url":"https://www.wionews.com/science/6g-radiation-can-increase-the-size-of-brain-cells-new-study-shows-507534","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/08/16/288199-5.jpg","publishedAt":"2022-08-16T17:37:39Z","content":"The world has been waiting for 6G technology but according to Chinese scientists, it can end up affecting our brain cells, The terahertz band of radio waves, which are capable of boosting any smartph… [+1637 chars]"},{"source":{"id":null,"name":"NASA"},"author":null,"title":"Exoplanet Clouds: 'Jewels' of New Knowledge - NASA Exoplanet Exploration and Discovery","description":"NASA's James Webb Space Telescope will take aim at exoplanet clouds, revealing secrets of their atmospheres.","url":"https://exoplanets.nasa.gov/news/1709/exoplanet-clouds-jewels-of-new-knowledge/","urlToImage":"https://exoplanets.nasa.gov/system/news_items/list_view_images/1709_Screen_Shot_2022-08-11_at_1.02.03_PM.jpg","publishedAt":"2022-08-16T17:30:59Z","content":"Scientists explain how NASA's James Webb Space Telescope will investigate exoplanet clouds.\r\nClouds of vaporized rock, and perhaps even glittering gems, could fill the skies of some distant worlds. A… [+3402 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":"Lisa Jennings","title":"In deep space, the “remnants” of a supernova emit cosmic rays - BollyInside","description":"Some of the cosmic radiation that hits the Earth has explosive origins. Astronomers have discovered debris from supernova explosions that can emit","url":"https://www.bollyinside.com/news/in-deep-space-the-remnants-of-a-supernova-emit-cosmic-rays","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/In-deep-space-the-remnants-of-a-supernova-emit-cosmic.jpeg","publishedAt":"2022-08-16T17:20:39Z","content":"Some of the cosmic radiation that hits the Earth has explosive origins.\r\nAstronomers have discovered debris from supernova explosions that can emit high-energy particles or cosmic rays that frequentl… [+4629 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Ready for its close-up: New technology sharpens images of black holes - Science Daily","description":"Using new computational algorithms, scientists have measured a sharp ring of light predicted to originate from photons whipping around the back of a supermassive black hole.","url":"https://www.sciencedaily.com/releases/2022/08/220816120310.htm","urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","publishedAt":"2022-08-16T17:03:18Z","content":"When scientists unveiled humanity's historic first image of a black hole in 2019 -- depicting a dark core encircled by a fiery aura of material falling toward it -- they believed even richer imagery … [+3781 chars]"},{"source":{"id":null,"name":"Republic World"},"author":"Harsh Vardhan","title":"Meet Lunar Zebro, the smallest and lightest Moon rover, no bigger than a sheet of paper - Republic World","description":"The Lunar Zebro has been developed by students of Delft University of Technology. If launched successfully, Zebro will be the smallest rover sent to the Moon.","url":"https://www.republicworld.com/science/space/meet-lunar-zebro-the-smallest-and-lightest-moon-rover-no-bigger-than-a-sheet-of-paper-articleshow.html","urlToImage":"https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/61ukqfsriihorhnd_1660662804.jpeg","publishedAt":"2022-08-16T16:05:00Z","content":"A team of engineers from Europe has proposed a new rover concept that could surpass the challenges faced by traditional rovers during planetary exploration. Named Lunar Zebro, this unique rover has b… [+2051 chars]"},{"source":{"id":null,"name":"Bollyinside.com"},"author":"Lisa Jennings","title":"Technological advances promote space exploration - BollyInside","description":"Rapid advances in technology are making access to space cheaper and more accessible. Even high school students have satellites in space. But other planets","url":"https://www.bollyinside.com/news/technological-advances-promote-space-exploration","urlToImage":"https://www.bollyinside.com/wp-content/uploads/2022/08/Technological-advances-promote-space-exploration.jpeg","publishedAt":"2022-08-16T15:44:48Z","content":"Rapid advances in technology are making access to space cheaper and more accessible. Even high school students have satellites in space. But other planets are also being explored in increasingly deep… [+1905 chars]"},{"source":{"id":null,"name":"WION"},"author":"WION Web Team","title":"Chinese study shows that mice whiskers may provide insights to autism therapy - WION","description":"The results showed that mice that had their whiskers cut between days 12 and 16 of their lives had poorer social interaction at maturity, according to the scientists.","url":"https://www.wionews.com/science/chinese-study-shows-that-mice-whiskers-may-provide-insights-to-autism-therapy-507501","urlToImage":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/13/149545-7.jpg","publishedAt":"2022-08-16T15:38:16Z","content":"In a study that could help with the treatment of autism in humans, Chinese researchers discovered that mice who had their whiskers cut at a young age were more likely to develop social disorders late… [+2003 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Moneycontrol News","title":"Sun is going through a mid-life crisis. Here's how long it has before dying - Moneycontrol","description":"The European Space Agency found that the life-giving star is around 4.57 billion years old which amounts to it being in its middle age.","url":"https://www.moneycontrol.com/news/trends/sun-is-going-through-a-mid-life-crisis-heres-how-long-it-has-before-dying-9039251.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/08/Collage-Maker-16-Aug-2022-08.43-PM-770x435.jpg","publishedAt":"2022-08-16T15:16:25Z","content":"The Sun, which scientists predict to be about 4.57 billion years old, is currently going through a midlife crisis, a study has found.\r\nCurrently, the star is bursting with solar flares, coronal mass … [+1800 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"Too Big for the Door: How Engineers Installed a NASA Space Telescope Test Chamber - NASA Jet Propulsion Laboratory","description":"NASA’s upcoming SPHEREx space telescope needs a custom-built test chamber to make sure its cutting-edge instruments are ready to operate in space. The telesc...","url":"https://www.youtube.com/watch?v=9vGZSXlKDn0","urlToImage":"https://i.ytimg.com/vi/9vGZSXlKDn0/maxresdefault.jpg","publishedAt":"2022-08-16T15:07:48Z","content":null},{"source":{"id":null,"name":"IFLScience"},"author":"Stephen Luntz","title":"JWST's Biggest Image Yet Shows A Field Of Early Galaxies - IFLScience","description":"The JWST’s biggest image captures galaxies from the early universe in part of a small area of the sky already studied in depth by Hubble.","url":"https://iflscience.com/jwsts-biggest-image-yet-shows-a-field-of-early-galaxies-64906","urlToImage":"https://assets.iflscience.com/assets/articleNo/64906/aImg/61189/ceers-visualization-meta.jpeg","publishedAt":"2022-08-16T15:04:12Z","content":"An image filled with galaxies was chosen as the first to be released from JWST because it demonstrated the space telescopes capacities so well. That, however, was just a taster. With more time for li… [+3204 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Scientists Plan Multimillion-Dollar Resurrection Of Tasmanian Tiger - NDTV","description":"Scientists have taken stem cells from a living species with similar DNA and turned the into thylacine cells.","url":"https://www.ndtv.com/world-news/scientists-plan-multimillion-dollar-resurrection-of-tasmanian-tiger-3259774","urlToImage":"https://c.ndtvimg.com/2022-08/1a9qf118_thylacine-tasmanian-tiger-650_625x300_16_August_22.jpg","publishedAt":"2022-08-16T14:26:25Z","content":"Thylacine was a dog-like creature and popularly known as 'Tasmanian tiger'.\r\nScientists in Australia and the United States have launched an ambitious multimillion-dollar project to bring back thylaci… [+1856 chars]"}]}