{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kelsey Vlamis","title":"Democrats boost far-right candidates in hopes they'll be easy to beat","description":"Rep. Katie Rice said it's \"outrageous\" for Democratic groups to \"throw money at raising up a person who they know wants to tear down this democracy.\"","url":"http://www.businessinsider.com/democrats-boost-far-right-candidates-hope-be-easy-to-beat-2022-6\n                            ","urlToImage":"https://i.insider.com/629dbf5c3efa8c0019aadf5f?width=1200&format=jpeg","publishedAt":"2022-06-18T06:04:21Z","content":"Democrats are paying for ads to promote far-right candidates in the primaries, apparently with the idea they'll be easier to beat than more mainstream Republicans in the fall.\r\nOne 30-second ad in Ca… [+2367 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Katherine Tangalakis-Lippert","title":"Montana governor vacationed while Yellowstone faced historic flooding","description":"While roads and bridges in Yellowstone National Park were destroyed by historic floodwaters, Montana Gov. Greg Gianforte's office confirmed he was on vacation.","url":"http://www.businessinsider.com/montana-governor-vacationed-while-yellowstone-faced-historic-flooding-2022-6\n                            ","urlToImage":"https://i.insider.com/62ad57204245600018dd9728?width=1200&format=jpeg","publishedAt":"2022-06-18T05:52:40Z","content":"As Yellowstone National Park faced historic flooding this week which caused millions of dollars in damage and destroyed bridges and roadways, Montana Governor Greg Gianforte's office confirmed he was… [+2310 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Hannah Getahun","title":"Texas AG Ken Paxton removed from a case over healthcare for trans youth","description":"The decision comes after Paxton intervened in the case, arguing that gender-affirming healthcare for trans youth is \"child abuse.\"","url":"http://www.businessinsider.com/texas-ag-ken-paxton-removed-from-case-healthcare-trans-youth-2022-6","urlToImage":"https://i.insider.com/62ad54fbe3600d0018e7f1c6?width=1200&format=jpeg","publishedAt":"2022-06-18T04:41:06Z","content":"A judge prevented Attorney General Ken Paxton from further intervening in a case regarding healthcare for transgender youth after he attempted to reverse a court order that allowed a hospital in Texa… [+1703 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Katherine Tangalakis-Lippert, Lloyd Lee","title":"Stephen Colbert staff arrested outside Capitol, charged with illegal entry","description":"Triumph the Insult Comic Dog was at at the Capitol with a production team to record interviews for a comedy segment on behalf of \"The Late Show\" when they were detained by police.","url":"http://www.businessinsider.com/stephen-colbert-staff-arrested-outside-capitol-charged-with-illegal-entry-2022-6","urlToImage":"https://i.insider.com/62ad37414245600018dd96c7?width=1200&format=jpeg","publishedAt":"2022-06-18T03:46:29Z","content":"Actor and comedian Robert Smigel, best known for his role puppeteering Triumph the Insult Comic Dog, along with six other staffers from \"The Late Show\" with Stephen Colbert were arrested Thursday at … [+1462 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kelsey Vlamis","title":"Synagogue sues Florida for abortion law, says it violates Jewish faith","description":"The lawsuit says the Florida abortion ban violates their religious freedom because abortion is required in Jewish law to protect the mother's health.","url":"http://www.businessinsider.com/synagogue-sues-florida-abortion-law-violates-jewish-faith-2022-6","urlToImage":"https://i.insider.com/62ad4386e3600d0018e7f190?width=1200&format=jpeg","publishedAt":"2022-06-18T03:29:40Z","content":"A synagogue in Florida is suing the state over a new law that bans most abortions after 15 weeks of pregnancy, arguing it infringes upon their religious freedom and violates the Jewish faith.\r\nThe la… [+2102 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Juliana Kaplan","title":"Government will collect record-high income taxes because people got raises","description":"The Congressional Budget Office estimates income tax revenue went up by 28% in 2022. It's partially because people were getting paid more.","url":"http://www.businessinsider.com/government-collect-record-high-income-taxes-because-people-got-raises-2022-6\n                            ","urlToImage":"https://i.insider.com/62acd5a1e3600d0018e7e829?width=1200&format=jpeg","publishedAt":"2022-06-17T20:08:37Z","content":"Americans are getting paid more and those bigger paychecks are taking in more taxes.\r\nA report from the nonpartisan Congressional Budget Office estimates how tax revenue coming into the federal gover… [+2276 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Morgan McFall-Johnsen","title":"Photos, maps: extreme heat strikes 100 million in US, could last weeks","description":"A heat wave has killed at least three people and 2,000 cattle. Storms and tornadoes churned at its edges. Forecasts show it's not over yet.","url":"http://www.businessinsider.com/photos-maps-extreme-heat-could-last-weeks-2022-6","urlToImage":"https://i.insider.com/62aba5401c7744001959c732?width=1200&format=jpeg","publishedAt":"2022-06-16T23:27:20Z","content":"It's been a hot week for millions of people across the US, and it's not over yet.\r\nA heat wave has shattered daily temperature records across the Southwest, Central Plains, and Midwest this week. Mor… [+4538 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Jenna Gyimesi","title":"I quit a VP job at Amazon to work in Web3 — and I don't regret it","description":"After spending more than 15 years at companies like Amazon and IBM, Sandy Carter jumped into Web3 to build what she calls the next generation's internet.","url":"http://www.businessinsider.com/why-i-quit-amazon-for-web3-sandy-carter-crypto-nft-2022-6","urlToImage":"https://i.insider.com/629e546e7bc6a80018b68f73?width=1200&format=jpeg","publishedAt":"2022-06-16T20:02:46Z","content":"When I announced via Linkedin that I was leaving my job as a vice president at Amazon for a job in crypto, I was absolutely terrified. And announcing it was more terrifying than putting in my notice.… [+6713 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Jacob Shamsian, Ashley Collman","title":"Savannah Guthrie had conflict in interviewing Amber Heard: experts","description":"Amber Heard wanted the interview knowing the \"Today\" coanchor Savannah Guthrie's husband worked for Johnny Depp's lawyers, an NBC News executive said.","url":"https://www.insider.com/savannah-guthrie-amber-heard-interview-conflict-interest-husband-depp-lawyers-2022-6","urlToImage":"https://i.insider.com/62ab6c5c1c7744001959b41d?width=1200&format=jpeg","publishedAt":"2022-06-16T19:28:18Z","content":"Before interviewing Johnny Depp's attorneys earlier in June, the \"Today\" show coanchor Savannah Guthrie had a message for her viewers.\r\n\"A quick disclosure: My husband has done consulting work for th… [+7464 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Laila Maidan","title":"2 online hustles making $89,000 a month: Investing influencer","description":"He used YouTube tutorials to learn the three main technical skills he uses to earn an income online and build his brand.","url":"http://www.businessinsider.com/online-hustles-making-thousands-a-month-investor-content-creator-2022-6","urlToImage":"https://i.insider.com/62a9f3ddac534e00193363bc?width=1200&format=jpeg","publishedAt":"2022-06-16T09:00:00Z","content":"Charlie Chang didn't hit the ground running when it came to figuring out what he was going to do with his life. In 2010, he was premed at the University of California, Los Angeles with plans to go to… [+8359 chars]"}]}