{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Paola Rosa-Aquino","title":"NASA postpones Artemis I moon rocket launch due to fuel leak","description":"NASA scrubbed its Saturday launch after engineers detected a liquid hydrogen leak. It's the second launch attempt that's been called off this week.","url":"http://www.businessinsider.com/nasa-postpones-artemis-moon-rocket-launch-2022-9","urlToImage":"https://i.insider.com/6313785e023509001aecce23?width=1200&format=jpeg","publishedAt":"2022-09-03T15:39:51Z","content":"NASA's long overdue Artemis I moon rocket launch was postponed Saturday, after the launch team encountered fueling issues.\r\nAt 7:15 a.m. ET, a leak occurred as engineers increased the pressure on the… [+3006 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Zoe Rosenberg","title":"A day with agent Ryan Serhant, who's about to list NYC's priciest home","description":"He wakes up at 4:30 a.m. after just five hours of sleep, works from the back of a stretch Escalade, and even gets his inbox to zero every day.","url":"http://www.businessinsider.com/ryan-serhant-real-estate-agent-daily-schedule-2022-9","urlToImage":"https://i.insider.com/631246c1023509001aecbac4?width=1200&format=jpeg","publishedAt":"2022-09-03T14:11:02Z","content":"Ryan Serhant is disciplined, down to the minute. The 38-year-old, silver-haired broker has been in the real-estate game for 14 years and has transacted over $5 billion in sales. He rises daily at 4:3… [+9731 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Taylor Ardrey","title":"HBCU grad's student loans paid off by Pharrell Williams: 'Unexpected'","description":"Jamie Turner, a Norfolk State University alum, was one of the HBCU students who was selected to get their loans wiped out by music producer Pharrell Williams.","url":"https://www.insider.com/biden-hbuc-black-grads-student-loan-debt-forgiveness-pharrell-williams-2022-8","urlToImage":"https://i.insider.com/630e1e4a2d6c740018c400e0?width=1200&format=jpeg","publishedAt":"2022-09-03T13:43:45Z","content":"Jamie Turner said she feels lighter financially and emotionally. \r\nTurner graduated two years ago from Norfolk State University, located in Virginia, where she studied political science. To attend th… [+4855 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alia Shoaib","title":"Trump could be charged with crimes he said Snowden should be executed for: Napolitano","description":"Edward Snowden faces charges under the Espionage Act. The DOJ is investigating whether Trump violated it by taking federal records.","url":"http://www.businessinsider.com/trump-crimes-assange-snowden-executed-former-fox-analyst-2022-9","urlToImage":"https://i.insider.com/62f2c720cc15bf00182fa930?width=1200&format=jpeg","publishedAt":"2022-09-03T13:30:10Z","content":"According to a former Fox News analyst, former President Donald Trump could be charged with the same crimes that he suggested a National Security Agency whistleblower should be executed for.\r\n\"In a m… [+2836 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Sarah Al-Arshani","title":"Man threatens to intentionally crash a plane into Mississippi Walmart","description":"\"Citizens are asked to avoid that area until an all clear is given,\" the Tupelo Police Department said Saturday morning. Local stores are being evacuated.","url":"https://www.insider.com/man-threatens-to-intentionally-crash-a-plane-into-mississippi-walmart-2022-9","urlToImage":"https://i.insider.com/6312337d3fe7c40019e50f5c?width=1200&format=jpeg","publishedAt":"2022-09-03T12:48:45Z","content":"A pilot of plane flying over Tupelo, Mississippi, threatened to crash it into a Walmart intentionally, police said in a statement Saturday morning, according to local news outlet WTVA.\r\nIn the statem… [+839 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Matthew Loh","title":"Hong Kong expats leaving as city aligns with Beijing over Covid policy","description":"\"It feels like we're all in a boat without a skipper, and China is driving us,\" one expat told Insider.","url":"https://www.insider.com/hong-kong-expats-leave-city-aligns-with-beijing-over-covid-2022-7","urlToImage":"https://i.insider.com/62beb8dd9b16eb0018020675?width=1200&format=jpeg","publishedAt":"2022-09-03T11:40:25Z","content":"After seven years of living in Hong Kong, New York native Marty Forth finally had it. \r\nThe academic arrived in the bustling city at the southern tip of China in 2015 and fell in love with its unique… [+14660 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kali Hays, Rob Price, Tom Dotan, Lauren Johnson, Lindsay Rittenhouse, Lara O'Reilly, Lucia Moses, Riddhi Kanetkar","title":"Snap and burn: Staff stunned as Evan Spiegel cuts projects to the bone","description":"The Snap cofounder has always shunned Wall Street and taken big bets that won't pay off for years. In August, that approach suddenly changed.","url":"http://www.businessinsider.com/snap-employees-stunned-evan-spiegel-cuts-projects-to-the-bone-2022-8","urlToImage":"https://i.insider.com/6310eae13e08f700196c602e?width=1200&format=jpeg","publishedAt":"2022-09-03T11:30:00Z","content":"Earlier this summer, Snap executives told managers they should put at least 10% of their teams on performance improvement plans. Getting PIP-ed is often seen as a precursor to layoffs, but employees … [+15875 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alia Shoaib","title":"Meadows turned over new texts, emails to Archives after Mar-a-Lago raid: report","description":"The National Archives realized it did not have all of the former White House chief of staff's communications after his January 6 committee submissions.","url":"http://www.businessinsider.com/meadow-texts-emails-national-archives-mar-a-lago-raid-2022-9","urlToImage":"https://i.insider.com/618c2240596d9b001118591b?width=1200&format=jpeg","publishedAt":"2022-09-03T09:45:37Z","content":"Mark Meadows, former White House chief of staff under Donald Trump, handed over new texts and emails from his time in the administration to the National Archives within a week of the FBI's Mar-a-Lago… [+1812 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Jyoti Mann","title":"American didn't let an unaccompanied minor buy food during a layover","description":"The teenager repeatedly asked staff if he could buy food on his near-two hour layover but was told he must stay with a group of other solo travelers.","url":"http://www.businessinsider.com/american-did-not-let-unaccompanied-minor-get-food-during-layover-2022-9","urlToImage":"https://i.insider.com/62dc029921142200185ee4a4?width=1200&format=jpeg","publishedAt":"2022-09-03T09:05:41Z","content":"American Airlines did not allow a 15-year-old to buy food during a layover between flights after he asked staff for permission multiple times. \r\nThe teenager was flying unaccompanied from Jacksonvill… [+2041 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Taiyler Simone Mitchell, Meredith Cash","title":"PHOTOS: Serena Williams says goodbye with record US Open crowd","description":"A large audience gathered to see off Serena Williams, who said she'd be moving away from tennis after the Open.","url":"https://www.insider.com/photos-serena-williams-2022-us-open-crowd-queens-2022-9","urlToImage":"https://i.insider.com/6312d1d1023509001aecc912?width=1200&format=jpeg","publishedAt":"2022-09-03T05:19:04Z","content":"NEW YORK Tennis legend Serena Williams was adorned by an enormous crowd bidding her farewell during the 2022 US Open.\r\nThe 40-year-old wrapped up what is likely the last tennis tournament of her illu… [+458 chars]"}]}