{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kim Renfro","title":"'House of the Dragon' creators showed birth scene to women to see if it was too violent","description":"The former \"Game of Thrones\" director and current showrunner of HBO's new show said the unanimous answer was that it wasn't too violent.","url":"https://www.insider.com/house-of-the-dragon-birth-scene-too-violent-shown-to-women-2022-8","urlToImage":"https://i.insider.com/6302f8a4c9a2da001808faff?width=1200&format=jpeg","publishedAt":"2022-08-22T16:51:29Z","content":"The series premiere of HBO's \"House of the Dragon\" (the first of many in-the-works prequel series to make it to the screen) has an emotional climax involving a traumatic childbirth scene. The series'… [+3834 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kali Hays","title":"Elon Musk battle: Twitter threatens to pull Bot Sentinel data access","description":"Bot Sentinel has for years used Twitter's API to publicly track accounts that are potentially harmful and suspended or deactivated, included spam and bots.","url":"http://www.businessinsider.com/twitter-threatens-to-remove-tracking-tool-bot-sentinel-from-its-api-2022-8","urlToImage":"https://i.insider.com/62e4f2174b455800188b7a20?width=1200&format=jpeg","publishedAt":"2022-08-22T16:12:04Z","content":"Bot Sentinel could soon find itself unable to track potentially harmful accounts on Twitter and share findings with the public after years of doing so, as the social media platform this week decided … [+3864 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Rebecca Cohen","title":"Fauci leaving the NIH and Biden administration in December","description":"Fauci has spent decades working in public health, most recently tackling the COVID-19 pandemic alongside the Trump and Biden administrations.","url":"http://www.businessinsider.com/fauci-stepping-down-nih-biden-administration-december-2022-8","urlToImage":"https://i.insider.com/62d5700d632b5300188ac670?width=1200&format=jpeg","publishedAt":"2022-08-22T15:24:55Z","content":"Dr. Anthony Fauci announced on Monday that he plans to leave his roles in the National Institute of Health and the Biden administration in December, but insisted he is not yet retiring from his decad… [+1969 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Laura Italiano, Camila DeChalus, C. Ryan Barber","title":"Donald Trump Docket Watch — check here for civil and criminal updates","description":"Donald Trump and his business are tangled in at least a dozen significant federal and local investigations and lawsuits. Here's the latest on all of them.","url":"http://www.businessinsider.com/donald-trump-key-cases-civil-criminal-investigations-lawsuits-updates-2022-7","urlToImage":"https://i.insider.com/62e43143205f75001879ffde?width=1200&format=jpeg","publishedAt":"2022-08-22T14:20:11Z","content":"It's hard to keep track of Donald Trump's very busy legal docket. \r\nThe former president is the subject of at least three major investigations into wrongdoing relating to the election, the insurrecti… [+16368 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Robin Madell","title":"I like Airbnb better than Vrbo as a home renter — here's why","description":"Kelly Marohl thought Vrbo would be better for her property in Ocean City, Maryland, but Airbnb has helped her lock in four to six bookings per month.","url":"http://www.businessinsider.com/why-airbnb-better-vrbo-home-renter-2022-8","urlToImage":"https://i.insider.com/63038c82c2794d00197ef893?width=1200&format=jpeg","publishedAt":"2022-08-22T14:17:24Z","content":"This as-told-to essay is based on a conversation with Kelly Marohl, a 33-year-old who rents out a property in Ocean City, Maryland, on Airbnb and Vrbo. The following has been edited for length and cl… [+4047 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Meghan Morris","title":"Why mom-and-pop restaurateurs are fleeing Travis Kalanick's CloudKitchens","description":"CloudKitchens operators say the company failed to deliver the clean kitchens and high-tech perks promised to them.","url":"http://www.businessinsider.com/travis-kalanick-cloudkitchens-ghost-kitchens-restaurateurs-fleeing-2022-8","urlToImage":"https://i.insider.com/62f66c34f16a0d0018e6477c?width=1200&format=jpeg","publishedAt":"2022-08-22T13:05:37Z","content":"LaToya Wilson set aside the ingredients for her famous salmon BLTs at Crowd Pleazers Cafe, bolted across a trash-strewn parking lot, hopped in her car, and drove seven minutes. She needed to use the … [+15493 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Charlotte Walsh","title":"'The Glee Project': An oral history with the cast and crew","description":"In an oral history, producers, mentors, and cast members involved with \"The Glee Project\" explain how the \"Glee\" reality show on Oxygen came to be.","url":"https://www.insider.com/the-glee-project-behind-the-scenes-cast-interviews-oral-history-2022-8","urlToImage":"https://i.insider.com/62fe9b9bec781d001868bcf1?width=1200&format=jpeg","publishedAt":"2022-08-22T12:30:00Z","content":"Ryan Murphy makes hits. The Emmy-winning showrunner and director is behind a lot of the 2010s television landscape, including \"American Horror Story,\" \"Pose,\" \"Scream Queens,\" and of course \"Glee.\" H… [+26188 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alex Yablon","title":"Recession watch: Time to dump NBER business cycle, US economy decision","description":"The NBER's Business Cycle Dating Committee holds a huge sway over economics, politics, and policy. But it may be time to dump this outdated method.","url":"http://www.businessinsider.com/recession-watch-dump-nber-business-cycle-economic-decisions-2022-8","urlToImage":"https://i.insider.com/62fe941fec781d001868ba28?width=1200&format=jpeg","publishedAt":"2022-08-22T10:47:00Z","content":"Is the US in a recession?\r\nIt seems like a simple enough question. For several months now, the drumbeat of grim pronouncements from Wall Street and the corporate world have signaled a recession is ni… [+13223 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Mia Jankowicz","title":"Mar-a-Lago: Kushner defends Trump after speculation he tipped off FBI","description":"Jared Kushner said events like the Mar-a-Lago raid happened because Trump's enemies \"always over-pursue\" him, in his first interview since the raid.","url":"http://www.businessinsider.com/jared-kushner-speaks-mar-a-lago-raid-fbi-tipoff-speculation-2022-8","urlToImage":"https://i.insider.com/630351f0c9a2da001808fd66?width=1200&format=jpeg","publishedAt":"2022-08-22T10:43:24Z","content":"Jared Kushner spoke about the raid on Mar-a-Lago for the first time on Sunday, after widespread speculation that he could have been a mole to the FBI. \r\nSpeaking to Mark Levin, Kushner painted the FB… [+2244 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Erin Snodgrass, Azmi Haroun","title":"Vanessa Bryant trial highlights sheriff's department cover-up efforts","description":"Vanessa Bryant's trial against LA County has revealed first responders were quick to share photos of the site – and even quicker to delete them.","url":"https://www.insider.com/vanessa-bryant-trial-highlights-sheriffs-department-cover-up-efforts-2022-8","urlToImage":"https://i.insider.com/62ffff42c2794d00197ed8d3?width=1200&format=jpeg","publishedAt":"2022-08-21T12:35:00Z","content":"The eighth day of Vanessa Bryant's trial against Los Angeles County reached an emotional fever pitch on Friday as the NBA widow took the stand to deliver heart-wrenching testimony about the loss of h… [+10252 chars]"}]}