{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Nancy Luna","title":"Lunchbox lays off employees as food tech startups face downturn","description":"The 3-year-old restaurant tech startup is led by industry provocateur Nabeel Alamgir, who told Insider he let go 60 employees on his birthday.","url":"http://www.businessinsider.com/lunchbox-lays-off-employees-as-food-tech-startups-face-downturn-2022-7","urlToImage":"https://i.insider.com/62d986880c98f500195edf9a?width=1200&format=jpeg","publishedAt":"2022-07-22T00:29:43Z","content":"Lunchbox, a New York-based food-tech startup whose CEO is known for speaking against the anti-restaurant tactics of delivery apps like Grubhub and DoorDash, laid off 33% of its employees Thursday.\r\nT… [+3111 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Katherine Long","title":"Amazon's delayed delivery drone crashed again this month","description":"Regulators have questions about crashes and the drone's conformity to specifications, delaying the start of flight tests needed for federal approval.","url":"http://www.businessinsider.com/amazon-prime-air-test-flights-faa-crash-2022-7\n                            ","urlToImage":"https://i.insider.com/62d779d5bc4c770018b78057?width=1200&format=jpeg","publishedAt":"2022-07-22T00:13:00Z","content":"Amazon's goal to launch a nationwide autonomous drone delivery program is again facing roadblocks. \r\nThe company had aimed to complete 7,000 flights this year of its Prime Air autonomous delivery dro… [+5195 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Hanna Kang","title":"SCOTUS clerk class is not diverse in terms of gender, race and law schools","description":"The newest SCOTUS clerk class is nearly 70% men, the least balanced in gender since 2017. And it appears that fewer than 1 in 5 are people of color.","url":"http://www.businessinsider.com/scotus-clerks-diversity-supreme-court-2022-7\n                            ","urlToImage":"https://i.insider.com/61f189cae996470011908704?width=1200&format=jpeg","publishedAt":"2022-07-21T21:43:50Z","content":"The latest Supreme Court clerk lineup is less diverse than previous cohorts in terms of gender, race, and ethnicity and vastly lags the country as a whole, according to an official list of clerks pro… [+1943 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Grace Kay, Isobel Asher Hamilton","title":"Tesla exec faces scrutiny over special glass purchase: Report","description":"Bloomberg reported that several Tesla employees have already been terminated as a result of the purchase, which included a special kind of glass.","url":"http://www.businessinsider.com/tesla-exec-faces-scrutiny-purchase-of-special-glass-investigation-report-2022-7","urlToImage":"https://i.insider.com/62d9b8b7d0011000190fe447?width=1200&format=jpeg","publishedAt":"2022-07-21T21:29:30Z","content":"Omead Afshar, the executive in charge of Tesla's Texas factory, is being investigated by the company over the planned purchase of construction materials that were flagged as items that may have been … [+1766 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Charles R. Davis, Azmi Haroun, Camila DeChalus, Brent D. Griffiths, Sarah Gray, Jake Lahut, C. Ryan Barber, Nicole Gaudiano, Oma Seddiq, Taiyler Simone Mitchell, Kimberly Leonard, Sinéad Baker, Jake Epstein, Katherine Tangalakis-Lippert, Taylor Ardrey, Erin Snodgrass, Dhany Osman, Kelsey Vlamis, Madison Hall, Grace Panetta, Bryan Metzger, Hannah Getahun, John L. Dorman, Alexandra Ma, Katie Anthony, Lauren Steussy, Lauren Frias, Warren Rojas","title":"Live: Jan. 6 hearing will focus on Trump's actions during Capitol riot","description":"The House select committee is investigating the Capitol riot and the role Donald Trump and his allies played in trying to overturn the 2020 election.","url":"http://www.businessinsider.com/live-january-6-committee-public-hearing-trump-insurrection-2022-6","urlToImage":"https://i.insider.com/62a7c217ac534e00193319d3?width=1200&format=jpeg","publishedAt":"2022-07-21T16:11:31Z","content":null},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Emily Quiles","title":"The unusual Center SF is the hot spot to network with techies","description":"With 22 residents, the Center SF is an \"intentional\" living space, with a tea shop, yoga, and ecstatic-dance events where techies and artists mingle.","url":"http://www.businessinsider.com/the-unusual-center-sf-is-the-hot-spot-to-network-with-techies-2022-7","urlToImage":"https://i.insider.com/62d726dbf7ae650018342f63?width=1200&format=jpeg","publishedAt":"2022-07-21T16:04:53Z","content":"More than 50 people sat in a circle on the wood floor, legs crisscrossed, listening to the DJ express his intentions for the night's event, an evening of \"ecstatic\" dance.\r\n\"I have this fantastical i… [+7076 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ben Winck, Madison Hoff","title":"Gas prices are falling, but companies don't want to lower prices too much","description":"Companies are hesitant to lower prices at the pump too much even though the average price for a gallon of gas in the US is back below $4.50.","url":"http://www.businessinsider.com/gas-oil-prices-falling-inflation-relief-slow-rockets-feathers-2022-7","urlToImage":"https://i.insider.com/62d95eec0c98f500195ed0d8?width=1200&format=jpeg","publishedAt":"2022-07-21T15:00:07Z","content":"It's looking a lot like the US is past the gas-price peak. Getting back to normal levels, however, won't happen so quickly. \r\nAverage gas prices have now fallen for an entire month. The nationwide av… [+3660 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Taiyler Simone Mitchell","title":"Clarence Thomas 'will be judged for what he does as a justice': ex-clerk","description":"Thomas has called for the review of rulings granting Americans the right to birth-control access, gay relationships, and marriage equality.","url":"http://www.businessinsider.com/clarence-thomas-judged-scotus-justice-ex-clerk-2022-7","urlToImage":"https://i.insider.com/62c755a58045920019ae2096?width=1200&format=jpeg","publishedAt":"2022-07-21T01:08:27Z","content":"Justice Clarence Thomas's controversial concurring opinion in the repeal of Roe v. Wade sparked criticism about the consistency of the conservative justice, who notably does not give much away when c… [+5453 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Paola Rosa-Aquino","title":"James Webb Space Telescope finds oldest and most distant known galaxy","description":"Webb allowed astronomers to see the oldest and most distant galaxy ever spotted. Scientists believe that Webb could find even older galaxies.","url":"http://www.businessinsider.com/webb-space-telescope-found-oldest-and-most-distant-known-galaxy-2022-7","urlToImage":"https://i.insider.com/62d84ec10c98f500195eb797?width=1200&format=jpeg","publishedAt":"2022-07-20T21:40:06Z","content":"The James Webb Space Telescope, NASA's new infrared heavyweight, peered into the vast expanse and found a 13.5 billion-year-old galaxy, which researchers believe is the oldest galaxy ever detected. T… [+2041 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Marianne Guenot","title":"How to stay cool in the heat, 7 best ways according to scientists","description":"Two scientists told Insider how the body reacts in extreme heat, and what science says is the best way to cheaply cool it down.","url":"http://www.businessinsider.com/how-to-stay-cool-extreme-heat-scientists-2022-7\n                            ","urlToImage":"https://i.insider.com/62d00cd8b0ab4f001853a355?width=1200&format=jpeg","publishedAt":"2022-07-14T15:45:12Z","content":"As extreme heat waves are crossing the US and the world, Insider asked two scientists evidence-based advice on how to keep cool. We also asked them to focus on tips that don't cost much. \r\nPut your h… [+4901 chars]"}]}