{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Juliana Kaplan","title":"Gen Z has new ideas about their careers, but old guard doesn't get it","description":"Bosses insist that Gen Z should be in the office and not immediately expect meaningful careers. The youngest generation of workers doesn't agree.","url":"http://www.businessinsider.com/gen-z-new-ideas-careers-old-bosses-dont-get-it-2022-8","urlToImage":"https://i.insider.com/62a360f3ac96ba00199120c1?width=1200&format=jpeg","publishedAt":"2022-08-16T16:48:29Z","content":"There's a war simmering over work, and it's pitting boomers against Gen Z. \r\nOlder thought leaders and CEOs want Gen Z in the office, and say their expectations for work are too high. But Gen Z wants… [+2837 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Phil Rosen","title":"European energy crisis: Germany delays nuclear plant closures, WSJ says","description":"The three nuclear plants had been slated to close on December 31, but Russia's natural gas supply cuts opened the door to an extension.","url":"https://markets.businessinsider.com/news/commodities/european-energy-crisis-germany-delay-nuclear-plant-closures-gas-shortage-2022-8","urlToImage":"https://i.insider.com/62fbb583d3535b001991bfaa?width=1200&format=jpeg","publishedAt":"2022-08-16T16:18:36Z","content":"Germany is planning to postpone the closure of its final three nuclear power plants amid a worsening energy crisis, sources told the Wall Street Journal. \r\nWhile the move has yet to be confirmed by g… [+1074 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Katie Anthony","title":"Truth Social will turn over user information to the feds: fine print","description":"Users can't count on anonymity to dodge possible legal issues if they post threats online, a former prosecutor told Insider.","url":"https://www.insider.com/truth-social-turn-over-user-information-FBI-fine-print-2022-8","urlToImage":"https://i.insider.com/62fbb215c87abe0018c2b2db?width=1200&format=jpeg","publishedAt":"2022-08-16T15:42:15Z","content":"Donald Trump's Truth Social a social media platform designed to be a \"inviting, nonpartisan 'Big Tent' of ideas\" was a hotbed of outrage after FBI agents searched the former president's Mar-a-Lago ho… [+2168 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Jenny Powers","title":"Job diary: I'm a UPS driver in a 120-degree truck without A/C","description":"This summer, UPS drivers are posting photos of the 120-degree temperatures in their trucks with no A/C. One told us about getting dizzy from the heat.","url":"http://www.businessinsider.com/job-diary-ups-driver-no-ac-in-trucks-120-degrees-2022-8","urlToImage":"https://i.insider.com/62fa7ea3306b6300192ad9b4?width=1200&format=jpeg","publishedAt":"2022-08-16T15:06:31Z","content":"This as-told-to essay is based on a transcribed conversation with a longtime UPS driver. He spoke on condition of anonymity to protect his job, but his employment has been verified by Insider. The co… [+4879 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Geoff Weiss","title":"YouTubers have moved from talking about crime to trying to solve it","description":"Crowdsourced crimesolving dates back decades. But law enforcement is navigating a fresh kind of interactivity that's being pioneered on YouTube.","url":"http://www.businessinsider.com/youtubers-moving-beyond-true-crime-storytelling-actively-solving-cases-2022-8","urlToImage":"https://i.insider.com/62faa3da306b6300192ae2a3?width=1200&format=jpeg","publishedAt":"2022-08-16T13:15:07Z","content":"Kendall Rae launched a beauty vlog in college, a de facto genre at the time in which she had little actual interest. When she pivoted to true crime in 2017, where a bonafide community had yet to emer… [+6648 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Beatrice Nolan","title":"A pilot says they cleaned planes, loaded bags amid staffing issues","description":"The pilot said having to do the extra jobs was an \"extreme scenario\" and took time away from other responsibilities during preparation for take-off.","url":"http://www.businessinsider.com/travel-chaos-pilot-flight-cleaning-planes-loading-bags-staffing-issues-2022-8","urlToImage":"https://i.insider.com/62fb5fcdd3535b001991b3a4?width=1200&format=jpeg","publishedAt":"2022-08-16T10:10:17Z","content":"A pilot says they have been loading luggage and cleaning planes as airlines struggle with staffing issues this summer.\r\nThe unnamed pilot, who said they were based in a Manchester airport in the UK, … [+1858 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Sinéad Baker","title":"Trump attacks DOJ, Florida judge after saying raid anger gone too far","description":"Trump said on Monday morning that \"terrible things\" would happen if people didn't cool down. That night, he said the raid was unjustifiable.","url":"http://www.businessinsider.com/trump-attacks-doj-florida-judge-after-warning-raid-anger-2022-8","urlToImage":"https://i.insider.com/62fb5b28c87abe0018c2a71a?width=1200&format=jpeg","publishedAt":"2022-08-16T09:19:52Z","content":"Former President Donald Trump attacked the Department of Justice and the Florida judge who approved the FBI raid of his Florida home, hours after he said that anger over the raid had gone too far.\r\nT… [+1540 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Constantine Atlamazoglou","title":"Poland is buying South Korean jets to replace aging Soviet fighters","description":"A $14.5 billion deal with South Korea will help Poland replace its Soviet-era jets, which \"are obsolete already,\" Poland's defense minister says.","url":"http://www.businessinsider.com/poland-buys-south-korean-jets-to-replace-aging-soviet-fighters-2022-8","urlToImage":"https://i.insider.com/62fa8a4f306b6300192adc28?width=1200&format=jpeg","publishedAt":"2022-08-15T22:43:50Z","content":"On July 27, Poland signed one of its largest arms deals ever for more artillery, tanks, and aircraft to modernize its military amid heightened tensions in Europe.\r\nWarsaw's $14.5 billion deal with So… [+5047 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kali Hays","title":"Elon Musk wins a round in Twitter case with documents ordered","description":"Twitter will have to produce documents from its former general manager as Musk's lawyers demand new information on data.","url":"http://www.businessinsider.com/elon-musk-wins-a-round-in-twitter-case-with-documents-ordered-2022-8","urlToImage":"https://i.insider.com/62fab6ef306b6300192ae9a4?width=1200&format=jpeg","publishedAt":"2022-08-15T22:08:00Z","content":"Elon Musk will receive some of the extra information he's demanded from Twitter in its lawsuit against him, and he's trying for even more, Insider has learned.\r\nJudge Kathleen St. Jude McCormick on M… [+3679 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Anna Silman","title":"The leaked novel scandalizing the elite Fire Island town of Saltaire","description":"Since a draft of Emma Rosenblum's novel \"Bad Summer People\" leaked, the vacation town of Saltaire has turned into a frenzy of gossip and speculation.","url":"http://www.businessinsider.com/emma-rosenblum-novel-bad-summer-people-scandalizing-saltaire-fire-island","urlToImage":"https://i.insider.com/62fa734e306b6300192ad7f0?width=1200&format=jpeg","publishedAt":"2022-08-15T17:21:01Z","content":"Two of the most beloved pastimes in the sleepy vacation hamlet of Saltaire, Fire Island, are tennis and gossip, and the mixed-doubles final at the Saltaire Yacht Club on the first Sunday in August wa… [+10230 chars]"}]}