{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Isabella Zavarise","title":"what is peecycling: human urine has nutrients crops need to thrive","description":"The need to find alternative sources for fertilizer have become urgent as chemical fertilizer shortages from the Ukrainian war threaten countries globally.","url":"http://www.businessinsider.com/what-is-peecycling-human-urine-nutrients-crops-need-to-thrive-2022-6","urlToImage":"https://i.insider.com/62afcfdfe3600d0018e8003d?width=1200&format=jpeg","publishedAt":"2022-06-20T03:48:53Z","content":"Researchers say human urine or peecycling could be a liquid gold alternative to chemical fertilizers.\r\nFabien Esculier, a researcher at the OCAPI research program in France, told Euro News that urine… [+2233 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kelsey Vlamis","title":"Trump: 'Foolish' decision for GOP to not be part of January 6 panel","description":"Trump said it was a bad call for Republicans \"not to have representation on that committee\" but denounced a bipartisan commission last year, calling it a \"Democrat trap.\"","url":"http://www.businessinsider.com/trump-foolish-decision-gop-not-be-on-january-6-panel-2022-6","urlToImage":"https://i.insider.com/62afbc734245600018dda529?width=1200&format=jpeg","publishedAt":"2022-06-20T01:11:15Z","content":"Former President Donald Trump said last week it was a mistake for Republicans to not be more involved in the committee investigating January 6.\r\n\"Unfortunately, a bad decision was made,\" Trump said i… [+2640 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Isabella Zavarise","title":"Boebert criticized Biden infrastructure bill but wants money for bridge","description":"On Monday, Boebert sent a letter to US Secretary of Transportation Pete Buttigieg strongly supporting the South Bridge Project in Glenwood Springs, Colorado.","url":"http://www.businessinsider.com/boebert-criticized-biden-infrastructure-bill-wants-millions-to-rebuild-bridge-2022-6","urlToImage":"https://i.insider.com/62afae5c4245600018dda4ef?width=1200&format=jpeg","publishedAt":"2022-06-19T23:45:40Z","content":"Rep. Lauren Boebert is asking for $33.1 million in federal funding for a transportation project after voting against Biden's infrastructure bill, calling it \"wasteful\" and \"garbage.\"\r\nOn Monday, Boeb… [+1436 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kelsey Vlamis","title":"January 6 panel has proof of Trump role in fake electors plot: Schiff","description":"Schiff said the evidence shows Trump's involvement in the failed effort to overturn the election with pro-Trump electors in states won by Biden.","url":"http://www.businessinsider.com/january-6-panel-evidence-trump-role-fake-electors-plot-schiff-2022-6\n                            ","urlToImage":"https://i.insider.com/62afacc84245600018dda4da?width=1200&format=jpeg","publishedAt":"2022-06-19T23:22:35Z","content":"Rep. Adam Schiff said Sunday the House committee investigating the Capitol riot will reveal evidence that former President Donald Trump was involved in a failed effort to overturn the election by app… [+1590 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kelsey Vlamis","title":"Schiff: Justice Clarence Thomas shouldn't work on January 6 cases","description":"Schiff said Justice Thomas should \"avoid even the appearance of impropriety\" as Ginni Thomas faces scrutiny over efforts to overturn the election.","url":"http://www.businessinsider.com/schiff-justice-clarence-thomas-shouldnt-work-on-january-6-cases-2022-6","urlToImage":"https://i.insider.com/62afa0bbe3600d0018e7ffbf?width=1200&format=jpeg","publishedAt":"2022-06-19T23:02:05Z","content":"Democratic Rep. Adam Schiff said on Sunday Supreme Court Justice Clarence Thomas should not be involved in any cases related to January 6 or the House select committee's investigation in order to avo… [+1734 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Hannah Getahun","title":"Autistic assemblymember running for Congress says disabled people are \"invisible by exclusion\"","description":"\"While it's an amazing thing, I think that what's more important is that there are people understanding that it's also a really lonely thing,\" Assemblymember Yuh-Line Niou told Insider.","url":"http://www.businessinsider.com/autistic-assemblymember-running-for-congress-disabled-people-invisible-by-exclusion-2022-6","urlToImage":"https://i.insider.com/62ad42bf4245600018dd96ed?width=1200&format=jpeg","publishedAt":"2022-06-19T13:07:00Z","content":"The halls of Congress have yet to see an openly autistic legislator, but New York Assemblymember Yuh-Line Niou could change that. \r\nNiou, who was diagnosed with autism at 22, said she was \"surprised\"… [+3011 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Hannah Getahun","title":"Uvalde classroom doors may not have been locked, report says","description":"A law enforcement source told the San Antonio Express-News that police may not have tried to see if the doors were unlocked.","url":"https://www.insider.com/uvalde-classroom-doors-may-not-have-been-locked-report-says-2022-6\n                            ","urlToImage":"https://i.insider.com/62aeb5de4245600018dd9e02?width=1200&format=jpeg","publishedAt":"2022-06-19T07:01:28Z","content":"Uvalde police didn't check to see if the door to the two connected classrooms the Robb Elementary shooter barricaded himself in with children was unlocked, a source close to the investigation told th… [+2480 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Isabella Zavarise","title":"A Louisiana woman was ordered to pay her rapist child support","description":"On top of child support payments, Crysta Abelseth was also ordered to relinquish custody of her teenage daughter by Judge Jeffrey C. Cashe with the Tangipahoa Parish Courthouse.","url":"http://www.businessinsider.com/louisiana-woman-was-ordered-to-pay-her-rapist-child-support-2022-6","urlToImage":"https://i.insider.com/62aea9b44245600018dd9dd5?width=1200&format=jpeg","publishedAt":"2022-06-19T06:57:46Z","content":"A sheriff's department in Louisiana said it \"dropped the ball\" in a case where a woman was ordered to pay her accused rapist child support.\r\nOn top of child support payments, Crysta Abelseth was also… [+2380 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kelsey Vlamis","title":"Drag queen calls Kari Lake 'hypocrite' over comments on drag and kids","description":"Arizona drag queen Barbra Seville posted photos with Lake and said he performed in front of Lake's daughter when she was around 9 or 10.","url":"http://www.businessinsider.com/drag-queen-calls-kari-lake-hypocrite-over-comments-drag-kids-2022-6","urlToImage":"https://i.insider.com/62aea3d34245600018dd9db3?width=1200&format=jpeg","publishedAt":"2022-06-19T05:00:05Z","content":"A popular Phoenix drag queen called out Kari Lake, the Trump-endorsed Republican candidate for governor in Arizona, over her comments about drag queens.\r\nRichard Stevens, who has performed as drag qu… [+2901 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Bethany Dawson","title":"VIDEO: US Harpoon missiles destroy a heavily-armed Russian vessel in Black Sea","description":"Ukraine's military said they have destroyed a heavily-armed Russian tug boat on the Black Sea using a Harpoon missile supplied by the US.","url":"http://www.businessinsider.com/video-us-harpoon-missiles-destroy-a-heavily-armed-russian-vessel-in-black-sea-2022-6\n                            ","urlToImage":"https://i.insider.com/62ae04464245600018dd9b9d?width=1200&format=jpeg","publishedAt":"2022-06-18T17:52:29Z","content":"Ukrainian military officials have said they struck the Russian Navy's Vasiliy Bekh tugboat in the Black Sea using two Harpoon missiles supplied by the US. \r\nThe action marks the first time Ukraine ha… [+1761 chars]"}]}