{"status":"ok","totalResults":10,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ayomikun Adekaiyero","title":"'Jurassic World: Dominion' stars react to negative reviews of movie","description":"DeWanda Wise and Bryce Dallas Howard said they are thrilled audiences will get to see the \"movie that we made\" as extended edition is released on DVD.","url":"https://www.insider.com/jurassic-world-dominion-bryce-dallas-howard-dewanda-wise-negative-reviews-2022-8","urlToImage":"https://i.insider.com/62fb69e2d3535b001991b483?width=1200&format=jpeg","publishedAt":"2022-08-16T10:26:16Z","content":"\"Jurassic World: Dominion\" stars Bryce Dallas Howard and DeWanda Wise are speaking out about the negative reaction to the latest movie in the \"Jurassic Park\" franchise in an exclusive interview with … [+3032 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Tom Porter","title":"Trump keeps changing story on FBI search, like Jan. 6, Kinzinger says","description":"The Jan. 6 committee member highlighted Donald Trump's changing claims over the FBI search at Mar-a-Lago.","url":"http://www.businessinsider.com/trump-changing-story-on-fbi-search-like-jan-6-kinzinger-2022-8","urlToImage":"https://i.insider.com/62fb62f2d3535b001991b3f6?width=1200&format=jpeg","publishedAt":"2022-08-16T10:12:28Z","content":"Rep. Adam Kinzinger said that Trump's changing claims around the FBI search of his Mar-a-Lago property mirror the way his account of the Jan. 6 Capitol riot shifted over time and shows that he is not… [+2227 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Cheryl Teh","title":"Eric Trump says the Trumps have surveillance tapes of Mar-a-Lago raid","description":"The former president's son told Sean Hannity that the Trump family \"absolutely\" has the surveillance footage and would release it \"at the right time.\"","url":"http://www.businessinsider.com/eric-trump-trumps-have-surveillance-tapes-mar-a-lago-raid-2022-8","urlToImage":"https://i.insider.com/62fb19fef16a0d0018e6a396?width=1200&format=jpeg","publishedAt":"2022-08-16T04:47:34Z","content":"Eric Trump says his family has the footage of the FBI's search of Mar-a-Lago and is planning to release it \"at the right time.\" \r\nTrump the son of former president Donald Trump was asked by Fox News … [+1690 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Cheryl Teh","title":"ASAP Rocky faces felony firearm charges over 2021 altercation","description":"The rapper was accused of pulling a semiautomatic handgun out and firing multiple shots at A$AP Relli, a former associate.","url":"https://www.insider.com/asap-rocky-faces-felony-firearm-charges-over-2021-altercation-2022-8","urlToImage":"https://i.insider.com/62fb045d306b6300192aee96?width=1200&format=jpeg","publishedAt":"2022-08-16T03:13:01Z","content":"Rapper A$AP Rocky was charged with two firearm-related felonies on Monday over an altercation in Hollywood in November. \r\nThe rapper, whose real name is Rakim Mayers, was charged with two counts of a… [+1553 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Azmi Haroun","title":"LA cop with Kobe crash pics said 'curiosity got the best of us'","description":"Several key Los Angeles Sheriff's Deputies testified on Monday in the fourth day of Vanessa Bryant's trial against LA County for crash site photos of Kobe and Gigi Bryant.","url":"https://www.insider.com/la-cop-kobe-crash-pics-curiosity-got-best-of-us-2022-8","urlToImage":"https://i.insider.com/62fae36b306b6300192aed14?width=1200&format=jpeg","publishedAt":"2022-08-16T00:55:55Z","content":"A Federal courtroom in downtown Los Angeles got an inside look as to why one Los Angeles Sheriff's Deputy waited four days to delete gruesome crash site photos from the helicopter crash that killed K… [+4482 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kali Hays","title":"Elon Musk wins a round in Twitter case with documents ordered","description":"Twitter will have to produce documents from its former general manager as Musk's lawyers demand new information on data.","url":"http://www.businessinsider.com/elon-musk-wins-a-round-in-twitter-case-with-documents-ordered-2022-8","urlToImage":"https://i.insider.com/62fab6ef306b6300192ae9a4?width=1200&format=jpeg","publishedAt":"2022-08-15T22:08:00Z","content":"Elon Musk will receive some of the extra information he's demanded from Twitter in its lawsuit against him, and he's trying for even more, Insider has learned.\r\nJudge Kathleen St. Jude McCormick on M… [+3679 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Charles R. Davis","title":"Afghanistan: What women's rights under the Taliban looks like now","description":"Yalda Royan fled Afghanistan after the Taliban stormed Kabul. In an interview, she accused the international community of ignoring their crimes.","url":"http://www.businessinsider.com/afghanistan-what-womens-rights-under-the-taliban-looks-like-now-2022-8","urlToImage":"https://i.insider.com/62fa83baf16a0d0018e69008?width=1200&format=jpeg","publishedAt":"2022-08-15T19:52:25Z","content":"A year ago, Yalda Royan lost everything: \"my country, my home, my job, my people,\" she told Insider.\r\nA women's rights activist, she was living in Kabul with her two daughters when Taliban militants … [+14864 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Jason Lalljee, Madison Hoff","title":"Restaurants might be a cheaper option than groceries with inflation","description":"The inflationary gap between restaurants and grocery stores hasn't been this large since the 1970s. Restaurant chains say that coupon cutting is up.","url":"http://www.businessinsider.com/restaurants-groceries-inflation-gas-prices-mcdonalds-chipotle-wendys-burger-king-2022-8","urlToImage":"https://i.insider.com/62fa945c306b6300192adeb6?width=1200&format=jpeg","publishedAt":"2022-08-15T18:57:35Z","content":"The conventional wisdom is that avoiding take out saves you money but with inflation raging, the easier dining option can also be the cheaper one. \r\nThat's because consumer prices are increasing at g… [+3241 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Eugene Kim","title":"Leaked email shows big reorg of Amazon's physical stores, Whole Foods","description":"The move marks the first major personal stamp SVP Tony Hoggett has put on his organization, which now reports to Amazon's retail CEO Doug Herrington.","url":"http://www.businessinsider.com/leaked-email-shows-reorganization-amazon-physical-stores-whole-foods-aws-2022-8","urlToImage":"https://i.insider.com/62fa8796f16a0d0018e69099?width=1200&format=jpeg","publishedAt":"2022-08-15T18:22:48Z","content":"Amazon's physical stores business, including Fresh grocery and Whole Foods Market, is undergoing a major reorganization to streamline operations under a new leader who joined earlier this year.\r\nTony… [+4103 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Anna Silman","title":"The leaked novel scandalizing the elite Fire Island town of Saltaire","description":"Since a draft of Emma Rosenblum's novel \"Bad Summer People\" leaked, the vacation town of Saltaire has turned into a frenzy of gossip and speculation.","url":"http://www.businessinsider.com/emma-rosenblum-novel-bad-summer-people-scandalizing-saltaire-fire-island","urlToImage":"https://i.insider.com/62fa734e306b6300192ad7f0?width=1200&format=jpeg","publishedAt":"2022-08-15T17:21:01Z","content":"Two of the most beloved pastimes in the sleepy vacation hamlet of Saltaire, Fire Island, are tennis and gossip, and the mixed-doubles final at the Saltaire Yacht Club on the first Sunday in August wa… [+10230 chars]"}]}