{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Amanpour: I've covered repressive regimes but I've never seen this - CNN Video","description":"CNN Chief International Anchor Christiane Amanpour tells CNN's Jim Sciutto and Clarissa Ward about the reaction from world leaders to the US Supreme Court's decision to overturn Roe v. Wade.","url":"http://us.cnn.com/videos/world/2022/06/30/amanpour-roe-v-wade-world-leaders-reaction-intl-nr-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220630144937-amanpour-roe-v-wade-reax-super-tease.jpg","publishedAt":"2022-07-01T01:37:22.8321278Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed, CNN","title":"Takeaways from the blockbuster victories conservatives secured at the Supreme Court","description":"In decisions handed down in recent weeks, the conservative Supreme Court transformed the legal landscape around an assortment of hot-button issues, including abortion, gun rights, immigration and religious liberty.","url":"http://us.cnn.com/2022/06/30/politics/takeaways-supreme-court-term-round-up-conservative-victories/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/211201160248-09-supreme-court-abortion-1201-super-tease.jpg","publishedAt":"2022-06-30T23:02:24Z","content":"(CNN)In decisions handed down in recent weeks, the conservative Supreme Court transformed the legal landscape around an assortment of hot-button issues, including abortion, gun rights, immigration an… [+10526 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Victoria Nourse","title":"Opinion: Why codifying Roe will land right back at the Supreme Court","description":"Victoria Nourse writes that if Democrats gain enough votes to pass a bill establishing a national right to choose abortion along the lines of the Roe v. Wade decision, it could well be challenged and overturned by the Supreme Court. They would have to careful…","url":"http://us.cnn.com/2022/06/30/opinions/codifying-roe-scotus-abortion-nourse/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220630121627-abortion-doctor-skills-super-tease.jpg","publishedAt":"2022-06-30T22:32:11Z","content":"Victoria Nourse, a professor at Georgetown Law Center, formerly served as chief counsel to then-Vice President Joe Biden, as an appellate lawyer in the Justice Department and as special counsel to th… [+8357 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Ex-Trump official describes conversation with Hutchinson after bombshell testimony - CNN Video","description":"Alyssa Farah Griffin, Trump's former White House director of strategic communications, discusses how Cassidy Hutchinson is doing following her bombshell testimony to the Jan. 6 committee.","url":"http://us.cnn.com/videos/politics/2022/06/30/alyssa-farah-griffin-friend-hutchinson-sot-jan-6-newday-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220630073629-alyssa-farah-griffin-super-tease.jpg","publishedAt":"2022-06-30T19:37:33.5760564Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Kasie Hunt, Ryan Nobles and Zachary Cohen, CNN","title":"Hutchinson was 1 of the witnesses Trump world sought to influence","description":"Cassidy Hutchinson, a former Trump White House aide, told the House January 6 committee that she was contacted by someone attempting to influence her testimony, three sources familiar with the hearing presentation told CNN.","url":"http://us.cnn.com/2022/06/30/politics/january-6-committee-witnesses-trump-world/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220628183506-32-jan-6-hearing-0628-super-tease.jpg","publishedAt":"2022-06-30T18:45:05Z","content":"(CNN)Cassidy Hutchinson, a former Trump White House aide, told the House January 6 committee that she was contacted by someone attempting to influence her testimony, three sources familiar with the h… [+4057 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ella Nilsen, CNN","title":"How the Supreme Court ruling will gut the EPA's ability to fight the climate crisis","description":"Experts tell CNN the EPA ruling is a major setback in the country's effort to rein in the climate crisis and its deadly, costly impacts.","url":"http://us.cnn.com/2022/06/30/politics/epa-supreme-court-ruling-effect/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210604085254-restricted-us-climate-crisis-emissions-super-tease.jpg","publishedAt":"2022-06-30T18:29:56Z","content":"(CNN)The Supreme Court on Thursday dealt a major blow to climate action by handcuffing the Environmental Protection Agency's ability to regulate planet-warming emissions from the country's power plan… [+9612 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Rebekah Riess, Jennifer Henderson and Holly Yan, CNN","title":"After 43 days on the run, the woman accused of killing an elite cyclist was captured in Costa Rica","description":"Armstrong was wanted for the May 11 shooting of Anna Moriah \"Mo\" Wilson, who had previously dated Armstrong's boyfriend. Investigators say the killing may have been a violent act of romantic jealousy.","url":"http://www.cnn.com/2022/06/30/us/kaitlin-armstrong-captured-costa-rica-anna-moriah-wilson/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220522232137-kaitlin-armstrong-wanted-super-tease.jpg","publishedAt":"2022-06-30T17:15:03Z","content":"(CNN)The woman suspected of fatally shooting elite cyclist Anna Moriah \"Mo\" Wilson in Texas has been captured in Costa Rica, the US Marshals Office said Thursday.\r\nKaitlin Marie Armstrong, 34, was fo… [+4523 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ariel Edwards-Levy, CNN","title":"Polls find majority of Americans say country is heading in wrong direction","description":"The vast majority of Americans across party lines are unhappy with the state of the US, a new set of polling finds.","url":"http://www.cnn.com/2022/06/30/politics/polls-us-wrong-direction/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220630075525-01-biden-nato-meeting-0629-super-tease.jpg","publishedAt":"2022-06-30T16:25:18Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Ariane de Vogue, CNN","title":"Supreme Court tells lower courts to reconsider disputes on abortion and guns after blockbuster decisions","description":"The Supreme Court on Thursday sent three abortion-related cases back down to lower courts to be reconsidered now that the court has overturned Roe v. Wade, ending constitutional protections to obtain an abortion.","url":"http://us.cnn.com/2022/06/30/politics/abortion-second-amendment-supreme-court/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220627115641-anti-abortion-protest-scotus-file-062522-super-tease.jpg","publishedAt":"2022-06-30T15:56:45Z","content":"(CNN)The Supreme Court on Thursday sent three abortion-related cases back down to lower courts to be reconsidered now that the court has overturned Roe v. Wade, ending constitutional protections to o… [+1889 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/simone-mccarthy\">Simone McCarthy</a>, <a href=\"/profiles/helen-regan\">Helen Regan</a>, Jeevan Ravindran, Hafsa Khalil, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, CNN","title":"Live updates: Russia's war in Ukraine","description":"NATO formally invited Finland and Sweden to join the military alliance during a summit in Madrid. Russian President Vladimir Putin said Moscow was not bothered by the move, but it would bring inevitable \"tensions.\" Follow live updates here.","url":"https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-30-22/h_b6463ca1994c6c64da9300a9fdac1e29","urlToImage":"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1d3795f0-5411-4792-bd99-19318d0b42c3.png","publishedAt":"2022-06-30T06:03:51Z","content":"NATO Secretary General Jens Stoltenberg told CNN that Russian President Vladimir Putin has underestimated both Ukraines resistance and the unity of the NATO military alliance. \r\nHe [Putin] has made a… [+2024 chars]"}]}