{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/kathleen-magramo\">Kathleen Magramo</a>, Amy Woodyatt and Hafsa Khalil, CNN","title":"Live updates: Russia's war in Ukraine","description":"A joint statement from the European Union and 42 countries including the United States has called on Russia to immediately withdraw its forces from the Zaporizhzhia Nuclear Power Plant in southern Ukraine. Follow here for the latest from Ukraine.","url":"https://www.cnn.com/europe/live-news/russia-ukraine-war-news-08-15-22/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814052530-08-kramatorsk-ukraine-robertson-intl-super-tease.jpeg","publishedAt":"2022-08-15T07:44:10Z","content":"Ukrainian officials have said that Russia's presence in the southern Kherson region and parts of Zaporizhzhia is becoming more tenuous as supply lines are targeted daily by Ukrainian long-range syste… [+2697 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Republicans pressure Garland as intrigue deepens over search of Trump home","description":"The FBI's stunning search of ex-President Donald Trump's home triggered a legal and political earthquake whose aftershocks are only widening a week on, with key questions that will shape the nation's future still clouded in mystery.","url":"http://us.cnn.com/2022/08/15/politics/republicans-garland-trump-home-search-analysis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814203055-mar-a-lago-search-trump-republicans-garland-super-tease.jpg","publishedAt":"2022-08-15T04:44:17Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Scottie Andrew and Chloe Melas, CNN","title":"Anne Heche, 'Wag the Dog' and 'Donnie Brasco' star, taken off life support","description":"Anne Heche, an entrancing actor whose versatility powered an admirable career in television and film spanning four decades, is no longer on life support.","url":"http://us.cnn.com/2022/08/14/entertainment/anne-heche-taken-off-life-support/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812150233-01-anne-heche-lead-image-super-tease.jpg","publishedAt":"2022-08-15T03:27:04Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Phil Mudd says he's seeing a repeat of run-up to January 6 - CNN Video","description":"Phil Mudd, who has worked for both the FBI and the CIA, says the rhetoric and threats against FBI agents and Department of Justice officials in the wake of the Mar-a-Lago search reminds him of what he saw leading up to the January 6 insurrection.","url":"http://us.cnn.com/videos/politics/2022/08/14/phil-mudd-fbi-threats-mar-a-lago-run-up-january-6-nr-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814191435-phil-mudd-screengrab-august-14-2022-super-tease.jpg","publishedAt":"2022-08-14T23:52:25.1907392Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Kevin Liptak, CNN","title":"Mar-a-Lago -- and its owner -- have long caused concerns for US intelligence","description":"Revealing an airstrike over \"beautiful\" chocolate cake. A trespasser from China carrying flash drives and electronics. Cellphone photos of the \"nuclear football\" briefcase. And now, classified documents recovered during an FBI search.","url":"http://us.cnn.com/2022/08/14/politics/trump-documents-mar-a-lago/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814133505-trump-documents-mar-a-lago-super-tease.jpg","publishedAt":"2022-08-14T19:38:31Z","content":"Washington (CNN)Revealing an airstrike over \"beautiful\" chocolate cake. A trespasser from China carrying flash drives and electronics. Cellphone photos of the \"nuclear football\" briefcase. And now, c… [+10414 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Daniel Dale, CNN","title":"Analysis: Responding to FBI search, Trump and allies return to his familiar strategy: flood the zone with nonsense","description":"In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strategy for communicating in a crisis: say a whole bunch of nonsense in rapid suc…","url":"http://us.cnn.com/2022/08/13/politics/fact-check-trump-fbi-search-false-misleading-conspiracy-theories/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811132025-05-trump-leaving-trump-tower-081022-super-tease.jpg","publishedAt":"2022-08-14T16:24:45Z","content":"Washington (CNN)In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strate… [+5738 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Richard Galant, CNN","title":"Opinion: Trumpism's unlikely home base","description":"Mar-a-Lago's original owner Marjorie Merriweather Post donated it to the US government as a retreat for presidents and visiting world leaders. Donald Trump buying it and opening a private membership club was not what she had in mind, but in 2017 it became the…","url":"http://us.cnn.com/2022/08/14/opinions/trumpism-home-base-mar-a-lago-column-galant/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812193133-mar-a-lago-file-081022-super-tease.jpg","publishedAt":"2022-08-14T12:42:32Z","content":"Sign up to get this weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)At the age of 27, Marjorie Merriweather P… [+13422 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by John Harwood, CNN","title":"Analysis: The same Joe Biden suddenly looks different","description":"Joe Biden is no more or less capable a president than he was two months ago. His staff is no more or less competent.","url":"http://us.cnn.com/2022/08/14/politics/president-biden-winning-streak/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220805145134-05-biden-covid-fraud-bills-080522-super-tease.jpg","publishedAt":"2022-08-14T12:36:41Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Josh Campbell, Jessica Schneider, Donie O'Sullivan, Paul P. Murphy and Priscilla Alvarez, CNN","title":"FBI investigating 'unprecedented' number of threats against bureau in wake of Mar-a-Lago search","description":"The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of Donald Trump's Mar-a-Lago resort, including against agents listed in court records as being involved in the search, a law enforcem…","url":"http://us.cnn.com/2022/08/12/politics/fbi-threats-maralago-trump-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812183806-fbi-0812-super-tease.jpg","publishedAt":"2022-08-13T15:18:28Z","content":"(CNN)The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of former President Donald Trump's Mar-a-Lago resort, including some… [+6180 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Holmes Lybrand, Marshall Cohen, Hannah Rabinowitz","title":"Timeline: The Justice Department criminal inquiry into Trump taking classified documents to Mar-a-Lago","description":"The federal criminal investigation into former President Donald Trump's potential mishandling of classified documents ramped up this week in significant and unprecedented fashion, with the FBI executing a search warrant at Trump's home at his Mar-a-Lago resor…","url":"http://us.cnn.com/2022/08/09/politics/doj-investigation-trump-documents-timeline/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220809125524-trump-fbi-investigation-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-09T21:39:12Z","content":"The federal criminal investigation into former President Donald Trumps potential mishandling of classified documents ramped up this week in significant and unprecedented fashion, with the FBI executi… [+6425 chars]"}]}