{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"CNN","title":"The big numbers from the Mar-a-Lago search","description":"The Justice Department inquiry into former President Donald Trump’s potential mishandling of classified documents is heating up, with new court filings revealing extraordinary details about the sensitive files Trump took from the White House to Mar-a-Lago.","url":"https://www.cnn.com/interactive/2022/09/politics/mar-a-lago-documents-numbers/","urlToImage":"https://cdn.cnn.com/cnn/interactive/2022/09/politics/mar-a-lago-documents-numbers/media/trump-numbers-top.jpg","publishedAt":"2022-09-01T12:00:00Z","content":"Washington (CNN) The Justice Department inquiry into former President Donald Trumps potential mishandling of classified documents is heating up, with new court filings revealing extraordinary details… [+963 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Uliana Pavlova,, Olga Voitovych, Sarah Dean, Hannah Ritchie and Tara John, CNN","title":"IAEA inspectors arrive at Zaporizhzhia nuclear plant amid shelling","description":"An international team of nuclear experts arrived at the Russian-occupied Zaporizhzhia nuclear power plant on Thursday, according to Ukraine's nuclear operator Energoatom, following an hours-long delay, and a drive through treacherous conditions as they travel…","url":"http://us.cnn.com/2022/09/01/europe/ukraine-zaporizhzhia-iaea-inspectors-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901101310-01-zaporizhzhia-iaea-super-tease.jpeg","publishedAt":"2022-09-01T11:52:03Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Daniel Dale, CNN","title":"Fact check: Trump's false and uncorroborated claims in response to the FBI search","description":"Former President Donald Trump and his representatives have offered up a dizzying flurry of defenses in the wake of the FBI search of his Mar-a-Lago resort and residence in early August -- and some of their claims are false, uncorroborated or sharply disputed.","url":"http://us.cnn.com/2022/09/01/politics/fact-check-trump-claims-fbi-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831165442-01-donald-trump-court-filing-super-tease.jpg","publishedAt":"2022-09-01T10:08:47Z","content":"Washington (CNN)Former President Donald Trump and his representatives have offered up a dizzying flurry of defenses in the wake of the FBI search of his Mar-a-Lago resort and residence in early Augus… [+9882 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Geoff Duncan","title":"Opinion: To win, GOP candidates have to move out of Trump's shadow","description":"Georgia Lieutenant Governor Geoff Duncan writes that the political environment has taken an unexpected turn for Republicans ahead of the midterm elections in November. He says Trump's recent political woes are one of the driving factors.","url":"http://us.cnn.com/2022/09/01/opinions/gop-candidates-midterm-elections-duncan/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831015309-trump-0831-super-tease.jpg","publishedAt":"2022-09-01T09:36:21Z","content":"Geoff Duncan, a Republican, is the 12th lieutenant governor of Georgia serving alongside Gov. Brian Kemp. The views expressed in this commentary are his own. Read more opinion on CNN.\r\n (CNN)Just as … [+5818 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed, CNN","title":"What to watch for at Thursday's hearing over documents seized at Mar-a-Lago","description":"After an explosive court brief and picture of classified documents from Mar-a-Lago earlier this week, the Justice Department will argue in court Thursday against a request by former President Donald Trump that a so-called special master be appointed in to rev…","url":"http://us.cnn.com/2022/09/01/politics/what-to-watch-trump-maralago-hearing-special-master/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220818131934-federal-court-florida-restricted-081822-super-tease.jpg","publishedAt":"2022-09-01T09:18:32Z","content":"West Palm Beach, Florida (CNN)After an explosive court brief and picture of classified documents from Mar-a-Lago earlier this week, the Justice Department will argue in court Thursday against a reque… [+4842 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Amanda Musa, CNN","title":"Body camera video shows a Columbus, Ohio, police officer fatally shooting an unarmed 20-year-old Black man","description":"Police in Columbus, Ohio, have released body camera video that shows a police officer fatally shooting an unarmed Black man in his bed.","url":"http://us.cnn.com/2022/09/01/us/columbus-ohio-police-shooting-donovan-lewis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901090639-columbus-ohio-police-shooting-super-tease.jpg","publishedAt":"2022-09-01T07:19:02Z","content":"(CNN)Police in Columbus, Ohio, have released body camera video that shows a police officer fatally shooting an unarmed Black man in his bed.\r\nDonovan Lewis, 20, died Tuesday after being shot by Colum… [+3436 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Trump's legal gambits offer fresh revelations and deepen his political risk","description":"Donald Trump's scatter-shot defense in the weeks since FBI agents descended on his Mar-a-Lago resort has only exposed the depth of the mess he faces over his refusal to return classified documents that led to an unprecedented search of an ex-president's home.","url":"http://us.cnn.com/2022/09/01/politics/trump-legal-gambits-political-risk-analysis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831235930-03-trumps-legal-gambits-super-tease.jpg","publishedAt":"2022-09-01T04:09:03Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Ex-FBI deputy director says Trump's response is 'all over the map' - CNN Video","description":"Ex-FBI Deputy Director Andrew McCabe reacts to former President Donald Trump's formal response in court to the Justice Department's blockbuster filing, which revealed new details about the Mar-a-Lago investigation.","url":"http://us.cnn.com/videos/politics/2022/09/01/trump-mar-a-lago-fbi-search-doj-filing-response-mccabe-sot-ac360-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831203817-trump-mar-a-lago-fbi-search-doj-filing-response-mccabe-sot-ac360-vpx-00001425-super-tease.jpg","publishedAt":"2022-09-01T01:52:25.4655957Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ellie Kaufman","title":"West Point is displaying a Ku Klux Klan plaque at entrance to Science building, Congressional Naming Commission finds","description":"West Point, the United States Military Academy, has a plaque with the name Ku Klux Klan written out and a hooded figure displayed at the entrance to Bartlett Hall, the science center on the military academy's campus, according to a new report from the Congres…","url":"http://www.cnn.com/2022/08/31/politics/west-point-kkk-plaque/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220831115729-02-west-point-academy-file.jpg?q=w_800,c_fill","publishedAt":"2022-08-31T17:24:35Z","content":"West Point, the United States Military Academy, has a plaque with the name Ku Klux Klan written out and a hooded figure displayed at the entrance to Bartlett Hall, the science center on the military … [+3824 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner, CNN","title":"Sarah Palin loses special election for Alaska House seat","description":"Democrat Mary Peltola won the special election to fill Alaska's House seat for the remainder of 2022, according to unofficial results released by the Alaska Division of Elections, thwarting former Gov. Sarah Palin's bid at a political comeback -- at least for…","url":"http://us.cnn.com/2022/08/31/politics/alaska-house-seat-ranked-choice-ballots/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831195058-sarah-palin-mary-peltola-split-super-tease.jpg","publishedAt":"2022-08-31T09:10:43Z","content":"(CNN)Democrat Mary Peltola won the special election to fill Alaska's House seat for the remainder of 2022, according to unofficial results released by the Alaska Division of Elections, thwarting form… [+4944 chars]"}]}