{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Hear what Rudy Giuliani told CNN reporter before entering courthouse - CNN Video","description":"CNN's Nick Valencia caught Rudy Giuliani, ex-lawyer of former president Donald Trump, on his way into the Fulton County Courthouse to testify before a grand jury.","url":"http://us.cnn.com/videos/politics/2022/08/17/rudy-giuliani-atlanta-georgia-grand-jury-trump-valencia-newday-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220817090518-rudy-giuliani-valencia-081722-super-tease.jpg","publishedAt":"2022-08-18T01:22:27.6177465Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Hear what Stephanie Grisham thinks is on Mar-a-Lago CCTV footage - CNN Video","description":"Former Trump aide Stephanie Grisham and CNN's Gloria Borger explain why they believe the former President has not yet released surveillance footage from the FBI search of Mar-a-Lago, despite proposals from some of his allies to do so.","url":"http://us.cnn.com/videos/politics/2022/08/18/trump-cctv-surveillance-footage-fbi-search-grisham-ebof-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220106091107-stephanie-grisham-donald-trump-super-tease.jpg","publishedAt":"2022-08-18T01:22:25.3196105Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Veronica Stracqualursi, CNN","title":"Florida court finds pregnant teen not mature enough to undergo abortion","description":"A pregnant 16-year-old in Florida was denied a waiver to get an abortion in the state without legal guardian notification and consent, after a court deemed she did not prove that she is mature enough to make the decision.","url":"http://us.cnn.com/2022/08/17/politics/florida-teen-court-blocked-abortion/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220817084004-abortion-protest-florida-220624-super-tease.jpg","publishedAt":"2022-08-18T00:13:01Z","content":"(CNN)A pregnant 16-year-old in Florida was denied a waiver to get an abortion in the state without legal guardian notification and consent, after a court deemed she did not prove that she is mature e… [+4401 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr, Sara Murray, Kaitlan Collins and Katelyn Polantz, CNN","title":"Trump considering releasing surveillance footage of FBI Mar-a-Lago search","description":"Some allies of former President Donald Trump are urging him to publicly release surveillance footage of FBI agents executing a search warrant on his Mar-a-Lago residence, a proposal that has drawn mixed reaction inside his orbit, CNN has learned.","url":"http://us.cnn.com/2022/08/17/politics/trump-release-surveillance-footage-fbi-mar-a-lago/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812193133-mar-a-lago-file-081022-super-tease.jpg","publishedAt":"2022-08-17T23:44:50Z","content":"Washington (CNN)Some allies of former President Donald Trump are urging him to publicly release surveillance footage of FBI agents executing a search warrant on his Mar-a-Lago residence, a proposal t… [+7869 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Zachary B. Wolf, CNN","title":"Analysis: How to keep track of Trump's legal issues","description":"Former President Donald Trump has created a unique gravitational pull for lawsuits and investigations that often hit the people in his orbit but have not yet landed on him. Now there's a burst of activity from the authorities circling around him who are all c…","url":"http://us.cnn.com/2022/08/17/politics/trump-lawsuits-investigations-what-matters/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220817125524-02-rudy-giuliani-courthouse-arrival-220817-super-tease.jpg","publishedAt":"2022-08-17T22:50:39Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Hannah Rabinowitz","title":"Georgia governor asks judge to quash subpoena for him to appear before grand jury","description":"Georgia Gov. Brian Kemp asked a judge on Wednesday to throw out a subpoena from the Fulton County district attorney requiring the Republican governor to appear before the grand jury investigating former President Donald Trump's attempts to overturn the 2020 e…","url":"http://us.cnn.com/2022/08/17/politics/kemp-fulton-county-da-subpoena-2020/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220817172818-gov-brian-kemp-file-072922.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-17T21:34:39Z","content":"Georgia Gov. Brian Kemp asked a judge on Wednesday to throw out a subpoena from the Fulton County district attorney requiring the Republican governor to appear before the grand jury investigating for… [+2299 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Brenda Goodman","title":"CDC announces sweeping reorganization, aimed at changing the agency's culture and restoring public trust","description":"Big changes are coming to the United States Centers for Disease Control and Prevention, which recently celebrated its 75th anniversary as the nation's lead public health agency.","url":"http://www.cnn.com/2022/08/17/health/cdc-announces-sweeping-changes/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220817094031-cdc-headquarters-restricted-super-tease.jpg","publishedAt":"2022-08-17T17:41:17Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Stephanie Grisham and Gavin J. Smith","title":"Opinion: To our former Trump world colleagues -- this is your moment to finally put America first","description":"Stephanie Grisham and Gavin Smith plead with their former colleagues and fellow Republicans to join them in speaking out against Donald Trump before it's too late.","url":"http://us.cnn.com/2022/08/17/opinions/countering-trumpism-in-gop-grisham-smith/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812145903-donald-trump-file-081022-super-tease.jpg","publishedAt":"2022-08-17T16:51:55Z","content":"Stephanie Grisham is the author of \"I'll Take Your Questions Now: What I Saw in the Trump White House.\" During the Trump administration, Grisham served as White House press secretary and director of … [+6112 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Vanessa Yurkevich, CNN Business","title":"American farmers are killing their own crops and selling cows because of extreme drought","description":"Nearly three quarters of US farmers say this year's drought is hurting their harvest -- with significant crop and income loss, according to a new survey by the American Farm Bureau Federation, an insurance company and lobbying group that represents agricultur…","url":"http://us.cnn.com/2022/08/17/business/west-drought-farmers-survey-climate/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220817082703-01-cailfornia-farm-drought-restricted-super-tease.jpg","publishedAt":"2022-08-17T16:23:48Z","content":"Human remains are found at Lake Mead's Swim Beach for the third time\r\nThe West's historic drought is threatening hydropower at Hoover Dam\r\nExperts say the term 'drought' may be insufficient to captur… [+283 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kara Scannell, CNN","title":"Former CFO of Trump Organization expected to plea guilty but will not cooperate in probe of family business","description":"The former chief financial officer of the Trump Organization is expected to plead guilty Thursday to a 15-year tax fraud scheme, but he will not enter into a cooperation agreement to aid New York prosecutors in their criminal investigation of the real estate …","url":"http://us.cnn.com/2022/08/17/politics/allen-weisselberg-plead-guilty-trump-organization-former-cfo/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210701143736-02-weisselberg-arrives-court-0701-super-tease.jpg","publishedAt":"2022-08-17T16:19:41Z","content":"(CNN)The former chief financial officer of the Trump Organization is expected to plead guilty Thursday to a 15-year tax fraud scheme, but he will not enter into a cooperation agreement to aid New Yor… [+869 chars]"}]}