{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Brittney Griner's Russian counsel speaks to CNN - CNN Video","description":"CNN's Fred Pleitgen speaks with Brittney Griner's Russian counsel Maria Blagovolina about Griner's well-being and their trial strategy.","url":"http://us.cnn.com/videos/world/2022/07/30/russia-prisoner-swap-griner-whelan-nr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728000902-01-brittney-griner-trial-russia-thursday-super-tease.jpg","publishedAt":"2022-07-31T17:52:35.9029194Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Wayne Sterling, CNN","title":"NBA legend Bill Russell dies at 88","description":"Eleven-time NBA champion and Boston Celtics legend Bill Russell has died at age 88.","url":"http://us.cnn.com/2022/07/31/sport/bill-russell-nba-legend-dies-spt-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220731133015-01-bill-russell-obit-super-tease.jpg","publishedAt":"2022-07-31T17:40:08Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tami Luhby and Daniella Diaz, CNN","title":"Republicans argue Manchin and Schumer's energy, health care deal will raise taxes, citing nonpartisan data","description":"Americans of all incomes would see their federal taxes rise under the climate and health care package that was negotiated last week between Senate Majority Leader Chuck Schumer and moderate Democratic Sen. Joe Manchin, according to data from the nonpartisan J…","url":"http://us.cnn.com/2022/07/31/politics/republicans-economic-bill-taxes-inflation/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220731130010-manchin-schumer-split-super-tease.jpg","publishedAt":"2022-07-31T17:07:17Z","content":"(CNN)Americans of all incomes would see their federal taxes rise under the climate and health care package that was negotiated last week between Senate Majority Leader Chuck Schumer and moderate Demo… [+3367 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tina Burnside and Holly Yan, CNN","title":"A mass shooting in downtown Orlando leaves 7 people hospitalized. The assailant is still at large","description":"At least seven shooting victims were hospitalized Sunday after a melee in downtown Orlando, Florida.","url":"https://www.cnn.com/2022/07/31/us/orlando-downtown-mass-shooting/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220731080745-orlando-shooting-presser-0731-super-tease.jpg","publishedAt":"2022-07-31T12:31:00Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ivana Kottasová, Olga Voitovych, Darya Tarasova, Manveena Suri, Kareem Khadder, Josh Pennington, Nic Robertson","title":"Mykolaiv in Ukraine hit with heavy shelling as Putin threatens 'lightning speed' response to interference","description":"The southern Ukrainian city of Mykolaiv came under intense shelling in the early morning hours on Sunday, according to officials there, as Russian President Vladimir Putin used his nation's Navy Day to issue more militaristic threats.","url":"http://us.cnn.com/2022/07/31/europe/ukraine-russia-war-putin-intl/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220731075252-putin-speech-0731.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-31T12:25:30Z","content":"The southern Ukrainian city of Mykolaiv came under intense shelling in the early morning hours on Sunday, according to officials there, as Russian President Vladimir Putin used his nations Navy Day t… [+3267 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Artemis Moshtaghian and Justin Gamble, CNN","title":"Georgia authorities release body camera footage after woman dies following fall from patrol car","description":"Georgia authorities released body camera footage Friday of an incident from earlier this month where a mother experiencing what her family called a mental health crisis died due to a fatal injury while in police custody.","url":"http://us.cnn.com/2022/07/30/us/georgia-brianna-grier-body-camera-footage-reaj/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220730221105-01-brianna-grier-body-cam-super-tease.jpg","publishedAt":"2022-07-31T04:56:49Z","content":"(CNN)Georgia authorities released body camera footage Friday of an incident from earlier this month where a mother experiencing what her family called a mental health crisis died due to a fatal injur… [+5413 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ivan Watson, CNN","title":"Ballet, busking, bathing: How Ukrainians are defying Russia by embracing 'normal life'","description":"Life in this country at war can appear deceptively peaceful. People still go to work, walk their dogs and play with their children in the park.","url":"http://us.cnn.com/2022/07/30/europe/russia-war-ukrainians-embracing-normal-life-intl-hnk/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728231121-06-in-the-shadows-of-death-super-tease.jpg","publishedAt":"2022-07-31T01:50:21Z","content":"Odesa, Ukraine (CNN)On the banks of the Dnieper River, parents sunbathe on the beach as their children splash in the cool, refreshing water. \r\nA girl dances, twisting and twirling in the sand as a bu… [+5936 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tim Lister, Gul Tuysuz and Kostan Nechyporenko, CNN","title":"'Appalling' videos alleged to show Russian soldiers castrating a Ukrainian soldier","description":"Videos alleged to show Russian soldiers castrating and killing a bound and gagged Ukrainian soldier are circulating on social media, drawing an accusation of potential war crimes from the United Nations and prompting a Ukrainian investigation into possible to…","url":"http://us.cnn.com/2022/07/30/world/videos-allegedly-show-russians-castrating-ukrainian/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220730142808-russian-soldiers-castrating-ukrainian-soldier-super-tease.jpg","publishedAt":"2022-07-30T20:14:48Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tim Lister and Josh Pennington, CNN","title":"Russia is recruiting thousands of volunteers to replenish its ranks in Ukraine. Prior experience isn't always required","description":"Across Russia, volunteer battalions are being formed to deploy to the war in Ukraine, joining the so-called \"special military operation\" declared by President Vladimir Putin in February.","url":"http://us.cnn.com/2022/07/29/europe/russia-recruits-volunteer-battalions-ukraine-war-cmd-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220729005214-01-russia-recruits-volunteer-battalions-ukraine-war-super-tease.jpg","publishedAt":"2022-07-30T03:43:14Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"CNN Exclusive by Nima Elbagir, Barbara Arvanitidis, Tamara Qiblawi, Gianluca Mezzofiore, Mohammed Abo Al Gheit and Darya Tarasova\nVideo by Alex Platt and Mark Baron\nGraphics by Sarah-Grace Mankarious, Marco Chacón, Natalie Croker and Henrik Pettersson","title":"Russia is plundering gold in Sudan to boost Putin's war effort in Ukraine","description":"Multiple interviews with high-level Sudanese and US officials and troves of documents reviewed by CNN paint a picture of an elaborate Russian scheme to plunder Sudan's riches in a bid to fortify Russia against increasingly robust Western sanctions and to butt…","url":"http://us.cnn.com/2022/07/29/africa/sudan-russia-gold-investigation-cmd-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726094726-20220726-sudan-gold-russia-illustration-super-tease.jpg","publishedAt":"2022-07-29T16:07:53Z","content":"CNN Exclusive by Nima Elbagir, Barbara Arvanitidis, Tamara Qiblawi, Gianluca Mezzofiore, Mohammed Abo Al Gheit and Darya TarasovaVideo by Alex Platt and Mark BaronGraphics by Sarah-Grace Mankarious, … [+17762 chars]"}]}