{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Dakin Andone, CNN","title":"Opening statements are set to begin today in the Parkland shooter's death penalty case","description":"The penalty phase in the trial of Parkland, Florida, school shooter Nikolas Cruz is set to begin in earnest Monday after months of painstaking jury selection that itself was impacted by the wave of gun violence beyond the Broward County courtroom.","url":"http://us.cnn.com/2022/07/18/us/nikolas-cruz-parkland-shooter-penalty-phase/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714120129-01-nikolas-cruz-court-0706-super-tease.jpg","publishedAt":"2022-07-18T10:07:53Z","content":"(CNN)The penalty phase in the trial of Parkland, Florida, school shooter Nikolas Cruz is set to begin in earnest Monday after months of painstaking jury selection that itself was impacted by the wave… [+6157 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Katelyn Polantz, Tierney Sneed","title":"Bannon trial set to begin over failure to comply with Jan. 6 committee subpoenas","description":"Steve Bannon is headed to trial on two criminal charges for his failure to comply with the House's January 6, 2021, investigation 10 months after receiving subpoenas from the select committee.","url":"http://us.cnn.com/2022/07/18/politics/bannon-trial-begins-jan-6-subpoenas/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220717210029-02-bannon-trial-jan-6-subpoenas.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-18T10:01:31Z","content":"Steve Bannon is headed to trial on two criminal charges for his failure to comply with the Houses January 6, 2021, investigation 10 months after receiving subpoenas from the select committee.\r\nHis pr… [+5246 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Paul LeBlanc, CNN","title":"The January 6 committee is returning to primetime. Here's what you need to know.","description":"The year since the House voted to create a select committee to probe the deadly January 6, 2021, insurrection has brought a cascade of revelations about the attack on the US Capitol and how and why it played out, often in excruciating detail.","url":"http://us.cnn.com/2022/07/18/politics/january-6-primetime-hearing-explainer/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220711150822-jan-6-hearing-0623-super-tease.jpg","publishedAt":"2022-07-18T08:01:43Z","content":"A version of this story appears in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)The year since the House voted to create a select committee to probe… [+4934 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Emma Tucker, Shimon Prokupecz, Dakin Andone, Peter Nickeas","title":"5 key takeaways from the Uvalde shooting report and video revealing failures in law enforcement response","description":"In the first comprehensive look by a government agency into the Uvalde elementary school massacre, a Texas House investigative committee released a preliminary report Sunday outlining a series of failures by multiple law enforcement agencies in their response…","url":"http://us.cnn.com/2022/07/18/us/5-key-takeaways-uvalde-report-and-video/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220717150503-04-uvalde-report-images.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-18T04:20:57Z","content":"In the first comprehensive look by a government agency into the Uvalde elementary school massacre, a Texas House investigative committee released a preliminary report Sunday outlining a series of fai… [+8427 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Trumpism is on trial with Bannon in court and Jan. 6 hearing in primetime","description":"Two moments of accountability will exemplify the January 6 committee's success in ensuring that Trump's lifelong aura of impunity does not prevent the emergence of the truth about the worst attack on American democracy in modern times.","url":"http://us.cnn.com/2022/07/18/politics/trumpism-on-trial-bannon-jan-6-hearing/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220717221640-trumpism-on-trial-bannon-jan-6-hearing-super-tease.jpg","publishedAt":"2022-07-18T04:00:53Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Inside Steve Bannon's plan to reshape the Republican Party - CNN Video","description":"Steve Bannon, President Trump's former adviser, is pushing to install election workers that believe the 2020 election was stolen. For more, see CNN's special report, \"Power in Chaos: How Steve Bannon is disrupting democracy\".","url":"http://us.cnn.com/videos/politics/2022/07/15/steve-bannon-strategy-election-influence-orig.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220715203949-bannon-precinct-strategy-super-tease.jpg","publishedAt":"2022-07-18T02:52:22.6691263Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Aaron Pellish, Daniella Diaz, Katelyn Polantz and Devan Cole, CNN","title":"January 6 committee members expect panel to receive Secret Service texts by Tuesday","description":"A member of the House select committee investigating the Capitol insurrection said Sunday that she expected the panel to receive US Secret Service text messages from January 5 and 6, 2021, by Tuesday, following a subpoena issued last week for the records.","url":"http://us.cnn.com/2022/07/17/politics/january-6-secret-service-text-messages-elaine-luria-cnntv/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220717112528-zoe-lofgren-220712-super-tease.jpg","publishedAt":"2022-07-17T17:41:10Z","content":"Washington (CNN)Two members of the House select committee investigating the Capitol insurrection said Sunday that they expected the panel to receive US Secret Service text messages from January 5 and… [+5234 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Richard Galant, CNN","title":"Opinion: Trump White House confrontation that says it all","description":"In the months after Joe Biden's 2020 victory, Donald Trump's diehard supporters floated increasingly desperate schemes to try to keep him in office, including seizing voting machines. As Trump's former White House counsel said, they never offered proof of any…","url":"http://us.cnn.com/2022/07/17/opinions/white-house-election-confrontation-column-galant/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708110619-01-pat-cipollone-testimony-arrival-0708-super-tease.jpg","publishedAt":"2022-07-17T13:24:57Z","content":"Sign up to get this weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)In the 1850s, a barroom brawler named Joh… [+19470 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"CNN","title":"Power in chaos: Steve Bannon is disrupting democracy. This is how.","description":"The former Donald Trump adviser is recruiting foot soldiers to join his mission to torch the establishment wing of the Republican Party","url":"https://www.cnn.com/interactive/2022/07/politics/steve-bannon-us-democracy/","urlToImage":"https://www.cnn.com/interactive/2022/07/politics/steve-bannon-us-democracy/media/steve-bannon-invs/s_856FF6C214776108AA6171C1BD65D97599E02136EC4E792BE937CFC04A735F46_1657916609047_bannon-hp-image-1.jpg","publishedAt":"2022-07-17T00:00:00Z","content":"As a single mom with a full-time job, Wendy Ahrenkiel had little time for politics. But after the 2020 election, when Joe Biden was declared President, she felt cheated and found the time.\r\nAhrenkiel… [+44286 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, CNN","title":"January 6 committee's investigation stirs up fresh revelations ahead of last planned hearing","description":"The House January 6 committee corroborated key details involving former President Donald Trump's heated exchange with the Secret Service when Trump was told he could not go to the Capitol -- the latest in a string of shocking revelations that have come from t…","url":"http://us.cnn.com/2022/07/16/politics/january-6-committee-latest/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220613104923-03-jan-6-hearing-0613-super-tease.jpg","publishedAt":"2022-07-16T22:16:43Z","content":"(CNN)The House January 6 committee corroborated key details involving former President Donald Trump's heated exchange with the Secret Service when Trump was told he could not go to the Capitol -- the… [+10120 chars]"}]}