{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Jacquelyne Germain","title":"Chicago's 4th of July weekend death toll surpassed the Highland Park shooting. 'I thought there would be more outcry,' mother says","description":"As the nation was shocked by a premeditated mass shooting in Highland Park, residents an hour away on Chicago's South and West Sides were also grieving a death and injury toll that surpassed that of Highland Park.","url":"http://us.cnn.com/2022/07/09/us/chicago-residents-holiday-weekend-shootings-reaj/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220708132516-01-angela-gregg-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-09T11:19:02Z","content":"Angela Greggs 4-year-old son, Mychal Moultry Jr., known to loved ones as MJ, was killed by a stray bullet while getting his hair braided last year during Labor Day weekend in Chicagos South Side neig… [+7357 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Iqbal Athas and Rhea Mogul, CNN","title":"Sri Lanka protesters break into President's House as thousands rally","description":"Protesters broke into the Sri Lankan leader's official residence in Colombo on Saturday as more than 100,000 amassed outside, according to police, calling for President Gotabaya Rajapaksa to resign over his handling of the country's economic crisis.","url":"http://us.cnn.com/2022/07/09/asia/sri-lanka-protest-president-saturday-intl-hnk/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220709035422-01-shri-lanka-protests-070922-restricted-super-tease.jpg","publishedAt":"2022-07-09T10:10:54Z","content":"Colombo, Sri Lanka (CNN)Protesters broke into the Sri Lankan leader's official residence in Colombo on Saturday as more than 100,000 amassed outside, according to police, calling for President Gotaba… [+2650 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Simone Pathe, CNN","title":"The 10 Senate seats most likely to flip in 2022","description":"With more than half of this year's competitive Senate matchups set, the overall electoral environment remains consistent: President Joe Biden's poor approval numbers, combined with a pervasive sense that the country is headed in the wrong direction, are weigh…","url":"http://us.cnn.com/2022/07/09/politics/senate-race-rankings-july-elections/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708154740-us-capitol-file-062122-super-tease.jpg","publishedAt":"2022-07-09T10:01:13Z","content":"(CNN)With more than half of this year's competitive Senate matchups set, the overall electoral environment remains consistent: President Joe Biden's poor approval numbers, combined with a pervasive s… [+19001 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/rhea-mogul\">Rhea Mogul</a>, <a href=\"/profiles/helen-regan\">Helen Regan</a>, Amy Woodyatt and <a href=\"/profiles/laura-smith-spark\">Laura Smith-Spark</a>, CNN","title":"Live updates: Assassination of Japan's Shinzo Abe","description":"Former Japanese Prime Minister Shinzo Abe died at age 67 after being shot during a speech on Friday in Nara, Japan. Follow here for the latest live news updates.","url":"https://www.cnn.com/asia/live-news/shinzo-abe-japan-assassination-07-09-22-intl-hnk/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708051006-36-japan-shinzo-abe-obit-super-tease.jpg","publishedAt":"2022-07-09T00:53:28Z","content":"Police have launched a murder investigation into the assassination of former Japanese prime minister Shinzo Abe but little is known about the suspect who was arrested at the scene of the fatal shooti… [+1625 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Gunman's father claims no responsibility over shooting - CNN Video","description":"Robert Crimo Jr., the father of the confessed Highland Park parade shooter, says he thought his son was going to use the guns he helped purchase at the shooting range.","url":"http://us.cnn.com/videos/us/2022/07/07/robert-crimo-parents-highland-park-campbell-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708094328-robert-crimo-jr-highland-park-shooter-father-super-tease.jpeg","publishedAt":"2022-07-09T00:37:27.8820718Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Casey Tolan and Daniel A. Medina, CNN","title":"Highland Park gunman's family was in turmoil for years leading up to parade shooting","description":"When Bob's Pantry and Deli opened for business in the Chicago suburb of Highland Park in 2008, loyal customers lined up in the snow at 4 a.m. to support Bob Crimo, who was striking out on his own after years running a convenience store franchise. Photos from …","url":"http://us.cnn.com/2022/07/08/us/highland-park-suspect-family-turmoil-invs/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708094328-robert-crimo-jr-highland-park-shooter-father-super-tease.jpeg","publishedAt":"2022-07-08T21:32:43Z","content":"(CNN)When Bob's Pantry and Deli opened for business in the Chicago suburb of Highland Park in 2008, loyal customers lined up in the snow at 4 a.m. to support Bob Crimo, who was striking out on his ow… [+15870 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Aya Elamroussi, Josh Campbell and Yon Pomrenze, CNN","title":"Highland Park shooter's rooftop position made it difficult for officers to find him quickly as parade turned into chaos, police chief says","description":"The Fourth of July parade shooter's location -- concealed on a rooftop along Highland Park's Central Avenue -- made it hard for law enforcement to figure out immediately where bullets were raining from when he opened fire with a semi-automatic rifle, the Illi…","url":"http://us.cnn.com/2022/07/08/us/highland-park-illinois-shooting-july-fourth-parade-friday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708021150-01-highland-park-illinois-shooting-july-fourth-parade-friday-restricted-super-tease.jpg","publishedAt":"2022-07-08T20:36:19Z","content":"Highland Park, Illinois (CNN)The Fourth of July parade shooter's location -- concealed on a rooftop along Highland Park's Central Avenue -- made it hard for law enforcement to figure out immediately … [+7678 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Joe Sutton and Christina Maxouris, CNN","title":"The 8-year-old boy paralyzed from waist down after Highland Park parade shooting woke up and asked to see his twin and dog","description":"An 8-year-old boy who was attending the Highland Park Fourth of July parade with his parents and twin brother was shot and is now paralyzed from the waist down, family spokesperson Anthony Loizzi told CNN on Thursday.","url":"http://us.cnn.com/2022/07/07/us/highland-park-shooting-cooper-roberts-8-year-old-paralyzed/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220707145149-cooper-roberts-highland-park-critical-condition-super-tease.jpg","publishedAt":"2022-07-08T20:30:38Z","content":"(CNN)An 8-year-old boy who was attending the Highland Park Fourth of July parade with his parents and twin brother was shot and is now paralyzed from the waist down, family spokesperson Anthony Loizz… [+3766 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Travis Caldwell, Joe Sutton and Rebekah Riess, CNN","title":"New York Post: Father of Highland Park gunman wants his son to serve a 'long' sentence","description":"Days after a gunman killed seven and wounded dozens more in a rampage at a Fourth of July parade in Highland Park, Illinois, the shooter's father told the New York Post he wants his son to serve a long prison sentence.","url":"http://us.cnn.com/2022/07/07/us/highland-park-illinois-shooting-july-fourth-parade-thursday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220706175331-highland-park-chicago-crimo-tiroteo-confesion-masacre-redaccion-mexico-yilber-vega-00011909-super-tease.jpg","publishedAt":"2022-07-08T15:30:49Z","content":"(CNN)Days after a gunman killed seven and wounded dozens more in a rampage at a Fourth of July parade in Highland Park, Illinois, the shooter's father told the New York Post he wants his son to serve… [+11445 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Sandee LaMotte, CNN","title":"No antibiotics worked, so this woman turned to a natural enemy of bacteria to save her husband's life","description":"With her husband near death from an antibiotic-resistant superbug, a scientist found a cure no one had used in the US -- intravenous injections of viruses called phages -- and convinced the medical system to save his life.","url":"http://www.cnn.com/2022/07/08/health/phage-superbug-killer-life-itself-wellness/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220617150818-04-phage-superbug-killer-wellness-super-tease.jpg","publishedAt":"2022-07-08T13:56:52Z","content":"(CNN)In February 2016, infectious disease epidemiologist Steffanie Strathdee was holding her dying husband's hand, watching him lose an exhausting fight against a deadly superbug infection. \r\nAfter m… [+11859 chars]"}]}