{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr, CNN","title":"Trump signals 2024 decision has come down to timing of an announcement","description":"In perhaps the strongest signal yet that Donald Trump is plotting another run for the White House, the former President told New York Magazine in a new interview that he is still deciding when -- not if -- he should announce a 2024 campaign.","url":"http://us.cnn.com/2022/07/14/politics/donald-trump-2024-decision/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714135922-donald-trump-061822-super-tease.jpg","publishedAt":"2022-07-14T18:05:06Z","content":"(CNN)In perhaps the strongest signal yet that Donald Trump is plotting another run for the White House, the former President told New York Magazine in a new interview that he is still deciding when -… [+2258 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Ex-spokesperson for extremist group issues warning about the GOP - CNN Video","description":"Jason Van Tatenhove, a former spokesperson for the far-right militia group the Oath Keepers, says that the Republican party is radicalizing and warns about future political violence in the US.","url":"http://us.cnn.com/videos/politics/2022/07/14/republican-party-former-oath-keeper-warning-dlt-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714085945-jason-van-tatenhove-former-oath-keeper-super-tease.jpg","publishedAt":"2022-07-14T16:37:43.6971931Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Katelyn Polantz, CNN","title":"Judge again rejects Bannon trial delay request but opens door to possible new defense argument","description":"A federal judge is keeping the door open for Steve Bannon to use a potential new defense argument where he could present his recent bid to testify for the House January 6 committee to the jury when he goes on trial on contempt of Congress charges next week fo…","url":"http://us.cnn.com/2022/07/14/politics/bannon-pretrial-hearing-delay-defense/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220615135450-03-steve-bannon-0615-super-tease.jpg","publishedAt":"2022-07-14T16:33:45Z","content":"(CNN)A federal judge is keeping the door open for Steve Bannon to use a potential new defense argument where he could present his recent bid to testify for the House January 6 committee to the jury w… [+5660 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Manu Raju and Ted Barrett, CNN","title":"In response to trump, senators agree to clarify vice president's role overseeing certification","description":"Senators from both parties have reached an agreement to clarify that the vice president only has a ceremonial role in overseeing the certification of the electoral results, according to two Senate sources, the first legislative response to former President Do…","url":"http://us.cnn.com/2022/07/14/politics/electoral-count-act-agreement-senators/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616152509-21-january-6-hearings-0616-pence-super-tease.jpg","publishedAt":"2022-07-14T16:29:38Z","content":"(CNN)Senators from both parties have reached an agreement to clarify that the vice president only has a ceremonial role in overseeing the certification of the electoral results, according to two Sena… [+2247 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Chris Cillizza","title":"Donald Trump is totally obsessed with the January 6 committee","description":"The opposite of love, it's said, isn't hate. It's indifference.","url":"http://us.cnn.com/2022/07/14/politics/donald-trump-jan-6-committee-hearings-obsessed/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220714091010-trump-rally-illinois-0625.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-14T15:39:00Z","content":"The opposite of love, its said, isnt hate. Its indifference.\r\nThe message there is simple: To hate something requires intense feeling the same sort of feeling that fuels love. Indifference is the abs… [+3040 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Brian Rokus and Veronica Stracqualursi, CNN","title":"Prominent conservatives issue report rebutting Trump election claims","description":"A group of conservatives, including prominent lawyers and retired federal judges, issued a 72-page report on Thursday categorically rebutting each of the claims made in court by former President Donald Trump and his supporters over the 2020 election results.","url":"http://us.cnn.com/2022/07/14/politics/conservatives-report-trump-2020-election-claims/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714091010-trump-rally-illinois-0625-super-tease.jpg","publishedAt":"2022-07-14T15:22:24Z","content":"(CNN)A group of conservatives, including prominent lawyers and retired federal judges, issued a 72-page report on Thursday categorically rebutting each of the claims made in court by former President… [+3929 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Brenda Goodman, CNN","title":"Why the Omicron offshoot BA.5 is a big deal","description":"Once again, Covid-19 seems to be everywhere. If you feel caught off-guard, you aren't alone.","url":"http://us.cnn.com/2022/07/14/health/omicron-ba-5-variant-immunity-severity/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220707175629-covid-19-vaccine-under-five-file-restricted-062322-super-tease.jpg","publishedAt":"2022-07-14T14:52:05Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Julia Horowitz, CNN Business","title":"A truly massive interest rate hike is now on the table","description":"Central banks have made clear that after a sluggish start, they're serious about putting a lid on inflation. Now, as prices soar even faster than expected, they're weighing increasingly drastic options.","url":"http://us.cnn.com/2022/07/14/investing/premarket-stocks-trading/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220502114150-03-federal-reserve-0316-file-super-tease.jpg","publishedAt":"2022-07-14T12:33:41Z","content":"A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+5974 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr, CNN","title":"Trump will make first return to Washington since leaving office","description":"Donald Trump will return to Washington on July 26 to deliver what's being billed as a major policy speech, CNN has learned, marking the former President's first time back in the nation's capital since he left office nearly a year and a half ago.","url":"http://us.cnn.com/2022/07/14/politics/donald-trump-washington-return/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714122654-trump-washington-return-super-tease.jpg","publishedAt":"2022-07-14T11:29:21Z","content":"(CNN)Donald Trump will return to Washington on July 26 to deliver what's being billed as a major policy speech, CNN has learned, marking the former President's first time back in the nation's capital… [+1582 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinon by Michael D'Antonio","title":"Opinion: A terrifying glimpse of what could await America after the 2024 election","description":"If, come 2024, we find ourselves with a candidate Trump on the presidential ballot, this hearing provides a terrifying glimpse of what's at stake, writes Michael D'Antonio","url":"https://www.cnn.com/2022/07/13/opinions/jan-6-trump-america-election-dantonio/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220712224330-us-capitol-riot-file-010621.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-13T18:25:55Z","content":"Editors Note: Michael DAntonio is the author of the book Never Enough: Donald Trump and the Pursuit of Success and co-author, with Peter Eisner, of the book High Crimes: The Corruption, Impunity, and… [+3902 chars]"}]}