{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Ex-FBI deputy director says Trump's response is 'all over the map' - CNN Video","description":"Ex-FBI Deputy Director Andrew McCabe reacts to former President Donald Trump's formal response in court to the Justice Department's blockbuster filing, which revealed new details about the Mar-a-Lago investigation.","url":"http://us.cnn.com/videos/politics/2022/09/01/trump-mar-a-lago-fbi-search-doj-filing-response-mccabe-sot-ac360-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831203817-trump-mar-a-lago-fbi-search-doj-filing-response-mccabe-sot-ac360-vpx-00001425-super-tease.jpg","publishedAt":"2022-09-01T01:52:25.4655957Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jorge Engels, CNN","title":"UN rights chief releases controversial Xinjiang report on her final day","description":"Against China's wishes, the UN High Commissioner for Human Rights Michelle Bachelet on Wednesday released a much-anticipated report on China's treatment of Uyghur and other Muslim minority peoples in its northwestern Xinjiang region.","url":"http://us.cnn.com/2022/08/31/asia/un-xinjiang-china-bachelet-report-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220825004626-xinjiang-detention-protests-2021-super-tease.jpg","publishedAt":"2022-09-01T00:43:17Z","content":"(CNN)Against China's wishes, the UN High Commissioner for Human Rights Michelle Bachelet on Wednesday released a much-anticipated report on China's treatment of Uyghur and other Muslim minority peopl… [+2068 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen","title":"Trump responds in court to Justice Department's filing about Mar-a-Lago investigation","description":"Former President Donald Trump has formally responded in court to the Justice Department's blockbuster filing from Tuesday night, which revealed new details about the Mar-a-Lago investigation.","url":"http://us.cnn.com/2022/08/31/politics/trump-response-mar-a-lago-search-special-master/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220831165442-01-donald-trump-court-filing.jpg?q=w_800,c_fill","publishedAt":"2022-08-31T23:59:26Z","content":"Former President Donald Trump has formally responded in court to the Justice Departments blockbuster filing from Tuesday night, which revealed new details about the Mar-a-Lago investigation.\r\nTrumps … [+737 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/brandon-griggs\">Brandon Griggs</a>, <a href=\"/profiles/amir-vera\">Amir Vera</a> and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN","title":"Live updates: Serena Williams' US Open singles tennis match vs. Anett Kontaveit","description":"Serena Williams plays her second individual US Open match in what is likely the final tennis tournament of her storied career. Follow for live updates.","url":"http://us.cnn.com/us/live-news/serena-williams-us-open-08-31-22/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220829221501-20b-serena-wiliams-us-open-match-1-super-tease.jpg","publishedAt":"2022-08-31T21:58:54Z","content":"Midway through the opening set, the two women facing each other for the first time appear evenly matched.\r\nAnett Kontaveit held serve easily in the first game, landing four first serves without losin… [+825 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Zachary B. Wolf, CNN","title":"Analysis: The case against Trump is starting to come into focus. Here's what we know","description":"The Department of Justice doesn't want you to believe what former President Donald Trump says about the classified documents found at Mar-a-Lago. A new filing reveals piecemeal details, which form a picture of the case the DOJ could potentially bring against …","url":"http://us.cnn.com/2022/08/31/politics/doj-trump-mar-a-lago-what-matters/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830232932-doj-response-to-trump-special-master-super-tease.jpg","publishedAt":"2022-08-31T21:37:49Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Josh Campbell and Katie Bo Lillis, CNN","title":"Dissecting 7 key pieces of the Mar-a-Lago photo","description":"Included in the government's latest court filing — in its effort to investigate Donald Trump's handling of classified materials — is a single, tantalizing photograph showing an array of documents found on the property of the former president's Florida resort.","url":"http://us.cnn.com/2022/08/31/politics/mar-a-lago-trump-photo-annotations-dg/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831125707-20220831-trump-classified-docs-super-tease.jpg","publishedAt":"2022-08-31T20:07:47Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb and Tierney Sneed, CNN","title":"Trump's attorneys face scrutiny over level of cooperation with Justice Department on classified docs","description":"The Justice Department's court filing Tuesday laying out the case that classified documents had been concealed at Mar-a-Lago raises new scrutiny for former President Donald Trump's lawyers who worked with federal investigators to return classified material to…","url":"http://us.cnn.com/2022/08/31/politics/christina-bobb-evan-corcoran/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831114321-christina-bobb-evan-corcoran-split-super-tease.jpg","publishedAt":"2022-08-31T19:38:11Z","content":"(CNN)The Justice Department's court filing Tuesday laying out the case that classified documents had been concealed at Mar-a-Lago raises new scrutiny for former President Donald Trump's lawyers who w… [+5560 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr and Kristen Holmes, CNN","title":"Trump weighs delaying 2024 decision as political and legal troubles grow","description":"Donald Trump is considering waiting until after the November midterms to launch a third presidential campaign as he navigates a widening array of legal troubles and mounting concerns that some of his hand-picked Senate candidates may be weaker than he once th…","url":"http://us.cnn.com/2022/08/31/politics/trump-delaying-2024-decision/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831015309-trump-0831-super-tease.jpg","publishedAt":"2022-08-31T16:00:05Z","content":"(CNN)Donald Trump is considering waiting until after the November midterms to launch a third presidential campaign as he navigates a widening array of legal troubles and mounting concerns that some o… [+9778 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner, CNN","title":"Sarah Palin loses special election for Alaska House seat","description":"Democrat Mary Peltola won the special election to fill Alaska's House seat for the remainder of 2022, according to unofficial results released by the Alaska Division of Elections, thwarting former Gov. Sarah Palin's bid at a political comeback -- at least for…","url":"http://us.cnn.com/2022/08/31/politics/alaska-house-seat-ranked-choice-ballots/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831195058-sarah-palin-mary-peltola-split-super-tease.jpg","publishedAt":"2022-08-31T09:10:43Z","content":"(CNN)Democrat Mary Peltola won the special election to fill Alaska's House seat for the remainder of 2022, according to unofficial results released by the Alaska Division of Elections, thwarting form… [+4944 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"In pictures: Serena Williams' final act","description":"Serena Williams isn't done yet.The 40-year-old tennis great, who has said she will \"evolve away\" from the sport after the US Open, won her opening match at the tournament on Monday, defeating Danka Kovinic 6-3, 6-3 at a packed Arthur Ashe Stadium.Williams has…","url":"http://us.cnn.com/2022/08/29/tennis/gallery/serena-williams-us-open-2022/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220829210653-01-serena-williams-us-open-match-1.jpg?q=w_800,c_fill","publishedAt":"2022-08-30T01:31:17Z","content":"Serena Williams isn't done yet.\r\nThe 40-year-old tennis great, who has said she will \"evolve away\" from the sport after the US Open, won her opening match at the tournament on Monday, defeating Danka… [+570 chars]"}]}