{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Melanie Zanona and Manu Raju, CNN","title":"GOP begins to look for new 2024 candidates amid fears over Trump","description":"A growing number of Republicans are openly cheering for a competitive primary field in 2024 and encouraging candidates to jump into the race, as some in the GOP get increasingly anxious about the idea of Donald Trump becoming their presidential nominee again …","url":"http://us.cnn.com/2022/07/21/politics/republican-primary-2024-candidates/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220713205606-mike-pence-file-062022-super-tease.jpg","publishedAt":"2022-07-21T10:58:15Z","content":"(CNN)A growing number of Republicans are openly cheering for a competitive primary field in 2024 and encouraging candidates to jump into the race, as some in the GOP get increasingly anxious about th… [+7641 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Peter Bergen, CNN National Security Analyst","title":"Opinion: The January 6 hearing witness who should make Trump nervous","description":"Peter Bergen writes that former Trump administration deputy national security adviser Matthew Pottinger's upcoming testimony before the House select committee is expected to provide a climactic final summer public hearing.","url":"http://us.cnn.com/2022/07/21/opinions/matthew-pottinger-january-6-hearing-bergen/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220718204855-matthew-pottinger-file-restricted-013120-super-tease.jpg","publishedAt":"2022-07-21T09:00:50Z","content":"Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. Bergen's new paperback is \"The Cost of Chaos: The Trump Admin… [+6930 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Even as the Jan. 6 committee exposes Trump, he's still trying to steal the last election","description":"Donald Trump keeps proving the House January 6 committee's case.","url":"http://us.cnn.com/2022/07/21/politics/trump-steal-2020-election-jan-6-committee/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220720225400-donald-trump-rally-file-super-tease.jpg","publishedAt":"2022-07-21T04:12:37Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb and Marshall Cohen, CNN","title":"What we know about Trump's inaction during the 187 minutes of January 6","description":"The House January 6 committee's final prime-time hearing Thursday is all about 187 minutes.","url":"http://us.cnn.com/2022/07/20/politics/what-we-learned-trump-187-minutes/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220707130851-trump-speech-january-6-restricted-super-tease.jpg","publishedAt":"2022-07-21T03:07:03Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Hear what a former top Secret Service official thinks about the missing texts - CNN Video","description":"Gordon Heddell, former assistant director at the US Secret Service, joins New Day to discuss the criticism of the agency's handling of recent congressional requests.","url":"http://us.cnn.com/videos/politics/2022/07/20/gordon-heddell-us-secret-service-january-6-text-messages-newday-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220720074824-gordon-heddell-new-day-iso-07-20-2022-super-tease.jpg","publishedAt":"2022-07-21T01:52:32.4794353Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Zahra Ullah, Matthew Chance and Katharina Krebs, CNN","title":"Inside a Russian refugee center, where Ukrainians fear talking about the war that destroyed their lives","description":"Russia's invasion killed their relatives and maimed them; some Ukrainians saw Russian soldiers shoot their dogs dead, but when Russia is the only way out of the war zone, they stay quiet and promise to learn Putin's birthday.","url":"http://us.cnn.com/2022/07/20/europe/russia-ukraine-estonia-refugees/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220720133148-vitalina-stanislav-super-tease.jpeg","publishedAt":"2022-07-21T01:48:42Z","content":"Taganrog, Russia and Tallinn, Estonia (CNN)On a sweltering summer day in July, hundreds of Ukrainians try to rest on metal beds lined up in a basketball court-turned-shelter. Their tales of horror an… [+6471 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ryan Nobles, Zachary Cohen, Annie Grayer and Jamie Gangel, CNN","title":"Jan. 6 committee has outtakes of Trump's message to supporters day after riot","description":"The House select committee investigating the insurrection has in its possession video outtakes of then-President Donald Trump's message to his supporters on January 7, 2021, the day after the riot at the US Capitol.","url":"http://us.cnn.com/2022/07/20/politics/trump-january-7-outtakes-message-supporters-house-hearing/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220720205911-02-donald-trump-jan-7-remarks-screengrab-super-tease.jpg","publishedAt":"2022-07-21T01:05:52Z","content":"(CNN)The House select committee investigating the insurrection has in its possession video outtakes of then-President Donald Trump's message to his supporters on January 7, 2021, the day after the ri… [+1472 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Evan Perez and Kara Scannell, CNN","title":"Federal investigation of Hunter Biden reaches critical juncture, sources say","description":"The federal investigation into Hunter Biden's business activities is nearing a critical juncture as investigators weigh possible charges and prosecutors confront Justice Department guidelines to generally avoid bringing politically sensitive cases close to an…","url":"http://us.cnn.com/2022/07/20/politics/hunter-biden-investigation-critical-juncture/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220720105426-hunter-biden-0707-restricted-super-tease.jpg","publishedAt":"2022-07-20T23:17:41Z","content":"Washington (CNN)The federal investigation into Hunter Biden's business activities is nearing a critical juncture as investigators weigh possible charges and prosecutors confront Justice Department gu… [+5714 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ali Zaslav, Manu Raju, Ted Barrett, Morgan Rimmer, Jessica Dean and Kristin Wilson, CNN","title":"CNN asked all 50 GOP senators if they will support the same-sex marriage bill. Here's where they stand.","description":"CNN asked all 50 Republicans where they stand on legislation that will to codify same-sex marriage into federal law.","url":"http://us.cnn.com/2022/07/20/politics/gop-senators-same-sex-marriage/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701112212-us-capitol-0629-super-tease.jpg","publishedAt":"2022-07-20T21:47:28Z","content":"By Ali Zaslav, Manu Raju, Ted Barrett, Morgan Rimmer, Jessica Dean and Kristin Wilson, CNN\r\nUpdated 5:47 PM ET, Wed July 20, 2022\r\n (CNN)Ten GOP senators are needed to join all 50 Democrats in order … [+9249 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen and Hannah Rabinowitz, CNN","title":"Former Trump White House aide who met with January 6 panel attacks witnesses, lawmakers in profane and sexist rant","description":"A former Trump White House aide who met with the January 6 committee earlier this week went on a profane and sexist rant on a livestream after his testimony, where he railed against the lawmakers and attacked other witnesses, according to audio posted to his …","url":"http://us.cnn.com/2022/07/20/politics/garrett-ziegler-rant/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220719105722-garrett-ziegler-super-tease.jpg","publishedAt":"2022-07-20T21:24:56Z","content":"(CNN)A former Trump White House aide who met with the January 6 committee earlier this week went on a profane and sexist rant on a livestream after his testimony, where he railed against the lawmaker… [+2256 chars]"}]}