{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Former Trump aide calls Trump's CPAC speech 'shameful' - CNN Video","description":"Former Trump aide Alyssa Farah Griffin reacts to former President Donald Trump's speech at CPAC, calling it \"shameful\" that he made light of Cassidy Hutchinson's testimony about the January 6th insurrection.","url":"http://us.cnn.com/videos/politics/2022/08/08/trump-cpac-january-6-alyssa-farah-griffin-brown-nr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220807204606-griffin-trump-split-vpx-super-tease.jpg","publishedAt":"2022-08-08T17:37:34.7210412Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Oliver Darcy","title":"First on CNN: Alex Jones' texts have been turned over to the January 6 committee, source says","description":"Approximately two years' worth of text messages sent and received by Jones have been turned over to the House panel investigating the January 6 insurrection","url":"http://us.cnn.com/2022/08/08/politics/alex-jones-january-6/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220804182656-abogado-sandy-hook-alex-jones-juicio-contradiccion-original-pkg-00025610.png?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-08T17:29:42Z","content":"Approximately two years worth of text messages sent and received by right-wing conspiracy theorist Alex Jones have been turned over to the House select committee investigating the January 6 insurrect… [+2326 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"René Marsh, CNN","title":"Billionaires are funding a massive treasure hunt in Greenland as ice vanishes","description":"Some of the world's richest men are funding a massive treasure hunt in Greenland as sea and land ice melts.","url":"http://us.cnn.com/2022/08/08/world/greenland-melting-mineral-mining-climate/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808122509-04-greenland-melting-mineral-mining-climate-action-super-tease.jpg","publishedAt":"2022-08-08T17:07:12Z","content":"Nuussuaq, Greenland (CNN)Some of the world's richest men are funding a massive treasure hunt, complete with helicopters and transmitters, on the west coast of Greenland.\r\nThe climate crisis is meltin… [+4108 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Dakin Andone and Alta Spells, CNN","title":"Travis McMichael gets 2nd life sentence for federal hate crime conviction in Ahmaud Arbery's killing","description":"Travis McMichael, one of the three White men convicted in the killing of Ahmaud Arbery, was sentenced Monday to life in prison plus 10 years after his federal convictions this year on interference with rights -- a hate crime -- along with attempted kidnapping…","url":"http://us.cnn.com/2022/08/08/us/ahmaud-arbery-hate-crime-federal-sentencing/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/200507042812-ahmaud-arbery-super-tease.jpg","publishedAt":"2022-08-08T16:39:54Z","content":"(CNN)Travis McMichael, one of the three White men convicted in the killing of Ahmaud Arbery, was sentenced Monday to life in prison plus 10 years after his federal convictions this year on interferen… [+3960 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Shania Shelton, CNN","title":"New Yorker: Milley was set to excoriate Trump in unreleased resignation letter drafted after Lafayette Square photo-op","description":"In the wake of then-President Donald Trump's infamous photo-op at the height of the George Floyd protests, Chairman of the Joint Chiefs of Staff Gen. Mark Milley penned a lengthy and vociferous critique of Trump in a resignation letter he ultimately never sen…","url":"http://us.cnn.com/2022/08/08/politics/mark-milley-resignation-letter-lafayette-square/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808111011-01-mark-milley-0621-super-tease.jpg","publishedAt":"2022-08-08T16:13:55Z","content":"(CNN)In the wake of then-President Donald Trump's infamous photo-op at the height of the George Floyd protests, Chairman of the Joint Chiefs of Staff Gen. Mark Milley penned a lengthy and vociferous … [+2334 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Zachary Cohen, Sara Murray","title":"Trump-backed GOP candidate for Michigan AG under criminal investigation for possibly tampering with voting machines, docs say","description":"Michigan's Democratic attorney general is calling for a special prosecutor to investigate her Donald Trump-backed challenger after finding evidence linking him to a potentially criminal plot to seize and tamper with voting machines used in the 2020 election, …","url":"http://us.cnn.com/2022/08/08/politics/matthew-deperno-michigan-attorney-general/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220808112128-01-matthew-deperno.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-08T15:27:41Z","content":"Michigans Democratic attorney general is calling for a special prosecutor to investigate her Donald Trump-backed challenger after finding evidence linking him to a potentially criminal plot to seize … [+5079 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Shania Shelton, CNN","title":"Photos show handwritten notes that Trump apparently ripped up and attempted to flush down toilet","description":"Newly revealed photographs reveal two occasions on which former President Donald Trump apparently flushed documents down the toilet.","url":"http://us.cnn.com/2022/08/08/politics/trump-white-house-notes-toilet-photos-cnntv/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808145314-split-trump-notes-ripped-in-toilet-0822-super-tease.jpg","publishedAt":"2022-08-08T14:35:59Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Nouran Salahieh, CNN","title":"The recent killings of four Muslim men in Albuquerque have shaken the city. Here's what we know","description":"The ambush-style shootings of three Muslim men and the recent killing of a fourth in Albuquerque have alarmed the city's Muslim community and triggered warnings for mosque-goers as police investigate how the shootings may be linked.","url":"http://us.cnn.com/2022/08/08/us/albuquerque-muslim-men-killings-monday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808001741-albuquerque-four-muslim-men-killings-split-super-tease.jpg","publishedAt":"2022-08-08T12:59:24Z","content":"(CNN)The ambush-style shootings of three Muslim men and the recent killing of a fourth in Albuquerque have alarmed the city's Muslim community and triggered warnings for mosque-goers as police invest… [+7752 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Dean Obeidallah","title":"Opinion: The revolting celebration of January 6 at CPAC","description":"Those behind a mock jail cell exhibit at CPAC want you to have sympathy for the worst of the January 6 attackers, writes Dean Obeidallah.","url":"http://us.cnn.com/2022/08/07/opinions/cpac-jail-cell-booth-january-6-obeidallah/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220806170408-cpac-fake-jail-cell-vpx-super-tease.jpeg","publishedAt":"2022-08-08T00:30:03Z","content":"Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5413 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ramishah Maruf","title":"What the Alex Jones trial means for the future of conspiracy culture","description":"The Texas jury's decision last week to have Alex Jones face punitive damages of more than $45 million in a lawsuit filed by the parents of Sandy Hook shooting victim Jesse Lewis was a \"reckoning that was 10 years in the making,\" CNN's chief media corresponden…","url":"http://us.cnn.com/2022/08/07/media/alex-jones-trial-reliable-sources/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220807133005-knowledge-fight-reliable-sources-0807.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-07T18:22:28Z","content":"The Texas jurys decision last weekto have Alex Jones face punitive damages of more than $45 million in a lawsuit filed by the parents of Sandy Hook shooting victim Jesse Lewis was a reckoning that wa… [+2679 chars]"}]}