{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Whitney Wild","title":"Secret Service member returns to US following altercation in Israel","description":"A member of the US Secret Service Counter Assault Team was detained by the Israeli national police in Jerusalem this week after he allegedly assaulted a woman outside of a bar, a source tells CNN, and the Secret Service says the agent is on his way back to th…","url":"http://us.cnn.com/2022/07/13/politics/secret-service-israel/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/170316151322-secret-service-logo.jpg?q=x_0,y_0,h_900,w_1599,c_fill/w_800","publishedAt":"2022-07-13T11:08:41Z","content":"A member of the US Secret Service Counter Assault Team was detained by the Israeli national police in Jerusalem this week after he allegedly assaulted a woman outside of a bar, a source tells CNN, an… [+1133 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By Rob Picheta, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, CNN","title":"Live updates: Sri Lanka in crisis after president flees","description":"Sri Lankan Prime Minister Ranil Wickremesinghe is appointed as the crisis-hit country's acting president, hours after embattled President Gotabaya Rajapaksa fled the country for the Maldives. Follow live updates.","url":"https://www.cnn.com/asia/live-news/sri-lanka-protests-07-13-22-intl/h_0a3180ff65720a99bb8838acfaa8c5c4","urlToImage":"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/9159ec55-79f3-4abf-b057-68a24edff0cd.JPG","publishedAt":"2022-07-13T09:46:52Z","content":"Sri Lanka has been rocked by economic protests that have forced its president to flee and led to chaos in the South Asian country.\r\nHere's a brief guide on what's happening.\r\nWhy are people protestin… [+2472 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Elizabeth Wolfe, Travis Caldwell, Rosa Flores and Rosalina Nieves, CNN","title":"Uvalde school shooting surveillance video fuels scrutiny over a delayed law enforcement response","description":"Surveillance video of law enforcement's response during the Uvalde school massacre reveals the clearest account yet of how officers waited outside an elementary classroom as the gunman continued firing, brutally killing 21 students and teachers on May 24.","url":"http://us.cnn.com/2022/07/13/us/uvalde-shooting-surveillance-video-wednesday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220713004836-01-uvalde-school-shooting-surveillance-video-wednesday-super-tease.jpg","publishedAt":"2022-07-13T08:05:15Z","content":"(CNN)Surveillance video of law enforcement's response during the Uvalde school massacre reveals the clearest account yet of how officers waited outside an elementary classroom as the gunman continued… [+7196 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Diamond and Natasha Bertrand, CNN","title":"Biden embraces a signature Trump achievement on first trip to the Middle East, aiming to bring Israel and Saudi Arabia closer","description":"When President Joe Biden arrives here on Wednesday, he will do something he has never done on a foreign trip: Embrace one of his predecessor's legacy achievements.","url":"http://us.cnn.com/2022/07/13/politics/joe-biden-israel-saudi-arabia-trip/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220712091347-joe-biden-white-house-0708-super-tease.jpg","publishedAt":"2022-07-13T04:05:36Z","content":"Jerusalem (CNN)When President Joe Biden arrives here on Wednesday, he will do something he has never done on a foreign trip: Embrace one of his predecessor's legacy achievements. \r\nWhile much of his … [+14170 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Jan. 6 hearing conjures chilling picture of future Trump tyranny","description":"As their final act nears, the House January 6 hearings have evolved from documenting a stain on history to warning of a violent and tyrannical future that awaits if Donald Trump is allowed to again unleash America's pent-up extremism.","url":"http://us.cnn.com/2022/07/13/politics/jan-6-hearing-future-trump-tyranny/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220712222520-donald-trump-file-070822-super-tease.jpg","publishedAt":"2022-07-13T04:04:59Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen, Jeremy Herb and Zachary Cohen, CNN","title":"Takeaways from the January 6 hearing day 7","description":"The latest hearing from the House select committee investigating the January 6, 2021, insurrection fleshed out the links between former President Donald Trump and the far-right extremist groups that were at the vanguard of the violent effort to stop the trans…","url":"http://us.cnn.com/2022/07/12/politics/january-6-hearing-day-7-takeaways/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220712125450-15-jan-6-hearing-0712-raskin-super-tease.jpg","publishedAt":"2022-07-13T02:44:31Z","content":"(CNN)The latest hearing from the House select committee investigating the January 6, 2021, insurrection fleshed out the links between former President Donald Trump and the far-right extremist groups … [+16678 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Phil Mattingly, CNN","title":"White House seeks to keep focus on the economy with summit as Biden heads to Middle East","description":"Vice President Kamala Harris will welcome a group of state and local officials to the White House on Wednesday as the administration seeks to draw attention to key elements of President Joe Biden's cornerstone legislative achievement.","url":"http://us.cnn.com/2022/07/12/politics/economy-focus-white-house/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220705194309-kamala-harris-file-super-tease.jpg","publishedAt":"2022-07-12T22:39:35Z","content":"(CNN)Vice President Kamala Harris will welcome a group of state and local officials to the White House on Wednesday as the administration seeks to draw attention to key elements of President Joe Bide… [+5512 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Andrew Carey, Abbas Al Lawati","title":"What not to expect from Biden's Jerusalem trip","description":"It has taken President Joe Biden almost eighteen months to schedule a visit to Jerusalem, and the White House has made it clear from the start it has no interest in investing any political capital in re-starting peace negotiations.","url":"http://us.cnn.com/2022/07/11/middleeast/biden-jerusalem-visit-mime-intl/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220711132654-mime-biden-israel.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-11T14:01:29Z","content":"Editors Note: A version of this story first appeared in CNNs Meanwhile in the Middle East newsletter, a three-times-a-week look inside the regions biggest stories. Sign up here.\r\nJerusalem and Abu Dh… [+12075 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Aaron David Miller","title":"Opinion: Biden is heading to the Middle East for one simple reason","description":"Ahead of Biden's upcoming trip to the Middle East, Aaron David Miller unpacks what the President hopes to accomplish, and why he likely chose to stop in Saudi Arabia.","url":"http://us.cnn.com/2022/07/10/opinions/biden-middle-east-trip-miller/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220427154041-biden-boards-af1-file-super-tease.jpg","publishedAt":"2022-07-10T13:43:34Z","content":"Aaron David Miller is a senior fellow at the Carnegie Endowment for International Peace and author of \"The End of Greatness: Why America Can't Have (and Doesn't Want) Another Great President.\" Miller… [+9627 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Areej al-Sadhan","title":"Opinion: My brother is serving 20 years in a Saudi prison. Biden should ask MBS for his release","description":"Areej al-Sadhan writes that as President Joe Biden prepares for his trip to Saudi Arabia, he must use this opportunity to ask for more from Crown Prince Mohammed bin Salman, who undoubtedly sees this meeting as critical to legitimizing his image as a 'reforme…","url":"http://us.cnn.com/2022/07/01/opinions/biden-saudi-arabia-trip-imprisoned-activist-al-sadhan/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220629135959-abdul-al-sadhan.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-01T10:17:36Z","content":"Editors Note: Areej al-Sadhan is a Saudi-American human rights activist, American citizen and sister to Red Crescent humanitarian worker Abdulrahman al-Sadhan. The views expressed in this commentary … [+6123 chars]"}]}