{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Ex-Trump aide says Trump mishandling classified documents - CNN Video","description":"Ex-Trump White House press secretary Stephanie Grisham says the former president did not handle classified documents properly and wasn't pressed up on his staff to handle properly.","url":"http://us.cnn.com/videos/politics/2022/08/09/grisham-trump-mishandled-documents-sot-ebof-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808212550-donald-fbi-pba-super-tease.jpg","publishedAt":"2022-08-09T06:22:21.2515109Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tara Subramaniam, CNN","title":"'A force of nature': Friends, co-stars and fans pay tribute to Olivia Newton-John","description":"Hollywood icons joined fans worldwide to mourn the loss of Olivia Newton-John, the Australian singer and \"Grease\" star, who died Monday at her ranch in Southern California at age 73.","url":"http://us.cnn.com/2022/08/09/entertainment/olivia-newton-john-tributes-intl-hnk/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808225237-02-olivia-newton-john-tributes-intl-hnk-super-tease.jpg","publishedAt":"2022-08-09T05:16:50Z","content":"The whole world will feel this heartbreak today because the entire world felt Olivia's unmatched light. A force for good. A force of nature. Strong and kind. My mentor, my friend, my inspiration, som… [+152 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Nouran Salahieh, CNN","title":"Albuquerque police are trying to piece together what led up to the killings of 4 Muslim men as anxiety spreads within the community","description":"As anxiety swirls and Albuquerque's Muslim community grieves, police investigators are still piecing together what led up to the killings of four Muslim men in the city and whether they are connected.","url":"http://us.cnn.com/2022/08/09/us/albuquerque-muslim-men-killings-tuesday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808001741-albuquerque-four-muslim-men-killings-split-super-tease.jpg","publishedAt":"2022-08-09T05:10:05Z","content":"(CNN)As anxiety swirls and Albuquerque's Muslim community grieves, police investigators are still piecing together what led up to the killings of four Muslim men in the city and whether they are conn… [+6370 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Brian Stelter","title":"How the extraordinary FBI search of Mar-a-Lago was covered across the media landscape","description":"Reporters who cover sensitive beats sometimes have a sense when big news is about to break. But not this time.","url":"http://us.cnn.com/2022/08/09/media/fbi-search-mar-a-lago-reliable-sources/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220809002924-trump-mar-a-lago-resort.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-09T04:40:49Z","content":"A version of this article first appeared in the Reliable Sources newsletter. You can sign up for free right here.\r\nReporters who cover sensitive beats sometimes have a sense when big news is about to… [+6073 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: The extraordinary political storm unleashed by the FBI search of Trump's Florida resort","description":"The FBI search of Donald Trump's Florida resort is an extraordinary, historic development given that it targeted a former President of the United States and set off a political uproar he could use to stoke his likely 2024 White House bid.","url":"http://us.cnn.com/2022/08/09/politics/trump-fbi-search-political-storm-2024-analysis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808234744-trump-fbi-search-political-storm-analysis-super-tease.jpg","publishedAt":"2022-08-09T04:24:30Z","content":"(CNN)The FBI search of Donald Trump's Florida resort is an extraordinary, historic development given that it targeted a former President of the United States and set off a political uproar he could u… [+10567 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Oren Liebermann, CNN","title":"Pentagon acknowledges sending previously undisclosed anti-radar missiles to Ukraine","description":"The Pentagon announced Monday that the US has sent anti-radar missiles for Ukrainian aircraft to target Russian radar systems, marking the first time the Defense Department has acknowledged sending the previously undisclosed missile to Ukraine.","url":"http://us.cnn.com/2022/08/08/politics/anti-radar-missiles-ukraine-russia-pentagon/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808193807-harm-missile-file-super-tease.jpg","publishedAt":"2022-08-09T03:23:10Z","content":"(CNN)The Pentagon announced Monday that the US has sent anti-radar missiles for Ukrainian aircraft to target Russian radar systems, marking the first time the Defense Department has acknowledged send… [+2787 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Chris Cillizza","title":"The vice is tightening around Donald Trump as 2024 decision looms","description":"The FBI's search of Donald Trump's Mar-a-Lago estate on Monday makes one thing crystal clear: The legal vice is tightening around the former President even as he weighs whether to run for president again in 2024.","url":"http://us.cnn.com/2022/08/08/politics/trump-mar-a-lago-fbi-search-analysis/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220808210241-donald-trump-file-080622.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-09T01:11:07Z","content":"The FBIs search of Donald Trumps Mar-a-Lago estate on Monday makes one thing crystal clear: The legal vice is tightening around the former President even as he weighs whether to run for president aga… [+4130 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: 'Has this ever happened?': Ex- FBI official finds FBI search 'astounding' - CNN Video","description":"Former FBI Deputy Director Andrew McCabe reacts to the FBI executing a search warrant at Donald Trump's Mar-a-Lago resort in Palm Beach, Florida, as part of an investigation into the handling of presidential documents, including classified documents, that may…","url":"http://us.cnn.com/videos/politics/2022/08/09/trump-mar-a-lago-fbi-search-warrant-mccabe-ac360-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808205014-mccabe-trump-split-super-tease.jpg","publishedAt":"2022-08-09T01:07:23.6571877Z","content":""},{"source":{"id":"cnn","name":"CNN"},"author":"Katelyn Polantz and Laura Jarrett, CNN","title":"Assessing Trump's risk if he mishandled White House documents","description":"Reports of former President Donald Trump's possible mishandling of federal documents found at his Mar-a-Lago resort have prompted legal experts to handicap: Could Trump be charged with a crime?","url":"http://us.cnn.com/2022/02/11/politics/trump-legal-risk-explainer/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210428114304-01-trump-marine-one-0120-super-tease.jpg","publishedAt":"2022-08-09T00:41:18Z","content":"This story was originally published in February and has been updated following the FBI's search of Trump's home at Mar-a-Lago on August 8, 2022.\r\n (CNN)Reports of former President Donald Trump's poss… [+6105 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kaitlan Collins, CNN","title":"FBI executes search warrant at Mar-a-Lago, Trump says","description":"The FBI executed a search warrant on Monday at Donald Trump's Mar-a-Lago resort in Palm Beach, Florida, the former President confirms to CNN.","url":"http://us.cnn.com/2022/08/08/politics/mar-a-lago-search-warrant-fbi-donald-trump/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220808101326-donald-trump-0806-super-tease.jpg","publishedAt":"2022-08-08T23:01:25Z","content":"(CNN)The FBI executed a search warrant on Monday at Donald Trump's Mar-a-Lago resort in Palm Beach, Florida, the former President confirms to CNN.\r\nThis story is breaking and will be updated."}]}