{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: How Ukrainians are dealing with the sorrows of war - CNN Video","description":"In Bucha, they are now forced to bury the dead with numbers, not names. Six months into this brutal war, Ukrainians are reeling from the impact of past horrors and bracing for new ones.","url":"http://us.cnn.com/videos/world/2022/08/26/mckenzie-bucha-pkg.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220826131758-bucha-pkg---mckenzie-super-tease.jpg","publishedAt":"2022-08-28T12:07:26.7908615Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Melanie Zanona and Manu Raju, CNN","title":"A once-bullish GOP now sees a smaller House majority in its future, presenting a challenge to McCarthy","description":"House Republicans are starting to grow pessimistic about their chances of winning a massive majority in the midterm elections, putting some allies of GOP Leader Kevin McCarthy on edge over his future.","url":"http://us.cnn.com/2022/08/28/politics/kevin-mccarthy-house-gop-midterms/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220426160656-kevin-mccarthy-0121-file-super-tease.jpg","publishedAt":"2022-08-28T12:02:08Z","content":"(CNN)House Republicans are starting to grow pessimistic about their chances of winning a massive majority in the midterm elections, putting some allies of GOP Leader Kevin McCarthy on edge over his f… [+9255 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Attacks around Ukraine's Zaporizhzhia nuclear power plant has experts concerned - CNN Video","description":"Repeated shelling at the Zaporizhzhia nuclear power plant, the largest of its kind in Europe, has raised fears of a potential disaster. Nuclear expert Ross Peel breaks down the threats to the plant.","url":"http://us.cnn.com/videos/world/2022/08/23/zaporizhzhia-nuclear-power-plant-ukraine-concerns-lon-orig-na.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220824160134-zaporizhzhia-nuclear-power-plant-thumbnail-lon-orig-super-tease.jpg","publishedAt":"2022-08-28T11:07:22.8782931Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Steve Contorno, CNN","title":"Crist urges Democratic donors to help stop DeSantis before he becomes too powerful. But Florida is a tough sell","description":"Fresh off winning his party's nomination for governor, Rep. Charlie Crist had a sobering message for Democrats across the country: Send money to Florida or you may end up with President Ron DeSantis someday.","url":"https://www.cnn.com/2022/08/28/politics/charlie-crist-florida-donors-desantis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220826143640-charlie-cris-0823-super-tease.jpg","publishedAt":"2022-08-28T10:01:04Z","content":"(CNN)Fresh off winning his party's nomination for governor, Rep. Charlie Crist had a sobering message for Democrats across the country: Send money to Florida or you may end up with President Ron DeSa… [+9427 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Nouran Salahieh, Paradise Afshar","title":"'Get out now': Mayor urges residents to flee ahead of rising river waters in Mississippi","description":"With Mississippi's Pearl River now expected to crest earlier than originally forecast, threatening to flood streets and creep into homes within the next 48 hours, some Jackson residents are being told to flee.","url":"http://us.cnn.com/2022/08/28/us/mississippi-pearl-river-flood-warning-sunday/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220827222719-02-mississippi-river-flood-sunday.jpg?q=w_800,c_fill","publishedAt":"2022-08-28T05:24:16Z","content":"With Mississippis Pearl River now expected to crest earlier than originally forecast, threatening to flood streets and creep into homes within the next 48 hours, some Jackson residents are being told… [+3799 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Clare Sebastian, CNN","title":"Analysis: 'Slower burn.' Russia dodges economic collapse but the decline has started","description":"Six months after invading Ukraine, Russia is bogged down in a war of attrition it didn't anticipate but it is having success on another front — its oil-dependent economy is in a deep recession but proving far more resilient than expected.","url":"http://us.cnn.com/2022/08/28/business/russia-economy-ukraine-six-months/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220826094219-moscow-red-square-0723-super-tease.jpg","publishedAt":"2022-08-28T04:20:42Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed","title":"Judge says she has 'preliminary intent' to appoint special master to oversee Mar-a-Lago search review","description":"A federal judge scheduled a hearing for Thursday to consider former President Donald Trump's request for a \"special master\" to oversee the FBI's review of evidence seized at Mar-a-Lago.","url":"http://us.cnn.com/2022/08/27/politics/trump-special-master-mar-a-lago-search-review/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220819105852-mar-a-lago-search-file-080822-super-tease.jpg","publishedAt":"2022-08-27T21:55:42Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Rob Picheta, CNN","title":"Darya Dugina's death sheds light on the women fronting Russia's propaganda machine","description":"Darya Dugina, who died in a car bomb explosion outside Moscow, was one of a number of influential Russian women on the front lines of Russia's disinformation war, representing the public face of a wider propaganda effort at home and abroad.","url":"http://us.cnn.com/2022/08/27/europe/darya-dugina-russia-disinformation-women-intl-cmd/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220825141133-05-darya-dugina-russian-disinformation-split-super-tease.jpg","publishedAt":"2022-08-27T15:27:53Z","content":"London (CNN)When a car bomb exploded on the outskirts of Moscow, killing 29-year-old Darya Dugina, the eyes of the West immediately turned to her father, Alexander Dugin -- the ultra-nationalist phil… [+13305 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Oren Liebermann, CNN","title":"How Ukraine is using resistance warfare developed by the US to fight back against Russia","description":"As the war in Ukraine has passed the six-month mark, US and European officials say Ukraine has successfully used a method of resistance warfare developed by US special operations forces to fight back against Russia and bog down its vastly superior military.","url":"http://us.cnn.com/2022/08/27/politics/russia-ukraine-resistance-warfare/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220826110936-03-resistance-operating-concept-liebermann-super-tease.jpg","publishedAt":"2022-08-27T14:36:26Z","content":"(CNN)As the war in Ukraine has passed the six-month mark, US and European officials say Ukraine has successfully used a method of resistance warfare developed by US special operations forces to fight… [+9174 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Anna Cooban, CNN Business","title":"Why is Russia burning off gas worth millions of dollars every day","description":"Russia is burning an estimated $10 million worth of natural gas a day near its border with Finland, analysts say, even as it threatens to push Europe into a winter energy crisis by restricting exports to Germany and other countries.","url":"http://us.cnn.com/2022/08/26/energy/russia-burning-natural-gas/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220826133707-russian-gas-flare-super-tease.jpg","publishedAt":"2022-08-26T14:57:43Z","content":null}]}