{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Daniel Dale, CNN","title":"Analysis: Responding to FBI search, Trump and allies return to his familiar strategy: flood the zone with nonsense","description":"In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strategy for communicating in a crisis: say a whole bunch of nonsense in rapid suc…","url":"http://us.cnn.com/2022/08/13/politics/fact-check-trump-fbi-search-false-misleading-conspiracy-theories/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811132025-05-trump-leaving-trump-tower-081022-super-tease.jpg","publishedAt":"2022-08-13T07:01:29Z","content":"Washington (CNN)In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strate… [+5738 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Paul P. Murphy, Aya Elamroussi","title":"Salman Rushdie remains hospitalized after stabbing attack as venue faces scrutiny over security","description":"The venue where renowned author Salman Rushdie was stabbed Friday had rejected previous recommendations to toughen security measures, two sources told CNN.","url":"http://us.cnn.com/2022/08/13/us/salman-rushdie-attacked-saturday/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220812225601-02-salman-rushdie-attacked-saturday.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-13T06:39:25Z","content":"The venue where renowned author Salman Rushdie was stabbed Friday had rejected previous recommendations to toughen security measures, two sources told CNN. \r\nRushdie, 75, was stabbed at least twice o… [+6051 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Katie Lobosco","title":"What to know about government classification of secrets","description":"The US government has a formal system of protecting information that, if disclosed, could hurt national security. In light of the recent removal of some classified documents from former President Donald Trump's Mar-a-Lago home, here are key things to know abo…","url":"http://us.cnn.com/2022/08/12/politics/government-classified-documents-secrets-scif/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220810084406-01-trump-leaving-trump-tower-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-12T23:52:54Z","content":"The US government has a formal system of protecting information that, if disclosed, could hurt national security. \r\nThe system can apply to documents regarding intelligence activities, foreign relati… [+3514 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Josh Campbell, Jessica Schneider, Donie O'Sullivan and Paul P. Murphy, CNN","title":"FBI investigating 'unprecedented' number of threats against bureau in wake of Mar-a-Lago search","description":"The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of Donald Trump's Mar-a-Lago resort, including against agents listed in court records as being involved in the search, a law enforcem…","url":"http://us.cnn.com/2022/08/12/politics/fbi-threats-maralago-trump-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812183806-fbi-0812-super-tease.jpg","publishedAt":"2022-08-12T23:42:14Z","content":"(CNN)The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of former President Donald Trump's Mar-a-Lago resort, including some… [+2894 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen and Sara Murray, CNN","title":"Key lines from the search warrant and receipt for Trump's Florida home","description":"A federal judge on Friday unsealed the search warrant and property receipt from the FBI search of former President Donald Trump's Mar-a-Lago resort in Palm Beach, Florida.","url":"http://us.cnn.com/2022/08/12/politics/search-warrant-receipt-trump-fbi-maralago-key-lines/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812163049-fbi-search-warrant-mar-a-lago-081222-super-tease.jpg","publishedAt":"2022-08-12T21:14:42Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Katelyn Polantz, Zachary Cohen, Sara Murray and Marshall Cohen, CNN","title":"FBI took 11 sets of classified material from Trump's Mar-a-Lago home while investigating possible Espionage Act violations","description":"The Justice Department removed 11 sets of classified documents from former President Donald Trump's Mar-a-Lago residence while executing a search warrant this week for possible violations of the Espionage Act and other crimes, according to court documents uns…","url":"http://us.cnn.com/2022/08/12/politics/trump-mar-a-lago-investigation/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812095955-06-trump-leaving-trump-tower-0810-super-tease.jpg","publishedAt":"2022-08-12T21:12:42Z","content":"(CNN)The Justice Department removed 11 sets of classified documents from former President Donald Trump's Mar-a-Lago residence while executing a search warrant this week for possible violations of the… [+6487 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Trump's search warrant cites 3 criminal laws, NYT reports. CNN legal analyst breaks down what we know so far - CNN Video","description":"CNN's legal analyst Elie Honig details what's known so far about the FBI's warrant authorizing a search of former President Donald Trump's Mar-a-Lago estate.","url":"http://us.cnn.com/videos/politics/2022/08/12/trump-fbi-mar-a-lago-search-warrant-honig-analysis-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220607092629-elie-honig-lead-0606-super-tease.jpg","publishedAt":"2022-08-12T20:22:30.0377437Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"David Zurawik","title":"Analysis: We thought Murdoch's news outlets were abandoning Trump. Then the FBI searched Mar-a-Lago","description":"If nothing else can be said with certainty about Donald Trump after a week of coverage filled with speculation about the purpose of the FBI search at Mar-a-Lago, it is that he still has the biggest cable TV news channel, Fox News, solidly behind him. He also …","url":"http://us.cnn.com/2022/08/12/media/fox-news-coverage-fbi-mar-a-lago-search/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220810140547-04-trump-leaving-trump-tower-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-12T19:51:30Z","content":"If nothing else can be said with certainty about Donald Trump after a week of coverage filled with speculation about the purpose of the FBI search at Mar-a-Lago, it is that he still has the biggest c… [+6246 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Payton Major, Judson Jones and Brandon Miller, CNN","title":"A disastrous megaflood is coming to California, experts say, and it could be the most expensive natural disaster in history","description":"A new study by the journal Science shows climate change has already doubled the chances of a disastrous flood happening in California in the next four decades. And experts say it would be unlike anything anyone, alive today, has ever experienced.","url":"http://us.cnn.com/2022/08/12/weather/california-megaflood-study/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812105534-06-california-megaflood-study-super-tease.jpg","publishedAt":"2022-08-12T18:43:13Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Holmes Lybrand, Marshall Cohen, Hannah Rabinowitz","title":"Timeline: The Justice Department criminal inquiry into Trump taking classified documents to Mar-a-Lago","description":"The federal criminal investigation into former President Donald Trump's potential mishandling of classified documents ramped up this week in significant and unprecedented fashion, with the FBI executing a search warrant at Trump's home at his Mar-a-Lago resor…","url":"http://us.cnn.com/2022/08/09/politics/doj-investigation-trump-documents-timeline/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220809125524-trump-fbi-investigation-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-09T21:39:12Z","content":"The federal criminal investigation into former President Donald Trumps potential mishandling of classified documents ramped up this week in significant and unprecedented fashion, with the FBI executi… [+6425 chars]"}]}