{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"'I will either save us ... or we'll be found together': Mom ties herself to her kids during flood - CNN Video","description":"Catastrophic flooding slammed parts of eastern Kentucky, killing at least 37 people. Hear survivors share their stories of devastation as their communities begin to rebuild.","url":"http://us.cnn.com/videos/us/2022/08/12/kentucky-flood-survivors-rebuild-orig-aw.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812165931-kentucky-flood-damage-1-super-tease.jpg","publishedAt":"2022-08-14T12:07:31.3470682Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Rachel Janfaza, Ethan Cohen, Melissa Holzberg DePalo, Clara Grudberg, Nicholas Anastacio","title":"Lt. Gov. Josh Green wins Hawaii Democratic gubernatorial nomination, CNN projects","description":"Lt. Gov. Josh Green will win the Democratic nomination for governor in Hawaii, CNN projects.","url":"http://us.cnn.com/2022/08/14/politics/josh-green-hawaii/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220813205546-projection-josh-green.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-14T12:05:49Z","content":"Lt. Gov. Josh Green will win the Democratic nomination for governor in Hawaii, CNN projects.\r\nAs of 7 a.m. ET Sunday, Green was winning 63.7% of the vote, while former Hawaii first lady Vicky Cayetan… [+2286 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Mostafa Salem, Eyad Kourdi, Jorge Engels and Hira Humayun, CNN","title":"Dozens killed in Egypt church fire","description":"At least 41 people were killed, and at least 14 injured after a fire broke out at Abu Sefein church in Cairo's Imbaba neighborhood on Sunday, according to a spokesperson for the Egyptian Coptic Church citing health officials.","url":"http://us.cnn.com/2022/08/14/africa/egypt-fire-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814074625-02-egypt-church-fire-0814-super-tease.jpg","publishedAt":"2022-08-14T11:55:30Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Harry Enten, CNN","title":"Why Liz Cheney is likely on her way to a major defeat","description":"Former President Donald Trump left office over a year and a half ago, and yet he is still dominating the news. Whether it be the FBI searching Mar-a-Lago or the Republican primaries in August, you might forget that President Joe Biden is the one who currently…","url":"http://us.cnn.com/2022/08/14/politics/liz-cheney-wyoming-primary-polling/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220813124649-liz-cheney-0628-resctricted-super-tease.jpg","publishedAt":"2022-08-14T10:00:49Z","content":"(CNN)Former President Donald Trump left office over a year and a half ago, and yet he is still dominating the news. Whether it be the FBI searching Mar-a-Lago or the Republican primaries in August, y… [+7627 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Julia Buckley","title":"Europe's drought could signal the death of river cruising","description":"The unprecedented drought in Europe means that cruising on rivers like the Rhine and the Danube looks set to be \"a thing of the past.\" As water levels drop, more and more tourist destinations are drying up.","url":"http://us.cnn.com/travel/article/europe-drought-river-cruising/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812174731-01-europe-drought-rivers-super-tease.jpg","publishedAt":"2022-08-14T09:59:07Z","content":"(CNN) Just when you thought it was safe to get back in the pandemic-snarled water, Europe is having another cataclysmic summer. This time, it's not pandemic red tape, but what looks set to be the con… [+13081 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Allison Chinchar and Jennifer Gray, CNN Meteorologists","title":"One-third of the food we eat is at risk because the climate crisis is endangering butterflies and bees","description":"Bee populations are declining. More than half of the bat species in the United States are in severe decline or listed as endangered. And international scientists recently announced the monarch butterfly is perilously close to extinction.","url":"http://us.cnn.com/2022/08/14/weather/food-risk-bee-butterfly-pollinator-decline-climate-scn/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812150918-01-food-risk-pollinators-climate-split-super-tease.jpg","publishedAt":"2022-08-14T08:03:30Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Angela Dewan and Toby Hancock, CNN\nPhotos by Toby Hancock and Martin Brown","title":"Apples are baking on branches and hosepipe bans hit millions as England falls into drought","description":"The Taylors have been growing apples in the English county of Essex for more than a century. But 2022 has been a particularly tough chapter in the family's history.","url":"http://us.cnn.com/2022/08/12/uk/uk-england-climate-drought-cmd-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812133554-01-uk-england-climate-drought-cmd-intl-super-tease.jpg","publishedAt":"2022-08-14T07:57:47Z","content":"By Angela Dewan and Toby Hancock, CNNPhotos by Toby Hancock and Martin Brown\r\nUpdated 3:57 AM ET, Sun August 14, 2022\r\nChelmsford and Edenbridge, England (CNN)The Taylors have been growing apples in … [+9119 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Payton Major, Judson Jones and Brandon Miller, CNN","title":"A disastrous megaflood is coming to California, experts say, and it could be the most expensive natural disaster in history","description":"A new study by the journal Science shows climate change has already doubled the chances of a disastrous flood happening in California in the next four decades. And experts say it would be unlike anything anyone, alive today, has ever experienced.","url":"http://us.cnn.com/2022/08/12/weather/california-megaflood-study/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812105534-06-california-megaflood-study-super-tease.jpg","publishedAt":"2022-08-13T17:33:39Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Daniel Dale, CNN","title":"Analysis: Responding to FBI search, Trump and allies return to his familiar strategy: flood the zone with nonsense","description":"In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strategy for communicating in a crisis: say a whole bunch of nonsense in rapid suc…","url":"http://us.cnn.com/2022/08/13/politics/fact-check-trump-fbi-search-false-misleading-conspiracy-theories/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811132025-05-trump-leaving-trump-tower-081022-super-tease.jpg","publishedAt":"2022-08-13T13:02:22Z","content":"Washington (CNN)In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strate… [+5738 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by David A. Andelman","title":"Opinion: Cold showers in Germany, France's air conditioning crackdown are signs of Europe's future","description":"Most of the European Union faces a toxic confluence of high temperatures, higher energy prices and a Russian threat to cut off gas supplies, writes David A. Andelman, and these nations are putting pressure on their citizens to hold down consumption.","url":"http://us.cnn.com/2022/07/31/opinions/europe-climate-challenge-andelman/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220720114720-06-europe-heatwave-super-tease.jpg","publishedAt":"2022-07-31T23:39:05Z","content":"David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+7626 chars]"}]}