{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Photos: Florida Gov. Ron DeSantis","description":"Ron DeSantis, Florida's governor since 2019, is seeking a second term in November. And there might be more in his future as he weighs a potential bid for president in 2024.","url":"http://us.cnn.com/2022/08/11/politics/gallery/ron-desantis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220810221602-01-florida-desantis-gallery-super-tease.jpg","publishedAt":"2022-08-11T04:27:16Z","content":"Florida Gov. Ron DeSantis waves before speaking at a rally in Orlando in 2020.\r\nUpdated 12:27 AM ET, Thu August 11, 2022\r\nFlorida Gov. Ron DeSantis waves before speaking at a rally in Orlando in 2020… [+543 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: The Justice Department is in a no win situation as Trump's fury rages","description":"The FBI and the Justice Department are damned if they do and damned if they don't on the question of whether to promptly explain in public why they searched for missing documents at former President Donald Trump's Florida resort.","url":"http://us.cnn.com/2022/08/11/politics/justice-department-trump-fury-analysis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220810190427-trump-waves-0810-super-tease.jpg","publishedAt":"2022-08-11T04:02:10Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Florida prosecutor suspended by Ron DeSantis speaks out - CNN Video","description":"Florida Gov. Ron DeSantis suspended Tampa's elected prosecutor, Andrew Warren, over a perceived '\"woke\" agenda for pledging to not use his office to go after people who seek and provide abortions. He speaks with CNN's Laura Coates.","url":"http://us.cnn.com/videos/politics/2022/08/05/andrew-warren-suspended-prosecutor-desantis-tampa-florida-abortion-rights-ctn-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804231424-warren-desantis-split-vpx-super-tease.jpg","publishedAt":"2022-08-10T23:37:32.363666Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Claudia Dominguez, CNN","title":"39 homes damaged, three people injured after explosion in Indiana, authorities say","description":"At least 39 homes were damaged and three people were injured after a building exploded in Evansville, Indiana, Evansville Fire Department Chief Mike Connelly said in a news conference on Wednesday.","url":"http://us.cnn.com/2022/08/10/us/evansville-indiana-explosion/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220810141540-indianna-house-explosion-0810-super-tease.jpg","publishedAt":"2022-08-10T21:18:50Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed","title":"Biden faces October deadline to decide whether to help Trump avoid questions in Strzok lawsuit","description":"President Joe Biden's White House has until mid-October to decide if he wants to assert executive privilege and hinder an effort to obtain testimony from former President Donald Trump about Trump's pressure campaign to get a then-top FBI agent fired.","url":"http://us.cnn.com/2022/08/10/politics/biden-trump-strzok-lawsuit-privilege/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180702150133-peter-strzok-0627-super-tease.jpg","publishedAt":"2022-08-10T20:56:54Z","content":"(CNN)President Joe Biden's White House has until mid-October to decide if he wants to assert executive privilege and hinder an effort to obtain testimony from former President Donald Trump about Trum… [+3457 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Steve Contorno, CNN","title":"Ron DeSantis, unconstrained by constitutional checks, is flexing his power in Florida ahead of 2024 decision","description":"When Gov. Ron DeSantis abruptly suspended Tampa's elected prosecutor last week, it was not accomplished in a late-night sacking or buried in a 5 p.m. Friday press release. Rather, DeSantis summoned reporters and cameras for a midday media event, as he does se…","url":"http://us.cnn.com/2022/08/10/politics/ron-desantis-florida-political-power-2024-election/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220810103928-ron-desantis-0722-super-tease.jpg","publishedAt":"2022-08-10T18:20:12Z","content":"(CNN)When Gov. Ron DeSantis abruptly suspended Tampa's elected prosecutor last week, it was not accomplished in a late-night sacking or buried in a 5 p.m. Friday press release. Rather, DeSantis summo… [+9799 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"CNN","title":"Olenivka prison attack: Who really attacked a prison of POWs?","description":"Olenivka prison attack: Russia claims Ukraine used US arms to kill jailed POWs. Evidence tells a different story.","url":"https://www.cnn.com/interactive/2022/08/europe/olenivka-donetsk-prison-attack/index.html","urlToImage":"https://cdn.cnn.com/cnn/interactive/2022/08/europe/olenivka-donetsk-prison-attack/media/images/splash3.jpg","publishedAt":"2022-08-10T12:00:00Z","content":"On the morning of July 29, just hours after more than 50 Ukrainian prisoners of war were killed at a detention center in the Donetsk region, a Russian reporter at the scene displayed remnants of a US… [+15099 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr, Melanie Zanona, Kristen Holmes, Michael Warren","title":"Trump fields calls from Republican allies to speed up 2024 bid after FBI raid","description":"Top Republicans who have spent months trying to dissuade Donald Trump from announcing another presidential campaign before the midterms are coming around to the idea, after an unprecedented search of the former President's Mar-a-Lago property by federal inves…","url":"http://us.cnn.com/2022/08/09/politics/trump-2024-bid/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220809152959-01-trump-cpac-dallas-0806.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-09T21:05:16Z","content":"Top Republicans who have spent months trying to dissuade Donald Trump from announcing another presidential campaign before the midterms are coming around to the idea, after an unprecedented search of… [+13142 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Douglas Heye","title":"Opinion: Republican extremists defending Trump could complicate their party's chances","description":"Once again, breaking news about former President Donald Trump has caused political shockwaves, sending speculation into overdrive on \"what it all means\" for Trump, the GOP and the November elections, writes Doug Heye.","url":"http://us.cnn.com/2022/08/09/opinions/republicans-reaction-trump-fbi-raid-heye/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220809183016-amanpour-trump-katyal-fbi.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-09T20:26:29Z","content":"Editors Note: Douglas Heye is the ex-deputy chief of staff to former House Majority Leader Eric Cantor, a GOP strategist and a CNN political commentator. Follow him on Twitter @dougheye. The opinions… [+4957 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Steve Contorno, CNN","title":"DeSantis suspends Tampa prosecutor who took stance against criminalizing abortion providers","description":"Florida Gov. Ron DeSantis on Thursday suspended Tampa's elected prosecutor, Andrew Warren, for pledging not to use his office to go after people who seek and provide abortions or on doctors that provide gender affirming care to transgender people.","url":"http://us.cnn.com/2022/08/04/politics/desantis-suspends-prosecutor/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804114040-ron-desantis-0722-super-tease.jpg","publishedAt":"2022-08-05T02:42:40Z","content":"(CNN)Florida Gov. Ron DeSantis on Thursday suspended Tampa's elected prosecutor, Andrew Warren, for pledging not to use his office to go after people who seek and provide abortions or on doctors that… [+7089 chars]"}]}