{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Kevin Liptak, CNN","title":"Joe Biden's hugely consequential Covid isolation","description":"A fatigued, runny-nosed President Joe Biden entered Covid solitude on July 21 with his legislative agenda stalled, a standoff brewing with the House speaker and an unfinished plan to kill the world's top terrorist with a drone.","url":"http://us.cnn.com/2022/08/06/politics/joe-biden-consequential-week/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220805144552-04-biden-covid-fraud-bills-080522-super-tease.jpg","publishedAt":"2022-08-06T04:00:24Z","content":"Washington (CNN)A fatigued, runny-nosed President Joe Biden entered Covid solitude on July 21 with his legislative agenda stalled, a standoff brewing with the House speaker and an unfinished plan to … [+13711 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Florida prosecutor suspended by Ron DeSantis speaks out - CNN Video","description":"Florida Gov. Ron DeSantis suspended Tampa's elected prosecutor, Andrew Warren, over a perceived '\"woke\" agenda for pledging to not use his office to go after people who seek and provide abortions. He speaks with CNN's Laura Coates.","url":"http://us.cnn.com/videos/politics/2022/08/05/andrew-warren-suspended-prosecutor-desantis-tampa-florida-abortion-rights-ctn-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804231424-warren-desantis-split-vpx-super-tease.jpg","publishedAt":"2022-08-06T03:22:37.1676399Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Veronica Stracqualursi, Laura Ly and Kiely Westhoff, CNN","title":"Indiana legislature passes bill banning most abortions in the state","description":"The Indiana House and Senate on Friday passed a GOP-sponsored bill that would ban most abortions in the state except in cases of rape and incest.","url":"http://us.cnn.com/2022/08/05/politics/indiana-state-house-abortion-bill/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220805145352-01-indiana-abortion-debate-0805-super-tease.jpg","publishedAt":"2022-08-06T02:27:05Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Haberman: Here's why Trump wants to run in 2024 - CNN Video","description":"New York Times Washington Correspondent and CNN analyst Maggie Haberman explains why she believes Trump may run again for president in 2024, as well as his role in the current Republican primaries.","url":"http://us.cnn.com/videos/politics/2022/08/06/maggie-haberman-trump-2024-election-ac360-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220805204829-maggier-haberman-ac360-super-tease.jpeg","publishedAt":"2022-08-06T01:52:24.8714809Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Adam Wollner, CNN","title":"Analysis: Democrats aren't wasting any time seizing on the abortion issue","description":"After abortion rights advocates prevailed decisively on a Kansas ballot measure this week, Democrats are putting the issue right at the center of their attacks against newly minted Republican nominees in key midterm races.","url":"http://us.cnn.com/2022/08/05/politics/democrats-abortion-issue-midterms/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803142434-01-kansas-abortion-rights-super-tease.jpg","publishedAt":"2022-08-05T22:33:57Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Sonia Moghe, CNN","title":"Michigan prosecutors say accused Oxford High shooter's parents exposed him to chaotic home life","description":"Michigan prosecutors say the parents of accused Oxford High School shooter Ethan Crumbley exposed him to years of \"chaotic, toxic conflict,\" and that they left him in an unstable home often with little supervision, creating a pathway to violence.","url":"http://us.cnn.com/2022/08/05/us/oxford-school-shooter-home-life/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220805135514-jennifer-james-crumbley-0208-file-super-tease.jpg","publishedAt":"2022-08-05T19:34:53Z","content":"(CNN)Michigan prosecutors say the parents of accused Oxford High School shooter Ethan Crumbley exposed him to years of \"chaotic, toxic conflict,\" and that they left him in an unstable home often with… [+3493 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Mary Ziegler and Elizabeth Sepper","title":"Opinion: The coming state-federal showdown over abortion","description":"The federal law requires abortion in some emergency situations where the Texas law would label it a crime, write Mary Ziegler and Elizabeth Sepper. The stage is set for a showdown between the federal government and the states. At stake is the idea that aborti…","url":"http://us.cnn.com/2022/08/05/opinions/state-federal-showdown-abortion-ziegler-sepper/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220522134121-01-abortion-rights-texas-primary-runoffs-2022-super-tease.jpg","publishedAt":"2022-08-05T15:06:34Z","content":"Mary Ziegler is the author of \"Abortion and the Law in America: Roe v. Wade to the Present\" and the forthcoming book \"Dollars for Life: The Anti-Abortion Movement and the Fall of the Republican Estab… [+9008 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: DOJ talks with Trump lawyers mark a grave moment for the ex-President","description":"Liz Cheney has posed the question with which America may have to wrestle for months to come: if there is evidence that ex-President Donald Trump committed crimes in seeking to overturn the 2020 election, what message will it send if he's not charged?","url":"http://us.cnn.com/2022/08/05/politics/donald-trump-january-6-justice-department-probe/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804221807-donald-trump-file-restricted-072622-super-tease.jpg","publishedAt":"2022-08-05T10:00:20Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Steve Contorno, CNN","title":"DeSantis suspends Tampa prosecutor who took stance against criminalizing abortion providers","description":"Florida Gov. Ron DeSantis on Thursday suspended Tampa's elected prosecutor, Andrew Warren, for pledging not to use his office to go after people who seek and provide abortions or on doctors that provide gender affirming care to transgender people.","url":"http://us.cnn.com/2022/08/04/politics/desantis-suspends-prosecutor/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804114040-ron-desantis-0722-super-tease.jpg","publishedAt":"2022-08-05T02:42:40Z","content":"(CNN)Florida Gov. Ron DeSantis on Thursday suspended Tampa's elected prosecutor, Andrew Warren, for pledging not to use his office to go after people who seek and provide abortions or on doctors that… [+7089 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Dan Merica, CNN","title":"'Kansas will not be our last fight': Abortion rights victory gives Democrats new hope for midterms","description":"It isn't often that Democrats look to deep-red Kansas for resounding affirmation. But on Tuesday night, when Kansans overwhelmingly voted to keep protections for abortion rights in their state constitution, that is exactly what happened.","url":"http://www.cnn.com/2022/08/03/politics/democrats-republicans-abortion-elections-kansas/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803152848-04-kansas-abortion-reaction-super-tease.jpg","publishedAt":"2022-08-04T11:34:34Z","content":"(CNN)It isn't often that Democrats look to deep-red Kansas for resounding affirmation. But on Tuesday night, when Kansans overwhelmingly voted to keep protections for abortion rights in their state c… [+7968 chars]"}]}