{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Ashley Strickland, CNN","title":"NASA is ready to 'go' for a second launch attempt of Artemis I today","description":"The uncrewed Artemis I mission is ready for a second chance at launching on a historic journey around the moon. NASA's launch window opens at 2:17 p.m. ET and closes at 4:17 p.m. ET on Saturday.","url":"http://us.cnn.com/2022/09/03/world/nasa-artemis-1-saturday-launch-scn/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830143903-artemis-1-mission-sls-rocket-0830-super-tease.jpg","publishedAt":"2022-09-03T11:32:56Z","content":"Turn to CNN for live coverage from Kennedy Space Center in Florida on Saturday afternoon. Space correspondent Kristin Fisher will bring us moment-by-moment reporting from the launch, along with a tea… [+5122 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Zachary B. Wolf","title":"Yes, the government keeps way too many secrets","description":"We don't yet know what classified documents and information former President Donald Trump took with him to Mar-a-Lago. Here's what one expert had to say about legitimate secrets versus overclassified cover-ups.","url":"http://us.cnn.com/2022/09/03/politics/us-government-secrets-what-matters/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220902171651-20220901-classified-government-gfx.jpg?q=w_800,c_fill","publishedAt":"2022-09-03T10:01:59Z","content":"A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWe dont yet know what classified documents and information former President Donald T… [+16456 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ben Church, CNN","title":"Serena Williams has done it all in tennis, but there's so much more to come","description":"Twenty-seven years on the professional tour, 23 grand slam singles titles and a plethora of records; Serena Williams is leaving tennis as one of the greatest players to ever grace the court.","url":"http://us.cnn.com/2022/09/03/tennis/serena-williams-career-reflection-spt-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902194542-05-serena-open-0902-super-tease.jpg","publishedAt":"2022-09-03T08:57:23Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ella Nilsen, CNN","title":"This city has around 20 days of fresh water left. Officials are racing to find another source","description":"A city in New Mexico has about 20 days of fresh water left, and officials there are scrambling to find another source to prevent cancer-causing particles from flowing out of faucets.","url":"http://us.cnn.com/2022/09/03/us/las-vegas-new-mexico-water-crisis-climate/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902112454-04-las-vegas-new-mexico-water-crisis-super-tease.jpg","publishedAt":"2022-09-03T07:04:22Z","content":"(CNN)A city in New Mexico has about 20 days of fresh water left, and officials there are scrambling to find another source to prevent cancer-causing particles from flowing out of faucets. \r\nThe hills… [+5493 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Trump's former AG Barr: No reason for classified docs to be at Mar-a-Lago  - CNN Video","description":"Former Attorney General William Barr appeared on Fox News to say there is no \"legitimate reason\" for classified documents to have been at Mar-a-Lago and cast doubt on the idea that they had somehow been declassified.","url":"http://us.cnn.com/videos/politics/2022/09/02/bill-barr-fox-mar-a-lago-documents.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/201222172423-02-bill-barr-0210-super-tease.jpg","publishedAt":"2022-09-03T04:07:29.2639288Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jamie Gangel, Kristen Holmes, Jeremy Herb and Evan Perez, CNN","title":"After Mar-a-Lago search, Meadows turns over more texts and emails to Archives","description":"Within a week of the FBI search of former President Donald Trump's Mar-a-Lago resort, former White House chief of staff Mark Meadows handed over texts and emails to the National Archives that he had not previously turned over from his time in the administrati…","url":"http://us.cnn.com/2022/09/02/politics/mark-meadows-texts-emails-national-archives/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902174605-mark-meadows-file-restricted-072522-super-tease.jpg","publishedAt":"2022-09-03T00:05:20Z","content":"(CNN)Within a week of the FBI search of former President Donald Trump's Mar-a-Lago resort, former White House chief of staff Mark Meadows handed over texts and emails to the National Archives that he… [+5577 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Marshall Cohen, CNN","title":"Revelatory moments from the historic Mar-a-Lago special master hearing","description":"A hearing Thursday in West Palm Beach, Florida, was the first chance former President Donald Trump's lawyers had to convince US District Judge Aileen Cannon in person that the FBI search warrant on Mar-a-Lago for government records, including those identified…","url":"http://us.cnn.com/2022/09/02/politics/key-lines-mar-a-lago-special-master-hearing/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901175456-01-trump-special-master-request-hearing-super-tease.jpg","publishedAt":"2022-09-02T23:59:48Z","content":"(CNN)A hearing Thursday in West Palm Beach, Florida, was the first chance former President Donald Trump's lawyers had to convince US District Judge Aileen Cannon in person that the FBI search warrant… [+12671 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Katie Bo Lillis, CNN","title":"Mar-a-Lago search inventory shows documents marked as classified mixed with clothes, gifts, press clippings","description":"The search inventory released showed that classified documents had been mixed in with personal items and other materials in the boxes in which they were stored.\nFederal investigators also retrieved more than 11,000 non-classified government documents.","url":"http://us.cnn.com/2022/09/02/politics/judge-releases-full-detailed-inventory-from-the-mar-a-lago-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830182631-02-mar-a-lago-aerial-0810-super-tease.jpg","publishedAt":"2022-09-02T18:35:29Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Annie Grayer, CNN","title":"McCarthy requests documents and testimony from Garland over Mar-a-Lago search","description":"House Minority Leader Kevin McCarthy sent a letter to Attorney General Merrick Garland about the search of former President Donald Trump's home at Mar-a-Lago requesting that Garland and FBI Director Christopher Wray testify in public and provide documents Rep…","url":"http://us.cnn.com/2022/09/02/politics/mccarthy-garland-testimony-documents/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901131549-kevin-mccarthy-0729-super-tease.jpg","publishedAt":"2022-09-02T17:39:04Z","content":"(CNN)House Minority Leader Kevin McCarthy sent a letter to Attorney General Merrick Garland about the search of former President Donald Trump's home at Mar-a-Lago requesting that Garland and FBI Dire… [+2792 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Ted Gup","title":"Opinion: What's really at stake when top secrets are stored at Mar-a-Lago?","description":"The families of those who died while doing undercover work for the CIA come to mind in reading the reports of former President Donald Trump possibly taking ultra-sensitive classified documents, writes Ted Gup.","url":"http://us.cnn.com/2022/08/29/opinions/mar-a-lago-search-secret-documents-gup/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220819153438-mar-a-lago-file-081022-super-tease.jpg","publishedAt":"2022-08-29T11:45:23Z","content":"Ted Gup is the author of \"Nation of Secrets: The Threat to Democracy and the American Way of Life\" and \"The Book of Honor: Covert Lives and Classified Deaths at the CIA.\" In January, he will be teach… [+9162 chars]"}]}