{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Dakin Andone, CNN","title":"Parkland families talk of 'unspeakable loss' as they continue victim impact testimony in gunman's death penalty trial","description":"It wasn't until Anthony Montalto was sitting next to his wife testifying in a Florida courtroom Wednesday that he realized he was wearing the same clothes he wore the last time he took his daughter Gina to a father-daughter dance.","url":"http://us.cnn.com/2022/08/03/us/parkland-trial-nikolas-cruz-victim-testimony/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803083735-01-parkland-victim-impact-statements-0802-super-tease.jpg","publishedAt":"2022-08-03T17:37:13Z","content":"(CNN)It wasn't until Anthony Montalto was sitting next to his wife testifying in a Florida courtroom Wednesday that he realized he was wearing the same clothes he wore the last time he took his daugh… [+4559 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Inside the high-tech drone combat of the Ukraine-Russia war - CNN Video","description":"Hidden under the trees is a Ukrainian drone team, spying on Russian positions. Drones are used to mark the target for artillery strikes, but they are not immune to Russian signal jamming. CNN's Nic Robertson takes a look at some of the high-tech combat tools …","url":"http://us.cnn.com/videos/world/2022/08/03/ukraine-drone-fight-robertson-pkg-intl-intldsk.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803150103-video-thumb-robertson-ukraine-drone-1-super-tease.jpg","publishedAt":"2022-08-03T17:07:22.5175235Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner, Dan Merica and Gregory Krieg, CNN","title":"Six takeaways from Kansas, Michigan, Missouri, Arizona and Washington primaries","description":"Kansas voters handed abortion-rights advocates a massive victory Tuesday, surging to the polls to defeat a measure that would have allowed the GOP-led legislature to impose new restrictions.","url":"http://us.cnn.com/2022/08/02/politics/arizona-michigan-missouri-primary-election-takeaways/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802225702-kansas-amendment-primary-voting-080222-super-tease.jpg","publishedAt":"2022-08-03T14:45:26Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Ex-top Obama strategist says one issue could change crucial elections for Democrats - CNN Video","description":"Kansas voters handed abortion-rights advocates a massive victory Tuesday by rejecting a ballot measure that would have allowed lawmakers to ban abortion in the state. CNN's John King and David Axelrod discuss the primary results and how they affect the electi…","url":"http://us.cnn.com/videos/politics/2022/08/03/primary-results-reject-abortion-bans-democrats-election-axelrod-king-newday-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803093845-axelrod-super-tease.jpg","publishedAt":"2022-08-03T14:22:20.6571777Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Oliver Darcy, CNN Business","title":"Sandy Hook parents testify about the 'hell' Alex Jones inflicted on them through lies about the shooting","description":"The parents of a child who was murdered during the 2012 Sandy Hook shooting delivered emotional testimony in a Texas court on Tuesday, telling a jury that the lies pushed by right-wing conspiracy theorist Alex Jones have stained the legacy of their son and to…","url":"http://us.cnn.com/2022/08/02/media/alex-jones-sandy-hook-trial/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802190614-scarlett-lewis-sandy-hook-trial-super-tease.jpg","publishedAt":"2022-08-03T14:17:12Z","content":"New York (CNN Business)The parents of a child who was murdered during the 2012 Sandy Hook shooting delivered emotional testimony in a Texas court on Tuesday, telling a jury that the lies pushed by ri… [+9429 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner, CNN","title":"Trump-backed Republicans win GOP nominations for US Senate and secretary of state in Arizona, CNN projects","description":"Two Donald Trump-endorsed Republicans who have embraced the former President's 2020 election lies will win the GOP nominations for US Senate and secretary of state in Arizona, CNN projected Wednesday.","url":"http://us.cnn.com/2022/08/03/politics/blake-masters-mark-finchem-gop-nominations-arizona-trump/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803082302-blake-masters-0802-super-tease.jpg","publishedAt":"2022-08-03T12:49:39Z","content":"(CNN)Two Donald Trump-endorsed Republicans who have embraced the former President's 2020 election lies will win the GOP nominations for US Senate and secretary of state in Arizona, CNN projected Wedn… [+2204 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jill Filipovic","title":"Opinion: The Kansas abortion vote should never have happened","description":"Jill Filipovic writes that the result of the election in Kansas Tuesday night in favor of abortion rights is a huge win and it reflects what most Americans believe: abortion is an issue best left to women and their doctors. \"The Kansas vote is a tremendous re…","url":"http://us.cnn.com/2022/08/03/opinions/abortion-rights-win-kansas-filipovic/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220708085805-pm-digital-aborto.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-03T11:41:49Z","content":"Editors Note: Jill Filipovic is a journalist based in New York and author of the book OK Boomer, Lets Talk: How My Generation Got Left Behind. Follow her on Twitter. The opinions expressed in this co… [+6021 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Elizabeth Wolfe, CNN","title":"Officials reveal new details about the 3 sets of human remains found at Lake Mead","description":"For investigators working on the cases of people whose remains were found on the shore of Lake Mead, time is the enemy.","url":"http://us.cnn.com/2022/08/03/us/lake-mead-remains-homicide-investigation-autopsies/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803000012-02-lake-mead-body-barrel-remains-autopsy-super-tease.jpg","publishedAt":"2022-08-03T11:34:55Z","content":"(CNN)For investigators working on the cases of people whose remains were found on the shore of Lake Mead, time is the enemy.\r\nThe bodies -- one of which was found in a corroding barrel with a gunshot… [+7081 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gregory Krieg","title":"A thunderclap in Kansas rattles the abortion rights fight","description":"The wording of the question was convoluted, but the answer was crystal clear: No. Voters in Kansas on Tuesday, in dramatic numbers and by an overwhelming margin, rejected a ballot measure that would have allowed lawmakers to ban abortion in the state.","url":"http://us.cnn.com/2022/08/03/politics/kansas-abortion-amendment-analysis/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220803022004-02-kansas-abortion-vote-080322.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-03T10:13:48Z","content":"The wording of the question was convoluted, but the answer was crystal clear: No. Voters in Kansas on Tuesday, in dramatic numbers and by an overwhelming margin, rejected a ballot measure that would … [+4883 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Donald Judd, CNN","title":"Biden to sign executive order aimed at safeguarding abortion access and provide guidance to health care providers","description":"President Joe Biden will sign another executive order Wednesday as part of his administration's efforts to help ensure access to abortion in light of the Supreme Court's decision earlier this summer to eliminate the federal right to the procedure.","url":"http://us.cnn.com/2022/08/03/politics/joe-biden-abortion-executive-order/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802194547-biden-abortion-0708-super-tease.jpg","publishedAt":"2022-08-03T09:01:42Z","content":"Washington (CNN)President Joe Biden will sign another executive order Wednesday as part of his administration's efforts to help ensure access to abortion in light of the Supreme Court's decision earl… [+2769 chars]"}]}