{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Tapper calls out GOP figures who called story of 10-year-old rape victim a lie - CNN Video","description":"CNN's Jake Tapper calls out Republican officials and right-wing media figures who doubted the veracity of the story of a 10-year-old rape victim in Ohio who had to travel to Indiana to seek an abortion.","url":"http://us.cnn.com/videos/politics/2022/07/14/ohio-10-year-old-rape-victim-abortion-gop-figures-doubt-tapper-lead-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714182747-tapper-monologue-07142022-vpx-super-tease.jpg","publishedAt":"2022-07-17T11:07:30.4386186Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Anti-abortion activist asked if 10-year-old would choose to carry a baby. Hear her answer - CNN Video","description":"At a hearing before the House Judiciary Committee, Rep. Eric Swalwell (D-CA) pushed Catherine Glenn Foster, president and CEO of Americans United for Life, about the case of a 10-year-old who crossed state lines to seek an abortion six weeks into her pregnanc…","url":"http://us.cnn.com/videos/politics/2022/07/14/abortion-hearing-rape-pregnancy-eric-swalwell-catherine-glenn-foster-newsroom-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714123332-catherine-glenn-foster-super-tease.jpg","publishedAt":"2022-07-17T11:07:26.7812923Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Eliott C. McLaughlin, CNN","title":"How the Supreme Court recalibrated the abortion debate in just 3 words","description":"It's not just that US Supreme Court majorities upheld Mississippi's 15-week abortion ban and overturned Roe v. Wade. The opinion also skewed the crux of the conversation going forward -- with just three words.","url":"http://us.cnn.com/2022/07/17/us/abortion-religion-dobbs-roe/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220627212012-scotus-religion-super-tease.jpg","publishedAt":"2022-07-17T07:05:46Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Rosa Flores and Christina Maxouris, CNN","title":"A fact-focused report on the Uvalde school massacre is expected to be released to the public Sunday","description":"A Texas House investigative committee is expected to release a preliminary report Sunday on the Uvalde, Texas, school massacre that left 21 people dead, more than a month after the group began its search for answers.","url":"http://us.cnn.com/2022/07/17/us/texas-house-uvalde-shooting-report/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220527101520-01b-uvalde-leader-news-school-shooting-coverage-super-tease.jpg","publishedAt":"2022-07-17T04:02:33Z","content":"(CNN)A Texas House investigative committee is expected to release a preliminary report Sunday on the Uvalde, Texas, school massacre that left 21 people dead, more than a month after the group began i… [+3600 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kate Bennett, CNN","title":"Jill Biden on President Joe Biden's hindered progress: 'He had so many hopes'","description":"First lady Jill Biden on Saturday voiced frustration about the stalled progress of President Joe Biden's tenure in the White House during a private Democratic National Committee fundraiser.","url":"http://us.cnn.com/2022/07/16/politics/jill-biden-joe-biden-democratic-national-committee-fundraiser/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220716164024-01-jill-biden-joe-biden-democratic-national-committee-fundraiser-super-tease.jpg","publishedAt":"2022-07-17T00:46:31Z","content":"(CNN)First lady Jill Biden on Saturday voiced frustration about the stalled progress of President Joe Biden's tenure in the White House during a private Democratic National Committee fundraiser.\r\nThe… [+3937 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Hannah Sarisohn and Josh Campbell, CNN","title":"Man who allegedly fatally stabbed professional race car driver was killed in a police shooting, authorities say","description":"A man who allegedly fatally stabbed professional race car driver Bobby East at a Southern California gas station was later killed in a police shooting as authorities attempted to arrest him, according to a news release from the Westminster, California, Police…","url":"http://us.cnn.com/2022/07/16/us/bobby-east-nascar-stabbing-death/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220716201027-bobby-east-nascar-stabbing-death-super-tease.jpg","publishedAt":"2022-07-17T00:41:47Z","content":"(CNN)A man who allegedly fatally stabbed professional race car driver Bobby East at a Southern California gas station was later killed in a police shooting as authorities attempted to arrest him, acc… [+1357 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Ariel Edwards-Levy, CNN","title":"Here's what the post-Roe polling says about voters' top issues","description":"Few individual news events have the power to singlehandedly rearrange voters' electoral priorities. But if anything held that possibility, it might have been the Supreme Court's decision to overturn Roe vs. Wade. Beyond its immediate consequences for abortion…","url":"http://us.cnn.com/2022/07/16/politics/top-issue-polls-abortion/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220709223001-protest-dc-super-tease.jpg","publishedAt":"2022-07-16T20:58:35Z","content":"(CNN)Few individual news events have the power to singlehandedly rearrange voters' electoral priorities. But if anything held that possibility, it might have been the Supreme Court's decision to over… [+10216 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Mary Ziegler","title":"Opinion: The horrific story of one little girl in America is a cautionary tale","description":"Historian of abortion Mary Ziegler writes of a 10-year-old Ohio girl whose story sparked a firestorm this week that as \"appalling as the violence perpetrated against her was, it was also shocking to witness the reflexive doubt many had about her story.","url":"http://us.cnn.com/2022/07/16/opinions/ohio-10-year-old-girl-abortion-ziegler/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220714153912-20220715-abortion-data-collection-illustration.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-16T18:08:25Z","content":"Editors Note: Mary Ziegler is the author of Abortion and the Law in America: Roe v. Wade to the Present and Dollars for Life: The Anti-Abortion Movement and the Fall of the Republican Establishment. … [+8497 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb","title":"January 6 committee's investigation stirs up fresh revelations ahead of last planned hearing","description":"The House January 6 committee corroborated key details involving former President Donald Trump's heated exchange with the Secret Service when Trump was told he could not go to the Capitol -- the latest in a string of shocking revelations that have come from t…","url":"http://us.cnn.com/2022/07/16/politics/january-6-committee-latest/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220613104923-03-jan-6-hearing-0613.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-16T10:01:10Z","content":"The House January 6 committee corroborated key details involving former President Donald Trumps heated exchange with the Secret Service when Trump was told he could not go to the Capitol the latest i… [+8095 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Annie Grayer, CNN","title":"Progressives push 10 executive actions on abortion access","description":"The Congressional Progressive Caucus released Friday a new slate of recommended executive actions tailored to protect abortion access and to pressure President Joe Biden to do more as Democrats continue to grapple with how to respond to Roe v. Wade being over…","url":"http://us.cnn.com/2022/07/15/politics/congressional-progressives-caucuses-abortion-executive-actions/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714173837-pramila-jayapal-file-restricted-061622-super-tease.jpg","publishedAt":"2022-07-15T18:03:49Z","content":"(CNN)The Congressional Progressive Caucus released Friday a new slate of recommended executive actions tailored to protect abortion access and to pressure President Joe Biden to do more as Democrats … [+5441 chars]"}]}