{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"'Clown car of a debate': SE Cupp reacts to AZ GOP debate - CNN Video","description":"CNN political commentator SE Cupp reacts to a primary debate between GOP candidates for Arizona's gubernatorial election.","url":"http://us.cnn.com/videos/politics/2022/07/02/arizona-gubernatorial-debate-election-se-cupp-acostanr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220702160134-az-debate-vpx-super-tease.jpg","publishedAt":"2022-07-03T03:37:22.3945872Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Discovery of unserved warrant renews family's call for justice for Emmett Till - CNN Video","description":"The family of Emmett Till is calling for justice. Nearly 70 years ago, the Black 14-year-old's murder helped spur the civil rights movement in America. His family recently discovered an unserved arrest warrant for his accuser, who is still alive today. They h…","url":"http://us.cnn.com/videos/us/2022/07/01/emmett-till-unserved-warrant-found-sidner-pkg-new-day-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/211206180314-01-emmett-till-file-super-tease.jpg","publishedAt":"2022-07-03T03:37:21.6637588Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Liam Reilly, CNN","title":"Group wielding White nationalist flags march along Boston's Freedom Trail on July 4 weekend","description":"A large group of people carrying flags and shields marched along downtown Boston's Freedom Trail Saturday, according to the Boston Police Department -- and video footage of the group obtained by CNN shows the flags bearing the symbol of the White nationalist …","url":"http://us.cnn.com/2022/07/02/us/boston-patriot-front-white-nationalist-group-march/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220702211123-boston-patriot-front-white-nationalist-group-march-super-tease.jpg","publishedAt":"2022-07-03T01:26:40Z","content":"(CNN)A large group of people carrying flags and shields marched along downtown Boston's Freedom Trail Saturday, according to the Boston Police Department -- and video footage of the group obtained by… [+1996 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jarrod Wardwell, CNN","title":"Appeals court sets Richard Glossip's execution date with conviction appeal pending","description":"An Oklahoma appeals court has scheduled the execution date for death row inmate Richard Glossip while his defense rushes to mount a legal battle with newly uncovered evidence they say will prove his innocence in a 1997 murder case.","url":"http://us.cnn.com/2022/07/02/us/richard-glossip-case-execution-date/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220702155343-richard-glossip-case-execution-date-super-tease.jpg","publishedAt":"2022-07-02T21:33:45Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ray Sanchez, CNN","title":"The hot-car death of 22-month-old Cooper Harris was heartbreakingly familiar. His father's unusual murder conviction has now been thrown out","description":"Those nightmarish hot-car death cases often draw national attention. But they rarely lead to criminal charges from prosecutors who must weigh the intent of grieving parents who insist they simply forgot leaving their child in a hot car.","url":"http://us.cnn.com/2022/07/02/us/justin-ross-harris-son-hot-car-death/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220622083444-justin-ross-harris-2016-court-file-super-tease.jpg","publishedAt":"2022-07-02T16:50:11Z","content":"(CNN)On the final morning of his short life, 22-month-old Cooper Harris was up early, at 5:15, an hour before sunrise in the Atlanta suburb where he lived with his parents. \r\nHis father, Justin Ross … [+17229 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Mick Krever, Phil Black, Kostyantin Gak, and Richard Harlow, CNN","title":"Deep in the eastern Ukrainian forest, this group of volunteers waits as Russia's military creeps closer","description":"Maxym is waiting. For just over a month, he and his comrades have been sleeping in earthen dugouts, eating from cans warmed over campfires, and following news of the Russian military advancing just kilometers away.","url":"http://us.cnn.com/2022/07/02/europe/russia-advance-zeroing-intl-cmd/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701154458-02-russia-advancing-east-ukraine-super-tease.jpg","publishedAt":"2022-07-02T10:26:01Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Melissa Alonso and Steve Almasy, CNN","title":"Suspect in eastern Kentucky shootout that killed 3 officers was 'a terrorist on a mission,' sheriff says","description":"The suspect in an hourslong shooting that killed three law enforcement officers and injured several others in eastern Kentucky was charged Friday with several counts of murder, including murder of a police officer, and assault on a service animal, officials s…","url":"http://us.cnn.com/2022/07/01/us/kentucky-law-enforcement-officers-killed/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701145433-01-kentucky-shooting-deputies-killed-super-tease.jpg","publishedAt":"2022-07-02T08:28:33Z","content":"(CNN)The suspect in an hourslong shooting that killed three law enforcement officers and injured several others in eastern Kentucky was charged Friday with several counts of murder, including murder … [+3765 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Rachel Ramirez, CNN","title":"How the climate crisis is forever changing our national parks","description":"When Garrett Dickman drove through Yosemite National Park early this week, he passed through a diverse band of large trees -- conifer, red fir, lodgepole pine -- and noticed a grim pattern: many of the trees were either dead or dying.","url":"http://us.cnn.com/2022/07/02/us/national-parks-climate-extreme-weather-impacts/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701153006-01-national-park-climate-extreme-weather-impacts-super-tease.jpg","publishedAt":"2022-07-02T08:07:19Z","content":"Did flooding in @YellowstoneNPS divert your trip toward Glacier?\r\nBe aware that we are experiencing some flooding too. Also, you will want to read about our vehicle reservation system before you arri… [+144 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr, Kristen Holmes and Melanie Zanona, CNN","title":"Trump weighs early 2024 launch as January 6 committee looms over his future","description":"Former President Donald Trump is anxiously mulling when, exactly, he should announce a presidential run for 2024 -- a decision that has become even more pressing as he tries to reclaim control of his image following a spate of damaging revelations by the Hous…","url":"http://us.cnn.com/2022/07/02/politics/trump-campaign-2024-republican/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701180336-donald-trump-file-0528-super-tease.jpg","publishedAt":"2022-07-02T04:07:20Z","content":"(CNN)Former President Donald Trump is anxiously mulling when, exactly, he should announce a presidential run for 2024 -- a decision that has become even more pressing as he tries to reclaim control o… [+6589 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Reuters","title":"'Cryptoqueen' Ruja Ignatova added to FBI most-wanted list over OneCoin scheme","description":"A German citizen accused of defrauding investors out of $4 billion by selling a fake cryptocurrency called OneCoin has been added to the FBI's list of its ten most-wanted fugitives, US officials said on Thursday.","url":"http://us.cnn.com/2022/07/01/business/ruja-ignatova-cryptoqueen-fbi-most-wanted/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701053701-01-ruja-ignatova-cryptoqueen-fbi-most-wanted-super-tease.jpg","publishedAt":"2022-07-01T10:02:44Z","content":"New YorkA German citizen accused of defrauding investors out of $4 billion by selling a fake cryptocurrency called OneCoin has been added to the FBI's list of its ten most-wanted fugitives, US offici… [+836 chars]"}]}