{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Travis Caldwell and Amy Simonson, CNN","title":"Nearly a month after Uvalde school massacre, mayor launches fierce criticism of state investigators","description":"On May 25, the day after the Uvalde school massacre, state and local leaders gathered at a news conference and voiced their support for the community, vowing to learn more about the circumstances that led to the killings of 19 children and two teachers.","url":"http://us.cnn.com/2022/06/22/us/uvalde-texas-elementary-school-shooting-officials-wednesday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220621232326-uvalde-texas-elementary-school-shooting-officials-wednesday-super-tease.jpg","publishedAt":"2022-06-22T11:54:59Z","content":"(CNN)On May 25, the day after the Uvalde school massacre, state and local leaders gathered at a news conference and voiced their support for the community, vowing to learn more about the circumstance… [+7285 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kevin Liptak, CNN","title":"Biden will call for 3-month suspension of gas tax, though officials acknowledge it 'alone won't fix the problem'","description":"President Joe Biden will call on Congress in a speech Wednesday to suspend federal gasoline and diesel taxes until the end of September, senior administration officials said, framing the move as necessary to provide relief to American consumers but itself not…","url":"http://www.cnn.com/2022/06/22/politics/gas-tax-suspension-biden/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220621200824-biden-gas-prices-super-tease.jpg","publishedAt":"2022-06-22T11:05:04Z","content":"Washington (CNN)President Joe Biden will call on Congress in a speech Wednesday to suspend federal gasoline and diesel taxes until the end of September, senior administration officials said, framing … [+5439 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Chris Cillizza, CNN Editor-at-large","title":"Analysis: The secret of why evangelicals love Herschel Walker (and Donald Trump)","description":"Over the weekend, Herschel Walker addressed the Faith and Freedom Coalition, a gathering of social conservatives in Nashville, Tennessee. His speech came just days after Walker's campaign publicly acknowledged he had three children by women he was not married…","url":"http://us.cnn.com/2022/06/22/politics/herschel-walker-donald-trump-evangelicals-republicans/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220621120255-herschel-walker-0523-file-super-tease.jpg","publishedAt":"2022-06-22T11:01:11Z","content":"(CNN)Over the weekend, Herschel Walker addressed the Faith and Freedom Coalition, a gathering of social conservatives in Nashville, Tennessee. His speech came just days after Walker's campaign public… [+12855 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner, CNN","title":"4 takeaways from Tuesday's elections in Alabama, Virginia, Georgia and DC","description":"Alabama Republican voters sided with the Senate candidate who had former President Donald Trump's endorsement in a primary runoff Tuesday over one of Trump's earlier and most loyal supporters, settling a feud that has roiled the political and right-wing media…","url":"http://us.cnn.com/2022/06/22/politics/alabama-virginia-georgia-dc-primary-takeaways/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220621223846-01-katie-britt-alabama-062122-super-tease.jpg","publishedAt":"2022-06-22T04:00:25Z","content":"(CNN)Alabama Republican voters sided with the Senate candidate who had former President Donald Trump's endorsement in a primary runoff Tuesday over one of Trump's earlier and most loyal supporters, s… [+5443 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"This is what happens if Republicans win Congress - CNN Video","description":"What happens in the 2022 midterm elections will shape the rest of President Biden's first term. CNN's Ryan Nobles explains.","url":"http://us.cnn.com/videos/politics/2022/06/20/2022-midterms-republicans-win-mh-orig.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/150722064354-gop-elephant-super-tease.jpg","publishedAt":"2022-06-22T02:22:35.6551801Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Gregory Krieg, CNN","title":"Georgia Republican voters reject more of Trump's primary picks, while a late pick prevails in Alabama","description":"Another election day in Georgia has brought a further round of defeats for former President Donald Trump and his chosen Republican candidates.","url":"http://us.cnn.com/2022/06/21/politics/alabama-virginia-georgia-dc-primary-election/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220621192229-primary-election-virginia-062122-super-tease.jpg","publishedAt":"2022-06-22T02:17:54Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ethan Cohen, Melissa Holzberg DePalo, Gregory Krieg, Rachel Janfaza","title":"Mayra Flores becomes the first Mexican-born woman sworn in to Congress","description":"Republican Rep. Mayra Flores of Texas on Tuesday became the first Mexican-born woman to be sworn in to Congress.","url":"http://us.cnn.com/2022/06/21/politics/mayra-flores-first-mexican-born-woman-congress/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220621213119-01-mayra-flores-062122.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-06-22T01:54:50Z","content":"Republican Rep. Mayra Flores of Texas on Tuesday became the first Mexican-born woman to be sworn in to Congress. \r\nMy very first day in office and its a memorable one for sure. This is what dreams ar… [+2637 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Lauren Fox, CNN","title":"Here's what's in the bipartisan gun safety bill","description":"The Senate's compromise legislation on gun safety unveiled on Tuesday includes money for school safety, mental health, state crisis intervention programs and incentives for states to include juvenile records in the National Instant Criminal Background Check S…","url":"http://us.cnn.com/2022/06/21/politics/whats-in-senate-gun-reform-bill/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220612121441-capitol-building-0609-super-tease.jpg","publishedAt":"2022-06-22T01:50:27Z","content":"Washington (CNN)The Senate's compromise legislation on gun safety unveiled on Tuesday includes money for school safety, mental health, state crisis intervention programs and incentives for states to … [+3701 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Jill Filipovic","title":"Opinion: Eric Greitens' ad typifies GOP extremists' attitudes toward violence","description":"An ad featuring \"RINO hunting\" by gun-toting GOP Senate candidate Eric Greitens in Missouri is dangerous, particularly when American democracy is in such a fragile state, writes Jill Filipovic.","url":"http://us.cnn.com/2022/06/21/opinions/eric-greitens-missouri-shotgun-ad-filipovic/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220620185405-03-eric-greitens-cillizza-super-tease.jpg","publishedAt":"2022-06-21T22:32:03Z","content":"Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+6660 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By Elise Hammond, Maureen Chowdhury and Melissa Macaya, CNN","title":"Live updates: Alabama, Virginia, Georgia and DC election results","description":"The primary season continues Tuesday with more elections in Virginia, Georgia, Alabama and Washington, DC.\nFollow here for results and the latest news updates.","url":"https://www.cnn.com/politics/live-news/june-21-primary-election-results/h_bd06e6f5c28f1e47555cab2896fd056a","urlToImage":"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2bca0763-c81b-4d88-8fd9-1befac154ea0.jpg","publishedAt":"2022-06-21T12:06:21Z","content":"It is 8 p.m. ET, and polls are closing across Alabama and Washington, DC.\r\nHere are the key races we are tracking: \r\nAlabama: Republicans Katie Britt and Mo Brooks are going head-to-head in a runoff … [+1328 chars]"}]}