{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Angry right-wing protesters confront TX Republican Rep. Dan Crenshaw - CNN Video","description":"Republican Dan Crenshaw responds to an angry right-wing protester after they confronted him and his staff at the Republican Party of Texas Convention.","url":"http://us.cnn.com/videos/politics/2022/06/19/dan-crenshaw-confronted-by-right-wing-protesters-orig-jc.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220619151940-01-dan-crenshaw-confronted-orig-super-tease.jpg","publishedAt":"2022-06-21T11:52:44.1738445Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner and Gregory Krieg, CNN","title":"6 things to watch in Tuesday's elections in Alabama, Virginia, Georgia and DC","description":"Alabamians voting in Tuesday's runoff for the Republican Senate nomination will decide between the establishment candidate former President Donald Trump has endorsed in Katie Britt and the conservative who has long embraced Trump's brand of politics even thou…","url":"http://us.cnn.com/2022/06/21/politics/alabama-virginia-georgia-dc-june21-primary-preview/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220620191857-katie-britt-file-restricted-052422-super-tease.jpg","publishedAt":"2022-06-21T10:00:21Z","content":"(CNN)Alabamians voting in Tuesday's runoff for the Republican Senate nomination will decide between the establishment candidate former President Donald Trump has endorsed in Katie Britt and the conse… [+8930 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, Zachary Cohen, Annie Grayer and Ryan Nobles, CNN","title":"What to watch for in January 6 hearing focused on pressure campaign in the states","description":"The House select committee investigating the January 6, 2021, attack on the US Capitol turns its attention Tuesday to the campaign to pressure state-level officials to overturn the 2020 election results.","url":"http://us.cnn.com/2022/06/21/politics/january-6-hearings-day-4-what-to-expect/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210916164406-04-georgia-criminal-probe-trump-raffensperger-super-tease.jpg","publishedAt":"2022-06-21T09:04:04Z","content":"(CNN)The House select committee investigating the January 6, 2021, attack on the US Capitol turns its attention Tuesday to the campaign to pressure state-level officials to overturn the 2020 election… [+7323 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Stephen Collinson","title":"Texas GOP's election denial underscores the ongoing threat that's central message of Jan. 6 hearings","description":"Last week, the star witness at a January 6 select committee hearing warned that Donald Trump remained a \"clear and present danger\" to American democracy. The Texas Republican Party just showed why, underscoring the critical need for the House investigation in…","url":"http://us.cnn.com/2022/06/21/politics/texas-gop-trump-jan-6-hearings/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220620193723-trump-texas-0527.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-06-21T04:14:31Z","content":"Last week, the star witness at a January 6 select committee hearing warned that Donald Trump remained a clear and present danger to American democracy. The Texas Republican Party just showed why, und… [+8758 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/helen-regan\">Helen Regan</a>, Jeevan Ravindran, Hafsa Khalil and Ed Upright, CNN","title":"Live updates: Russia's war in Ukraine","description":"Russian forces attacking the key eastern city of Severodonetsk have enough firepower to launch a large-scale offensive, the Luhansk regional military chief said. Follow live updates here.","url":"https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-21-22/h_8d65b86c7f945f7fc10583a21483c5b4","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220620133816-lysychansk-file-restricted-061922-super-tease.jpg","publishedAt":"2022-06-21T04:00:10Z","content":"Ukrainian farmers have sown about 25% less land than was in cultivation in 2021, according to officials and independent estimates.\r\nAccording to Markiyan Dmytrasevych, deputy minister of Agrarian Pol… [+2706 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Franchetta Groves","title":"Opinion: A lot of young women worry about the end of Roe. I would celebrate it","description":"College student Franchetta Groves doesn't see the imminent move by the Supreme Court to strike down Roe v. Wade as a setback but rather as a triumph for those such as herself who support anti-abortion positions.","url":"http://us.cnn.com/2022/06/20/opinions/supreme-court-roe-abortion-women-groves/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220615094724-02-supreme-court-protests-0613-super-tease.jpg","publishedAt":"2022-06-20T20:30:54Z","content":"Franchetta Groves is a senior at the Catholic University of America in Washington, D.C. She is the campus marketing chair of the Network of Enlightened Women, a national organization of conservative … [+7284 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Laurence H. Tribe and Dennis Aftergut","title":"Opinion: Republican election sabotage has already started. New Mexico is proof of that","description":"Republican election sabotage, in which GOP officials refuse to certify the winners, has started. It will be up to citizens to block it. We can do that at the ballot box and in other ways, write legal scholars Laurence H. Tribe and Dennis Aftergut.","url":"http://us.cnn.com/2022/06/20/opinions/election-disinformation-republicans-trump-tribe-aftergut/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220606184049-new-mexico-primary-voting-file-060122-super-tease.jpg","publishedAt":"2022-06-20T20:13:10Z","content":"Laurence H. Tribe is the Carl M. Loeb University professor emeritus and a professor of constitutional law emeritus at Harvard Law School. Dennis Aftergut, a former federal prosecutor, is currently of… [+7405 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Chandelis Duster","title":"Texas GOP adopts resolution rejecting 2020 election results","description":"The Republican Party of Texas over the weekend adopted a resolution at its state convention that rejects President Joe Biden as the winner of the 2020 election, further aligning the state party establishment with former President Donald Trump in pushing false…","url":"http://us.cnn.com/2022/06/20/politics/texas-gop-convention-resolution/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220620101153-02-texas-gop-convention-restricted.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-06-20T15:47:55Z","content":"The Republican Party of Texas over the weekend adopted a resolution at its state convention that rejects President Joe Biden as the winner of the 2020 election, further aligning the state party estab… [+2781 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ariane de Vogue, CNN Supreme Court Reporter","title":"Supreme Court rushes to end a term like no other","description":"Because of a blockbuster docket, an unprecedented leak, a fraught political atmosphere and Covid, everything has changed at the Supreme Court.","url":"https://www.cnn.com/2022/06/20/politics/supreme-court-june-preview/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/211201160248-09-supreme-court-abortion-1201-super-tease.jpg","publishedAt":"2022-06-20T12:57:24Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Dean Obeidallah","title":"Opinion: Republicans in Texas just voted to reject democracy","description":"The Texas Republican Convention rejected the outcome of a democratic election, supported bigotry toward the LGBTQ community and imposed far-right beliefs on others by seeking to have them enshrined into law, writes Dean Obeidallah.","url":"http://us.cnn.com/2022/06/19/opinions/texas-gop-convention-obeidallah/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220618005919-john-cornyn-booed-gop-convention-super-tease.jpg","publishedAt":"2022-06-20T12:30:54Z","content":"Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5717 chars]"}]}