{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"","title":"This piece of plastic can turn almost any gun into a machine gun  | CNN","description":"They are the size of a Lego, come in colors of the rainbow and, in seconds, can turn a semi-automatic weapon into a machine gun. CNN's Drew Griffin reports on the illegal conversion devices, called auto sears or switches.","url":"http://us.cnn.com/videos/us/2022/08/30/auto-sear-machine-gun-converter-investigation-shot-spotter-orig.cnn","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220830143347-01-machine-gun-investigation.jpg?q=w_800,c_fill","publishedAt":"2022-08-31T17:52:26.0808279Z","content":"They are the size of a Lego, come in colors of the rainbow and, in seconds, can turn a semi-automatic weapon into a machine gun. CNNs Drew Griffin reports on the illegal conversion devices, called au… [+20 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Katie Lobosco","title":"Everything you need to know about Biden's student loan forgiveness program","description":"Millions of federal student loan borrowers will soon see up to $20,000 of their debt wiped away thanks to a new plan recently announced by President Joe Biden. Here's what borrowers need to know, including when they can apply for forgiveness and if they'll ha…","url":"http://us.cnn.com/2022/08/31/politics/biden-student-loan-forgiveness-faq/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220831094610-graduate-hats-stock.jpg?q=w_800,c_fill","publishedAt":"2022-08-31T17:40:40Z","content":"Millions of federal student loan borrowers will soon see up to $20,000 of their debt wiped away thanks to a new plan announced by President Joe Biden last week. \r\nNot every student loan borrower is e… [+6065 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Priya Krishnakumar and Veronica Stracqualursi, CNN","title":"See where abortion access is banned — and where it's still in limbo","description":"Following the Supreme Court's decision in Dobbs vs. Jackson Women's Health Organization, which turned the issue of abortion access back to the states, nearly one-third of all US states have banned or severely restricted access to the procedure. At least seven…","url":"http://us.cnn.com/2022/08/31/us/abortion-access-restrictions-bans-us/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831074814-hp-only-abortion-restrictions-by-state-png-super-tease.png","publishedAt":"2022-08-31T17:05:25Z","content":"(CNN)Following the Supreme Court's decision in Dobbs vs. Jackson Women's Health Organization, which turned the issue of abortion access back to the states, nearly one-third of all US states have bann… [+866 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Devan Cole, CNN","title":"Judge Aileen Cannon: Trump's request for 'special master' puts one of his judicial appointees in the spotlight","description":"Former President Donald Trump's request for a \"special master\" to oversee the review of evidence gathered in the FBI's search of his Mar-a-Lago estate has thrust one of his own judicial appointees into the middle of his latest legal and political drama.","url":"http://us.cnn.com/2022/08/31/politics/aileen-cannon-trump-special-master/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220829123159-aileen-cannon-screengrab-super-tease.jpg","publishedAt":"2022-08-31T16:15:14Z","content":"(CNN)Former President Donald Trump's request for a \"special master\" to oversee the review of evidence gathered in the FBI's search of his Mar-a-Lago estate has thrust one of his own judicial appointe… [+3046 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr and Kristen Holmes, CNN","title":"Trump weighs delaying 2024 decision as political and legal troubles grow","description":"Donald Trump is considering waiting until after the November midterms to launch a third presidential campaign as he navigates a widening array of legal troubles and mounting concerns that some of his hand-picked Senate candidates may be weaker than he once th…","url":"http://us.cnn.com/2022/08/31/politics/trump-delaying-2024-decision/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831015309-trump-0831-super-tease.jpg","publishedAt":"2022-08-31T16:00:05Z","content":"(CNN)Donald Trump is considering waiting until after the November midterms to launch a third presidential campaign as he navigates a widening array of legal troubles and mounting concerns that some o… [+9778 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"CNN reporter breaks down 'striking' evidence photo from Trump's home - CNN Video","description":"CNN reporter and former FBI special agent Josh Campbell breaks down the evidence photo, which was arranged and taken by law enforcement, that shows classified documents seized from Trump's residence.","url":"http://us.cnn.com/videos/politics/2022/08/31/trump-classified-documents-photo-fbi-campbell-newday-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831100453-campbell-classified-docs-doj-photo-split-super-tease.jpg","publishedAt":"2022-08-31T14:37:24.6678493Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, Marshall Cohen, Tierney Sneed","title":"Takeaways from the historic Justice Department court filing on the Mar-a-Lago search","description":"Former President Donald Trump has pushed an \"incomplete and inaccurate narrative\" in his recent court filings about the Mar-a-Lago search, the Justice Department said in a historic court filing late Tuesday night.","url":"http://us.cnn.com/2022/08/31/politics/takeaways-mar-a-lago-documents/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220830232932-doj-response-to-trump-special-master.jpg?q=w_800,c_fill","publishedAt":"2022-08-31T05:19:41Z","content":"Former President Donald Trump has pushed an incomplete and inaccurate narrative in his recent court filings about the Mar-a-Lago search, the Justice Department said in a historic court filing late Tu… [+6502 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, Tierney Sneed, Marshall Cohen, Evan Perez and Sara Murray, CNN","title":"Justice Department says classified documents at Mar-a-Lago were likely 'concealed and removed' to block investigation","description":"More than 320 classified documents have now been recovered from Mar-a-Lago, the Justice Department said","url":"http://us.cnn.com/2022/08/30/politics/mar-a-lago-justice-department-response/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830232932-doj-response-to-trump-special-master-super-tease.jpg","publishedAt":"2022-08-31T04:31:12Z","content":"(CNN)US government documents were \"likely concealed and removed\" from a storage room at Mar-a-Lago as part of an effort to \"obstruct\" the FBI's investigation into former President Donald Trump's pote… [+8274 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"CNN","title":"READ: The Justice Department's response to Trump's request for a special master","description":"The Justice Department on Tuesday responded to Judge Aileen Cannon of the Southern District of Florida regarding former President Donald Trump's request for a special master to oversee the FBI's review of materials seized in the Mar-a-Lago search.","url":"http://us.cnn.com/2022/08/30/politics/read-doj-response-trump-special-master/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210209035327-doj-seal-super-tease.jpg","publishedAt":"2022-08-31T03:48:17Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Ted Gup","title":"Opinion: What's really at stake when top secrets are stored at Mar-a-Lago?","description":"The families of those who died while doing undercover work for the CIA come to mind in reading the reports of former President Donald Trump possibly taking ultra-sensitive classified documents, writes Ted Gup.","url":"http://us.cnn.com/2022/08/29/opinions/mar-a-lago-search-secret-documents-gup/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220819153438-mar-a-lago-file-081022-super-tease.jpg","publishedAt":"2022-08-29T11:45:23Z","content":"Ted Gup is the author of \"Nation of Secrets: The Threat to Democracy and the American Way of Life\" and \"The Book of Honor: Covert Lives and Classified Deaths at the CIA.\" In January, he will be teach… [+9162 chars]"}]}