{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Mom says son chose extremist group over her - CNN Video","description":"Karen Amsden, whose son is an accused Patriot Front member, tells CNN's Sara Sidner how she wants to win her son back from extremism, and a psychiatrist offers advice for what friends and families in similar situations can do.","url":"http://us.cnn.com/videos/tv/2022/07/01/patriot-front-mother-sidner.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701134113-patriot-front-mother-sidner-00000000-super-tease.png","publishedAt":"2022-07-03T18:07:25.2978628Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Pierre Meilhan, CNN","title":"Several people shot at Copenhagen mall, police say","description":"Several people have been shot at a mall in Copenhagen, according to Danish police.","url":"https://www.cnn.com/2022/07/03/europe/copenhagen-mall-shooting-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220703113516-01-copenhagen-gun-shooting-220703-super-tease.jpg","publishedAt":"2022-07-03T17:43:57Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Donald Judd, CNN","title":"Homeland Security secretary warns migrants against dangerous border journey after smuggling incident leaves 53 dead","description":"Homeland Security Secretary Alejandro Mayorkas on Sunday warned migrants \"not to take the dangerous journey\" and attempt to cross the US-Mexico border after 53 migrants died in a sweltering semitruck in San Antonio, Texas, last week, in what is being called t…","url":"http://us.cnn.com/2022/07/03/politics/alejandro-mayorkas-homeland-security-human-smuggling/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220516171137-alejandro-mayorkas-file-050422-super-tease.jpg","publishedAt":"2022-07-03T17:37:37Z","content":"(CNN)Homeland Security Secretary Alejandro Mayorkas on Sunday warned migrants \"not to take the dangerous journey\" and attempt to cross the US-Mexico border after 53 migrants died in a sweltering semi… [+4622 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ivana Kottasová, Yulia Kesaieva, Hannah Ritchie, Mariya Knight, Radina Gigova and Jonny Hallam, CNN","title":"Ukrainian forces withdraw from Lysychansk, their last holdout in key region","description":"Russia has taken control of Lysychansk, the last city in the Luhansk region in eastern Ukraine that was still under Ukrainian control.","url":"https://www.cnn.com/2022/07/03/europe/russia-ukraine-luhansk-lysychansk-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220703070826-01-lysychansk-ukraine-220703-super-tease.jpg","publishedAt":"2022-07-03T17:16:40Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Sara Sidner, CNN","title":"Mom agonizes about how to reach her son, a man with a Buddha tattoo who turned to hate","description":"Her grown son told her he was going camping. Then he was arrested with accused Patriot Front extremists near an Idaho Pride event. It was a turning point for Karen Amsden, who fears her grandchildren are being indoctrinated.","url":"http://us.cnn.com/2022/07/03/us/mom-tries-to-help-extremist-son-sidner/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220702112829-02-karen-amsden-super-tease.jpg","publishedAt":"2022-07-03T16:59:46Z","content":"If we expect them to ever come out of the proverbial rabbit hole, we have to understand what brought them in in the first place\r\nJoseph Ma Pierre"},{"source":{"id":"cnn","name":"CNN"},"author":"Kevin Liptak","title":"Cheney says January 6 committee could make multiple criminal referrals, including of Trump","description":"The House select committee investigating the January 6 insurrection could make multiple criminal referrals, including of former President Donald Trump, the panel's vice chair, Rep. Liz Cheney, said in an interview broadcast Sunday.","url":"http://us.cnn.com/2022/07/03/politics/liz-cheney-january-6-trump/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220629165703-liz-cheney-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-03T14:54:02Z","content":"The House select committee investigating the January 6 insurrection could make multiple criminal referrals, including of former President Donald Trump, the panels vice chair, Rep. Liz Cheney, said in… [+3919 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"John Blake, CNN","title":"Racism is still a big problem in the US, but this trend offers some hope","description":"Some 94% of Americans now approve of interracial marriage -- a dramatic shift from the era of the civil rights movement. But why is interracial marriage so accepted when other issues of race, like affirmative action and integration, remain fiercely contested?","url":"https://www.cnn.com/2022/07/03/us/interracial-marriage-blake-cec/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701122204-01-interracial-marriage-trend-restricted-super-tease.jpg","publishedAt":"2022-07-03T12:56:07Z","content":"By John Blake, CNN\r\nUpdated 8:56 AM ET, Sun July 3, 2022\r\n (CNN)A White judge tells an interracial couple that \"Almighty God\" placed the races on different continents because he \"did not intend for t… [+12167 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Edward-Isaac Dovere and Steve Contorno, CNN","title":"Gavin Newsom goes on the air against Ron DeSantis as political rivalry grows","description":"Gavin Newsom and Ron DeSantis aren't just avatars for the different futures of their parties, but also for the separate realities blue and red Americans are living in -- two people of opposing viewpoints looking at the exact same set of facts and coming to va…","url":"http://us.cnn.com/2022/07/03/politics/gavin-newsom-ron-desantis-ad-2024/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701152504-newsom-desantis-split-super-tease.jpg","publishedAt":"2022-07-03T12:09:46Z","content":"(CNN)Gavin Newsom and Ron DeSantis aren't just avatars for the different futures of their parties, but also for the separate realities blue and red Americans are living in -- two people of opposing v… [+8977 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Liam Reilly, CNN","title":"Group wielding White nationalist flags march along Boston's Freedom Trail on July 4 weekend","description":"A large group of people carrying flags and shields marched along downtown Boston's Freedom Trail Saturday, according to the Boston Police Department -- and video footage of the group obtained by CNN shows the flags bearing the symbol of the White nationalist …","url":"http://us.cnn.com/2022/07/02/us/boston-patriot-front-white-nationalist-group-march/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220702211123-boston-patriot-front-white-nationalist-group-march-super-tease.jpg","publishedAt":"2022-07-03T01:49:57Z","content":"(CNN)A large group of people carrying flags and shields marched along downtown Boston's Freedom Trail Saturday, according to the Boston Police Department -- and video footage of the group obtained by… [+1996 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Raja Razek, CNN","title":"A group of Texas educators proposed using the term 'involuntary relocation' rather than slavery when teaching 2nd graders","description":"A workgroup developing a second-grade social studies curriculum for the Texas State Board of Education last month suggested using the term \"involuntary relocation\" to describe people who were sold into slavery, the board's chair said, amid national debates on…","url":"http://us.cnn.com/2022/07/02/us/texas-group-proposes-school-slavery-language/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220702001546-01-texas-group-proposes-school-slavery-language-super-tease.jpg","publishedAt":"2022-07-02T05:20:07Z","content":"(CNN)A workgroup developing a second-grade social studies curriculum for the Texas State Board of Education last month suggested using the term \"involuntary relocation\" to describe people who were so… [+4002 chars]"}]}