{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Elizabeth Wolfe, CNN","title":"At least 15 people are dead after Kentucky's catastrophic flooding, and the death toll is expected to rise","description":"Hundreds of homes are ruined and at least eight people are dead after catastrophic flooding in Kentucky on Thursday, and the death toll is expected to keep rising as storms continue Friday and rescuers work around the clock to reach difficult-to-access areas,…","url":"http://us.cnn.com/2022/07/29/weather/kentucky-appalachia-flooding-friday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220729010518-02-kentucky-appalachia-flooding-friday-super-tease.jpg","publishedAt":"2022-07-29T12:05:31Z","content":"(CNN)[Breaking news update, published at 8:05 a.m. ET] \r\nAt least 15 people are dead following flooding in Kentucky, Gov. Andy Beshear told CNN. That number is expected to double, he said, and will i… [+6571 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Dan Merica, CNN","title":"'What happens if they actually do win?': Democrats grapple with efforts to prop up far right candidates","description":"Efforts by Democratic campaigns, committees and outside groups to tilt the playing field in their favor by supporting extremist Republican primary candidates are sparking backlash as other Democrats warn the tactic risks putting conspiracy theorists and elect…","url":"http://us.cnn.com/2022/07/29/politics/democrats-propping-up-republican-candidates/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220727203002-gibbs-mastriano-cox-split-super-tease.jpg","publishedAt":"2022-07-29T11:01:28Z","content":"(CNN)Efforts by Democratic campaigns, committees and outside groups to tilt the playing field in their favor by supporting extremist Republican primary candidates are sparking backlash as other Democ… [+5599 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: How JD Vance could be blowing his Senate campaign - CNN Video","description":"J.D. Vance, then Ohio GOP Senate candidate, is once again being called out for making controversial comments. In today's episode of The Point, CNN's Chris Cillizza breaks down whether the Republican could be dropping the ball in his campaign.","url":"http://us.cnn.com/videos/politics/2022/07/28/jd-vance-divorce-cillizza-the-point-orig.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728104537-jd-vance-marriage-the-point-cillizza-super-tease.jpg","publishedAt":"2022-07-29T09:37:30.6085159Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Gavin Smith","title":"Opinion: Republicans have to make a fateful choice on what kind of party they want to be","description":"Republicans pride themselves as being a \"big tent\" party focused on family values, writes Gavin J. Smith, who  says we're now about to find out just how fundamental its family values really are. With the Senate poised to hold a vote soon on a measure to ensur…","url":"http://us.cnn.com/2022/07/28/opinions/republicans-gays-respect-for-marriage-act-senate-smith/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/150124111424-republican-gop-logo-elephant-super-169.png","publishedAt":"2022-07-29T00:28:01Z","content":"Gavin Smith is a public relations professional and political strategist. He is CEO of Gavin James Public Affairs, a public relations and marketing consulting firm in Lexington, South Carolina. During… [+5039 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Melanie Zanona and Manu Raju, CNN","title":"Internal GOP tension rises as McConnell's deal-making puts him at odds with McCarthy","description":"Senate GOP Leader Mitch McConnell had such a reputation for stopping Democratic legislation and keeping his conference together that he earned the nickname \"the grim reaper.\"","url":"http://us.cnn.com/2022/07/28/politics/mitch-mcconnell-kevin-mccarthy-republican-divisions/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/211209095724-mccarthy-mcconnell-05122021-super-tease.jpg","publishedAt":"2022-07-28T23:27:43Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ariane de Vogue, CNN Supreme Court Reporter","title":"Samuel Alito mocks foreign critics of repealing Roe v. Wade in Rome speech","description":"Justice Samuel Alito, appearing for the first time in public since penning the opinion that reversed Roe v. Wade, mocked foreign criticism of the decision during a speech he delivered in Rome.","url":"http://us.cnn.com/2022/07/28/politics/samuel-alito-religious-liberty-notre-dame-rome/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728135130-01-alito-rome-summit-super-tease.jpg","publishedAt":"2022-07-28T23:25:59Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Brian Rokus, CNN","title":"Group of Republicans and Democrats form new political party to appeal to moderates","description":"A group of former Republican and Democratic officials are forming a new political party called Forward, in an attempt to appeal to what they call the \"moderate, common-sense majority.\"","url":"http://us.cnn.com/2022/07/28/politics/andrew-yang-forward-party-whitman-jolly/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728142818-yang-whitman-split-super-tease.jpg","publishedAt":"2022-07-28T22:58:54Z","content":"(CNN)A group of former Republican and Democratic officials are forming a new political party called Forward, in an attempt to appeal to what they call the \"moderate, common-sense majority.\"\r\n\"Politic… [+4271 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kevin Liptak, Manu Raju, Ella Nilsen, Alex Rogers","title":"How secret negotiations revived Joe Biden's agenda and shocked Washington","description":"It was the middle of the night in Saudi Arabia when word emerged from Washington that President Joe Biden's long-stalled domestic agenda was dead.","url":"http://us.cnn.com/2022/07/28/politics/manchin-schumer-biden-deal/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220715091805-02-manchin-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-28T22:30:18Z","content":"It was the middle of the night in Saudi Arabia when word emerged from Washington that President Joe Bidens long-stalled domestic agenda was dead. \r\nAgain.\r\nThe culprit was familiar. Sen. Joe Manchin,… [+8763 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jessica Dean and Ted Barrett, CNN","title":"Schumer plans burn pits vote on Monday","description":"Republicans continued to express their frustration with their inability to get votes on amendments to the PACT Act, a multi-billion dollar bill that would provide help to millions of veterans who suffered toxic exposure to burn pits during their military serv…","url":"http://us.cnn.com/2022/07/28/politics/chuck-schumer-burn-pits-vote-republican-frustration/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220727123554-schumer-semiconductors-0726-super-tease.jpg","publishedAt":"2022-07-28T22:03:32Z","content":"(CNN)Republicans continued to express their frustration with their inability to get votes on amendments to the PACT Act, a multi-billion dollar bill that would provide help to millions of veterans wh… [+3475 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ella Nilsen, CNN","title":"Clean energy package would be biggest legislative climate investment in US history","description":"Analysis suggests the climate deal would put Biden well on his way to achieving his goal of slashing emissions in half by 2030.","url":"http://us.cnn.com/2022/07/28/politics/climate-deal-joe-manchin/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728110331-wind-farm-solar-power-plant-0321-super-tease.jpg","publishedAt":"2022-07-28T19:47:41Z","content":"(CNN)Sen. Joe Manchin's stunning reversal on a clean energy package has suddenly put Democrats in a position to pass the largest climate investment in US history, and by far the biggest legislative w… [+9267 chars]"}]}