{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Samantha Beech and Dakin Andone, CNN","title":"Jayland Walker suffered at least 60 wounds in fatal police shooting, Akron police chief says, as authorities release bodycam footage","description":"Jayland Walker suffered at least 60 wounds when Akron, Ohio, police officers fatally shot him during a pursuit last week, Akron Police Chief Stephen Mylett said Sunday, citing a medical examiner's report.","url":"http://us.cnn.com/2022/07/03/us/jayland-walker-police-shooting-video/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220703143351-02-akron-police-shooting-super-tease.jpg","publishedAt":"2022-07-04T00:17:30Z","content":"(CNN)Jayland Walker suffered at least 60 wounds when Akron, Ohio, police officers fatally shot him during a pursuit last week, Akron Police Chief Stephen Mylett said Sunday, citing a medical examiner… [+5700 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Cheney says January 6 committee could issue criminal referral for Trump - CNN Video","description":"Rep. Liz Cheney (R-WY) told ABC News that the House Select Committee could issue a criminal referral for former President Trump over his role in the January 6 attack at the Capitol. David French, a senior editor at The Dispatch, discusses what key evidence co…","url":"http://us.cnn.com/videos/politics/2022/07/03/liz-cheney-trump-possible-charges-january-6-rs-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220605120443-01-liz-cheney-super-tease.jpg","publishedAt":"2022-07-03T23:07:20.6983309Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Kim Norgaard, Pierre Meilhan and Jorge Engels, CNN","title":"Several people killed in Copenhagen mall shooting, police say","description":"A shooting at a mall in Copenhagen left several people dead, local police said Sunday.","url":"http://us.cnn.com/2022/07/03/europe/copenhagen-mall-shooting-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220703113516-01-copenhagen-gun-shooting-220703-super-tease.jpg","publishedAt":"2022-07-03T19:33:31Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Kevin Liptak","title":"Cheney says January 6 committee could make multiple criminal referrals, including of Trump","description":"The House select committee investigating the January 6 insurrection could make multiple criminal referrals, including of former President Donald Trump, the panel's vice chair, Rep. Liz Cheney, said in an interview broadcast Sunday.","url":"http://us.cnn.com/2022/07/03/politics/liz-cheney-january-6-trump/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220629165703-liz-cheney-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-03T14:54:02Z","content":"The House select committee investigating the January 6 insurrection could make multiple criminal referrals, including of former President Donald Trump, the panels vice chair, Rep. Liz Cheney, said in… [+3919 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ariane de Vogue and Veronica Stracqualursi, CNN","title":"Supreme Court marshal asked Maryland and Virginia governors to protect justices. Here's what they said.","description":"The marshal of the Supreme Court is asking Maryland officials to direct law enforcement to enforce the state's laws prohibiting picketing outside the homes of Supreme Court justices, according to letters sent to Gov. Larry Hogan and Mark Elrich, the county ex…","url":"http://us.cnn.com/2022/07/02/politics/supreme-court-justices-homes-maryland/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220520094415-us-supreme-court-building-0503-super-tease.jpg","publishedAt":"2022-07-02T18:40:43Z","content":"(CNN)The marshal of the Supreme Court has asked Maryland and Virginia officials to direct law enforcement to enforce state and county laws prohibiting picketing outside the homes of Supreme Court jus… [+6864 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Noah Gray and Zachary Cohen, CNN","title":"Accounts of Trump angrily demanding to go to the Capitol on January 6 circulated in Secret Service over past year","description":"Then-President Donald Trump angrily demanded to go to the US Capitol on January 6, 2021, and berated his protective detail when he didn't get his way, according to two Secret Service sources who say they heard about the incident from multiple agents, includin…","url":"http://us.cnn.com/2022/07/01/politics/secret-service-lunging-incident/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220628220529-donald-trump-january-6-2021-rally-1-super-tease.jpg","publishedAt":"2022-07-02T17:24:23Z","content":"(CNN)Then-President Donald Trump angrily demanded to go to the US Capitol on January 6, 2021, and berated his protective detail when he didn't get his way, according to two Secret Service sources who… [+5595 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Zachary B. Wolf, CNN","title":"Analysis: 11 key points from 6 insurrection hearings","description":"As Americans pause to celebrate their Independence Day, it's worth taking a step back to consider the totality of what we've learned about the attempted insurrection that tried to undo it.","url":"http://us.cnn.com/2022/07/02/politics/january-6-latest-what-matters/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220629094411-cassidy-hutchinson-five-things-super-tease.jpg","publishedAt":"2022-07-02T12:01:47Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Gabby Orr, Kristen Holmes and Melanie Zanona, CNN","title":"Trump weighs early 2024 launch as January 6 committee looms over his future","description":"Former President Donald Trump is anxiously mulling when, exactly, he should announce a presidential run for 2024 -- a decision that has become even more pressing as he tries to reclaim control of his image following a spate of damaging revelations by the Hous…","url":"http://us.cnn.com/2022/07/02/politics/trump-campaign-2024-republican/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701180336-donald-trump-file-0528-super-tease.jpg","publishedAt":"2022-07-02T04:07:20Z","content":"(CNN)Former President Donald Trump is anxiously mulling when, exactly, he should announce a presidential run for 2024 -- a decision that has become even more pressing as he tries to reclaim control o… [+6589 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Zachary Cohen, Ryan Nobles and Annie Grayer, CNN","title":"Meadows intermediary may have tried to influence Hutchinson's testimony to January 6 committee, sources say","description":"One of people who may have been trying to influence Cassidy Hutchinson's testimony did so at the behest of former White House chief of staff Mark Meadows, according to multiple sources familiar with information gathered by the House select committee investiga…","url":"http://us.cnn.com/2022/07/01/politics/mark-meadows-cassidy-hutchinson/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220414161710-mark-meadows-oct-2020-super-tease.jpg","publishedAt":"2022-07-01T20:37:10Z","content":"(CNN)One of people who may have been trying to influence Cassidy Hutchinson's testimony did so at the behest of former White House chief of staff Mark Meadows, according to multiple sources familiar … [+3049 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Julian Zelizer","title":"Opinion: What post-Nixon Congress could teach post-Trump Congress","description":"After the January 6 committee's revelations are over, Congress needs to make sweeping reforms to prevent a future insurrecton, writes Julian Zelizer. The post-Watergate reforms set a good example.","url":"http://us.cnn.com/2022/07/01/opinions/what-post-nixon-congress-did-zelizer/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220629094411-cassidy-hutchinson-five-things.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-01T10:47:12Z","content":"Editors Note: Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, The Presidency of Dona… [+7713 chars]"}]}