{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Devan Cole, Morgan Rimmer and Aaron Pellish, CNN","title":"January 6 committee members preview Tuesday's hearing on role of extremist groups in Capitol riot","description":"Members of the House select committee investigating the January 6, 2021, attack on the US Capitol previewed on Sunday the panel's next public hearing, which will zero in on how the violent mob came together and the role of extremist groups in the deadly insur…","url":"http://us.cnn.com/2022/07/10/politics/january-6-hearing-capitol-riot-preview-cnntv/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220710100448-zoe-lofgren-super-tease.jpeg","publishedAt":"2022-07-10T18:08:23Z","content":"(CNN)Members of the House select committee investigating the January 6, 2021, attack on the US Capitol previewed on Sunday the panel's next public hearing, which will zero in on how the violent mob c… [+3971 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Fareed's take: The West risks failure in Ukraine - CNN Video","description":"CNN's Fareed Zakaria argues that the West's strategy in Ukraine is at risk of failing — and that Kyiv's supporters must take more urgent action and prioritize military support for Ukraine over economic pressure on Russia.","url":"http://us.cnn.com/videos/tv/2022/07/09/exp-gps-0710-fareeds-take.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708214202-exp-gps-0710-fareeds-take-00000000-super-tease.png","publishedAt":"2022-07-10T16:52:22.0583532Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Steve Bannon may now be willing to testify before Jan. 6 committee - CNN Video","description":"Rep. Zoe Lofgren (D-CA) tells CNN's Jake Tapper the January 6 committee has received a letter from Steve Bannon's lawyer saying Bannon, who defied a Congressional subpoena from the committee, is now willing to testify.","url":"http://us.cnn.com/videos/politics/2022/07/10/steve-bannon-lawyer-letter-jan-6-committee-sot-lofgren-sotu-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220710090759-steven-bannon-washington-trump-061522-file-super-tease.jpg","publishedAt":"2022-07-10T14:52:25.8130068Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Sara Murray","title":"Steve Bannon says he's willing to testify before January 6 committee after Trump waives claims of executive privilege","description":"Steve Bannon -- who defied a congressional subpoena and is set to go to trial on criminal contempt charges -- told the House select committee investigating the January 6, 2021, insurrection on Saturday that he is now willing to testify, ideally at a public he…","url":"http://us.cnn.com/2022/07/10/politics/steve-bannon-trump-january-6-executive-privilege/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220710090759-steven-bannon-washington-trump-061522-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-10T14:10:05Z","content":"Steve Bannon who defied a congressional subpoena and is set to go to trial on criminal contempt charges told the House select committee investigating the January 6, 2021, insurrection on Saturday tha… [+2755 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tim Lister and Ivana Kottasová, CNN","title":"Russian strike on residential building kills 15 in eastern Ukraine, officials say","description":"At least 15 people have been killed after a Russian strike hit an apartment bloc in the Donetsk region in eastern Ukraine, Ukrainian authorities said Sunday, adding that many others may still be trapped under the rubble.","url":"http://us.cnn.com/2022/07/10/europe/ukraine-russia-donetsk-attack-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220710053110-04-ukraine-donetsk-apartment-strike-super-tease.jpg","publishedAt":"2022-07-10T13:39:15Z","content":"(CNN)At least 15 people have been killed after a Russian strike hit an apartment bloc in the Donetsk region in eastern Ukraine, Ukrainian authorities said Sunday, adding that many others may still be… [+2456 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Samantha Beech and Christina Maxouris, CNN","title":"A massive blaze on Nantucket Island has damaged a historic hotel and several other buildings","description":"Massachusetts firefighters were battling a large blaze Saturday that was first reported at a hotel on Nantucket Island.","url":"https://www.cnn.com/2022/07/09/us/nantucket-fire-veranda-house-hotel/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220709170915-nantucket-fire-veranda-house-hotel-super-tease.jpg","publishedAt":"2022-07-10T10:27:20Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Maggie Haberman: This is how Trump likely has been consuming the Jan. 6 hearings - CNN Video","description":"CNN political analyst Maggie Haberman describes what she has heard about former President Donald Trump's consumption of the January 6 House select committee hearings in light of ex-Trump White House counsel Pat Cipollone's testimony with the committee.","url":"http://us.cnn.com/videos/politics/2022/07/08/haberman-nyt-trump-cipollone-testimony-2022-jan-6-hearings-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708155106-haberman-vpx-july-9-super-tease.jpg","publishedAt":"2022-07-10T08:52:27.3679891Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen and Avery Lotz, CNN\nCNN Illustration by Alberto Mier","title":"The January 6 insurrection: Minute-by-minute","description":"One and a half years later, the minute-by-minute horrors of the January 6 insurrection, and then-President Donald Trump's role in fomenting the violence, are still coming into focus, thanks in large part to recent public hearings from the House committee inve…","url":"http://us.cnn.com/2022/07/10/politics/jan-6-us-capitol-riot-timeline/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708152115-20220708-trump-january-6-timeline-super-tease.jpg","publishedAt":"2022-07-10T08:03:42Z","content":"Washington (CNN)One and a half years later, the minute-by-minute horrors of the January 6 insurrection, and then-President Donald Trump's role in fomenting the violence, are still coming into focus, … [+11219 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Helen Regan, Emiko Jozuka, Mayumi Maruyama","title":"Who is Tetsuya Yamagami? What we know about the man suspected of shooting Shinzo Abe","description":"Police in Japan have launched a murder investigation into the assassination of former Japanese prime minister Shinzo Abe -- but little is known about the suspect who was arrested at the scene of the fatal shooting on Friday.","url":"http://us.cnn.com/2022/07/09/asia/shinzo-abe-tetsuya-yamagami-explainer-intl-hnk/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220708062848-09-abe-shooting-gallery.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-09T05:39:15Z","content":"Police in Japan have launched a murder investigation into the assassination of former Japanese prime minister Shinzo Abe but little is known about the suspect who was arrested at the scene of the fat… [+2263 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Diane McWhorter","title":"Opinion: Who killed the republic? It's not Donald Trump","description":"The January 6 select committee's hearings have raised hopes that former President Donald Trump won't get away with it this time, writes Diane McWhorter, but she says we can't exhale yet: the GOP primary in her home state of Alabama illustrates how and why old…","url":"http://us.cnn.com/2022/07/06/opinions/trump-liberals-primaries-2022-mcwhorter/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220628220614-donald-trump-january-6-2021-rally-2-super-tease.jpg","publishedAt":"2022-07-06T16:52:22Z","content":"Diane McWhorter is the author of \"Carry Me Home.\" The views expressed here are her own. Read more opinion on CNN.\r\n (CNN)The January 6 commission's emergency hearing last week cracked open an alterna… [+7858 chars]"}]}