{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Nouran Salahieh and Nicki Brown, CNN","title":"More is learned in court of Salman Rushdie's wounds as stabbing suspect pleads not guilty","description":"Renowned author Salman Rushdie remains hospitalized after being repeatedly stabbed during an on-stage attack in western New York that left him at risk of losing an eye, a prosecutor said during court proceedings Saturday.","url":"http://us.cnn.com/2022/08/14/us/salman-rushdie-attack-sunday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220813224535-02-salman-rushdie-attack-sunday-super-tease.jpg","publishedAt":"2022-08-14T04:30:02Z","content":"(CNN)Renowned author Salman Rushdie remains hospitalized after being repeatedly stabbed during an on-stage attack in western New York that left him at risk of losing an eye, a prosecutor said during … [+6182 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jason Kravarik, CNN","title":"They reached the Kobe Bryant crash site, then set off a chain reaction leading to a macabre court case","description":"Amid heavy fog and dense brush, eight members of the Los Angeles County Sheriff's Department set off on foot up the remote terrain of the Santa Monica Mountains.","url":"http://us.cnn.com/2022/08/13/us/kobe-bryant-crash-photos-lawsuit/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220813123942-vanessa-bryant-court-220810-super-tease.jpg","publishedAt":"2022-08-13T22:12:35Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"'Stunning': Ex-official who investigated Clinton reacts to documents found in Trump's home - CNN Video","description":"David Laufman, the former chief of the Department of Justice's counterintelligence division who investigated Hillary Clinton's handling of classified documents, discusses the FBI's search warrant for former President Donald Trump's Mar-a-Lago resort in Florid…","url":"http://us.cnn.com/videos/politics/2022/08/13/trump-search-warrant-espionage-act-laufman-ebof-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220813082738-laufman-trump-split-super-tease.jpg","publishedAt":"2022-08-13T20:37:23.5864429Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Sara Murray, Zachary Cohen and Katelyn Polantz, CNN","title":"House Democratic chairs request federal intelligence damage assessment after classified docs seized at Trump's Mar-a-Lago","description":"The Democratic chairs of the House Intelligence and Oversight Committees have asked federal intelligence leadership for a congressional briefing and for a damage assessment after the FBI seized 11 sets of classified documents at former President Donald Trump'…","url":"http://us.cnn.com/2022/08/13/politics/house-letter-dni-mar-a-lago-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812193133-mar-a-lago-file-081022-super-tease.jpg","publishedAt":"2022-08-13T20:17:57Z","content":"Washington (CNN)The Democratic chairs of the House Intelligence and Oversight Committees have asked federal intelligence leadership for a congressional briefing and for a damage assessment after the … [+2071 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Evan Perez, Kaitlan Collins, Sara Murray","title":"Trump lawyer claimed no classified material was at Mar-a-Lago in signed letter to Justice Department","description":"One of former President Donald Trump's attorneys signed a letter in June asserting that there was no more classified information stored at Trump's Mar-a-Lago residence, according to two sources familiar with the matter.","url":"http://us.cnn.com/2022/08/13/politics/trump-attorney-classified-documents-mar-a-lago-search/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220813101305-mar-a-lago-2021-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-13T18:38:39Z","content":"One of former President Donald Trumps attorneys signed a letter in June asserting that there was no more classified information stored at Trumps Mar-a-Lago residence, according to two sources familia… [+2656 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Josh Campbell, Jessica Schneider, Donie O'Sullivan, Paul P. Murphy and Priscilla Alvarez, CNN","title":"FBI investigating 'unprecedented' number of threats against bureau in wake of Mar-a-Lago search","description":"The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of Donald Trump's Mar-a-Lago resort, including against agents listed in court records as being involved in the search, a law enforcem…","url":"http://us.cnn.com/2022/08/12/politics/fbi-threats-maralago-trump-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812183806-fbi-0812-super-tease.jpg","publishedAt":"2022-08-13T15:18:28Z","content":"(CNN)The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of former President Donald Trump's Mar-a-Lago resort, including some… [+6180 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Daniel Dale, CNN","title":"Analysis: Responding to FBI search, Trump and allies return to his familiar strategy: flood the zone with nonsense","description":"In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strategy for communicating in a crisis: say a whole bunch of nonsense in rapid suc…","url":"http://us.cnn.com/2022/08/13/politics/fact-check-trump-fbi-search-false-misleading-conspiracy-theories/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811132025-05-trump-leaving-trump-tower-081022-super-tease.jpg","publishedAt":"2022-08-13T13:02:22Z","content":"Washington (CNN)In response to the FBI search of former President Donald Trump's home in Florida on Monday, Trump and his allies in Congress and right-wing media have returned to his preferred strate… [+5738 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Sandra Gonzalez and Chloe Melas, CNN","title":"Anne Heche's son mourns mother: 'We have lost a bright light'","description":"Anne Heche's son paid tribute to his mother Friday saying the family had lost \"a kind and most joyful soul, a loving mother, and a loyal friend.\"","url":"http://us.cnn.com/2022/08/12/entertainment/anne-heche-family-statement/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812150233-01-anne-heche-lead-image-super-tease.jpg","publishedAt":"2022-08-13T06:59:56Z","content":"(CNN)Anne Heche's son paid tribute to his mother Friday saying the family had lost \"a kind and most joyful soul, a loving mother, and a loyal friend.\"\r\nIn a statement Heche's son, Homer Laffoon, 20, … [+3276 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Payton Major, Judson Jones and Brandon Miller, CNN","title":"A disastrous megaflood is coming to California, experts say, and it could be the most expensive natural disaster in history","description":"A new study by the journal Science shows climate change has already doubled the chances of a disastrous flood happening in California in the next four decades. And experts say it would be unlike anything anyone, alive today, has ever experienced.","url":"http://us.cnn.com/2022/08/12/weather/california-megaflood-study/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812105534-06-california-megaflood-study-super-tease.jpg","publishedAt":"2022-08-12T18:43:13Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Julian Zelizer, CNN Political Analyst","title":"Opinion: Why Trump thinks the FBI search could be a winner for him","description":"Attacking the legitimacy of our institutions was a central pillar to Donald Trump's rhetoric both as candidate and president, writes Julian Zelizer. Now under multiple investigations, Trump seems to be finding his rhythm once again.","url":"http://us.cnn.com/2022/08/12/opinions/trump-attacks-on-institutions-zelizer/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812090229-pm-digital-trump-super-tease.jpg","publishedAt":"2022-08-12T16:36:55Z","content":"Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, \"The Presidency of Donald J. Trump: … [+6262 chars]"}]}