{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Trump adviser email reveals who needed reassurance over 'fake' electoral plan - CNN Video","description":"The New York Times reporter Maggie Haberman breaks down her findings that reveals dozens of pages by Trump advisers detailing Trump team's 'fake' electoral scheme.","url":"http://us.cnn.com/videos/politics/2022/07/27/new-york-times-report-trump-advisers-email-fake-electoral-scheme-haberman-sot-newday-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220727072717-maggie-haberman-super-tease.jpeg","publishedAt":"2022-07-27T12:37:26.3170597Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"CNN Business","title":"Stocks rise as Fed readies another historic rate hike","description":"Here's the latest news on what stocks are doing.","url":"http://us.cnn.com/business/live-news/stocks-market-today-fed-rate-hike/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220713160243-12-jerome-powell-0615.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-27T11:36:59Z","content":"Investors are uneasy as the Federal Reserve gears up for its latest policy announcement on Wednesday. But their hope is that the central bank and Chair Jerome Powell will keep talking tough, providin… [+1089 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Amanda Tyler","title":"Opinion: Why my faith calls me to fight Christian nationalism","description":"Recent comments about Christian nationalism by Marjorie Taylor Greene and Lauren Boebert mark an alarming turn, writes Amanda Tyler, who argues that Christians have a special responsibility to step up at this critical moment to reject an ideology that distort…","url":"http://us.cnn.com/2022/07/27/opinions/christian-nationalism-marjorie-taylor-greene-tyler/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726180835-marjorie-taylor-greene-0723-super-tease.jpg","publishedAt":"2022-07-27T10:24:01Z","content":"Amanda Tyler is the executive director of BJC (Baptist Joint Committee for Religious Liberty) and the lead organizer of the Christians Against Christian Nationalism campaign. Follow her on Twitter. T… [+7713 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Trump's National Guard comments un-American, ex-police officer says - CNN Video","description":"Former DC Metropolitan police officer Michael Fanone, who was attacked by rioters on January 6, and Anderson Cooper discuss the difference between former President Donald Trump's comments about law enforcement and how he acted on January 6.","url":"http://us.cnn.com/videos/politics/2022/07/27/michael-fanone-trump-not-credible-law-enforcement-ac360-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726212333-anderson-cooper-michael-fanone-split-july-26-2022-super-tease.jpg","publishedAt":"2022-07-27T10:07:44.0185925Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Sarah Boxer, Andi Babineau and Rob Frehse, CNN","title":"Indiana attorney general is investigating the doctor who provided abortion services for a 10-year-old Ohio rape victim, doctor's lawyer says","description":"The Indiana doctor who provided abortion services for a 10-year-old girl who was raped is now being investigated by the state's attorney general, according to a lawyer for the doctor.","url":"http://www.cnn.com/2022/07/27/us/indiana-doctor-child-rape-abortion-ag-investigation/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726215025-indiana-doctor-abortion-attorney-general-investigation-super-tease.jpg","publishedAt":"2022-07-27T08:08:49Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Trump shows his 2024 campaign would take the country down a dark and dangerous road","description":"The last time Donald Trump delivered a major speech in Washington, DC, from outside the White House it unleashed a vicious mob attack. There was no violence this time, but his searing bombast may have heralded the dawn of a new era of American extremism.","url":"http://us.cnn.com/2022/07/27/politics/donald-trump-2024-campaign-dark-speech/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726154920-01-donald-trump-0726-super-tease.jpg","publishedAt":"2022-07-27T07:51:04Z","content":"(CNN)The last time Donald Trump delivered a major speech in Washington, DC, from outside the White House it unleashed a vicious mob attack. There was no violence this time, but his searing bombast ma… [+9798 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/kathleen-magramo\">Kathleen Magramo</a>, CNN","title":"Live updates: Russia's war in Ukraine","description":"Ukrainian officials have confirmed a further attack on a key bridge used to reinforce and resupply occupying Russian forces in southern Ukraine as battles continue in the east of the country. Follow live news updates here.","url":"https://www.cnn.com/europe/live-news/russia-ukraine-war-news-07-27-22/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726103242-odesa-attack-072622-super-tease.jpg","publishedAt":"2022-07-27T07:04:31Z","content":"Ukrainian officials have confirmed a further attack on a key bridge used to reinforce and resupply occupying Russian forces in southern Ukraine\r\nMultiple social media videos published on Tuesday nigh… [+2387 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Evan Perez, CNN","title":"Latest moves suggest DOJ investigation of 2020 election is looking at conduct directly related to Trump and his closest allies","description":"The move by the Justice Department to bring two top aides to former Vice President Mike Pence in front of a federal grand jury is the most aggressive public step taken yet by prosecutors investigating the plots to subvert the 2020 election.","url":"http://us.cnn.com/2022/07/26/politics/justice-department-pence-short-jacob-trump-grand-jury/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726125917-short-trump-jacob-split-super-tease.jpg","publishedAt":"2022-07-27T03:27:09Z","content":"(CNN)The move by the Justice Department to bring two top aides to former Vice President Mike Pence in front of a federal grand jury is the most aggressive public step taken yet by prosecutors investi… [+8925 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jennifer Agiesta, CNN Polling Director","title":"CNN Poll: January 6 hearings haven't changed opinions much, but most agree Trump acted unethically","description":"After the eight public hearings held by the House Select Committee investigating the January 6, 2021, attack on the US Capitol, the American public's views on the state of democracy and the threat posed to it by that event have changed little, according to a …","url":"https://www.cnn.com/2022/07/26/politics/cnn-poll-january-6-trump/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220726150824-jan-6-hearing-file-072122-super-tease.jpg","publishedAt":"2022-07-26T23:50:43Z","content":"(CNN)After the eight public hearings held by the House Select Committee investigating the January 6, 2021, attack on the US Capitol, the American public's views on the state of democracy and the thre… [+6883 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Annie Grayer, CNN","title":"Trump's defense secretary denies there were orders to have 10K troops ready to deploy on January 6","description":"Former acting Defense Secretary Chris Miller told the House select committee investigating the Capitol Hill insurrection that former President Donald Trump never gave him a formal order to have 10,000 troops ready to be deployed to the Capitol on January 6, 2…","url":"http://us.cnn.com/2022/07/26/politics/chris-miller-house-select-committee/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210312133111-chris-miller-file-november-13-2020-01-super-tease.jpeg","publishedAt":"2022-07-26T22:03:05Z","content":"(CNN)Former acting Defense Secretary Chris Miller told the House select committee investigating the Capitol Hill insurrection that former President Donald Trump never gave him a formal order to have … [+1469 chars]"}]}