{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Ex-Trump White House laywer weighs in on Trump's January 6 defense - CNN Video","description":"Ty Cobb, who was former President Donald Trump's attorney in the White House, believes that Trump won't be able to argue \"willful blindness\" to defend his actions on January 6 and that Congress has enough evidence to disqualify him from ever holding office.","url":"http://us.cnn.com/videos/politics/2022/08/03/ty-cobb-trump-january-6-defense-ebof-vpx-sot.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802203015-ty-cobb-donald-trump-split-super-tease.jpg","publishedAt":"2022-08-03T01:07:26.6060489Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, CNN","title":"Pelosi to visit Taiwan's Parliament after US speaker defies Beijing with trip to island","description":"US House Speaker Nancy Pelosi will visit Taiwan's Parliament on Wednesday morning (local time) after she became the highest-ranking American official to visit the island in 25 years.","url":"http://us.cnn.com/2022/08/02/politics/nancy-pelosi-taiwan-parliament-visit/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802201536-pelosi-taiwan-pba-super-tease.jpg","publishedAt":"2022-08-03T00:34:05Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Toomey discusses why he voted against bill to help vets exposed to toxic burn pits - CNN Video","description":"Sen. Pat Toomey (R-PA) was one of a few Republicans who voted to block a bill designed to help US military veterans exposed to toxic burn pits. Toomey says he blocked the bill because of an accounting provision in the bill.","url":"http://us.cnn.com/videos/politics/2022/07/31/pat-toomey-burn-pits-bill-sotu-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220731095930-pat-toomey-jake-tapper-split-super-tease.jpg","publishedAt":"2022-08-02T23:52:29.2152934Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jessica Dean and Ali Zaslav, CNN","title":"Senate passes bill to help veterans affected by burn pits","description":"The Senate voted Tuesday night to pass a long-sought bipartisan legislation to expand health care benefits for millions of veterans exposed to toxic burn pits during their military service, sending the bill to President Joe Biden to sign into law. The final v…","url":"http://us.cnn.com/2022/08/02/politics/senate-vote-burn-pits/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220430151249-three-things-democrats-keep-the-senate-super-tease.jpg","publishedAt":"2022-08-02T23:36:12Z","content":"(CNN)The Senate voted Tuesday night to pass a long-sought bipartisan legislation to expand health care benefits for millions of veterans exposed to toxic burn pits during their military service, send… [+2858 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jennifer Hansler, CNN","title":"US sanctions Putin's reputed girlfriend","description":"The US Treasury Department on Tuesday sanctioned Russian President Vladimir Putin's reputed girlfriend as part of a series of measures targeting Russian elites in the Biden administration's latest attempt to punish the Kremlin for its ongoing war in Ukraine.","url":"http://www.cnn.com/2022/08/02/politics/us-sanctions-alina-kabaeva/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802131208-alina-kabaeva-file-2011-super-tease.jpg","publishedAt":"2022-08-02T21:47:05Z","content":"Washington (CNN)The US Treasury Department on Tuesday sanctioned Russian President Vladimir Putin's reputed girlfriend as part of a series of measures targeting Russian elites in the Biden administra… [+5329 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Oliver Darcy","title":"Sandy Hook parents testify about the 'hell' Alex Jones inflicted on them through lies about the shooting","description":"The parents of a child who was murdered during the 2012 Sandy Hook shooting delivered emotional testimony in a Texas court on Tuesday, telling a jury that the lies pushed by right-wing conspiracy theorist Alex Jones have stained the legacy of their son and to…","url":"http://www.cnn.com/2022/08/02/media/alex-jones-sandy-hook-trial/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220802190614-scarlett-lewis-sandy-hook-trial.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-02T17:19:35Z","content":"The parents of a child who was murdered during the 2012 Sandy Hook shooting delivered emotional testimony in a Texas court on Tuesday, telling a jury that the lies pushed by right-wing conspiracy the… [+9236 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By Elise Hammond, Maureen Chowdhury, Melissa Macaya and <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, CNN","title":"Live updates: Arizona, Michigan and Missouri election results 2022","description":"The primary season continues Tuesday as voters in five states — Kansas, Michigan, Missouri, Arizona and Washington — head to the polls. Follow live results and news updates.","url":"https://www.cnn.com/politics/live-news/primary-election-results-arizona-michigan-missouri-2022/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220719155558-02-maryland-primary-voting-071922-super-tease.jpg","publishedAt":"2022-08-02T12:05:04Z","content":"Republican voters in several key swing states could select election deniers as their nominees for governorships and other top offices in primaries Tuesday.\r\nThe issue is at the heart of high-profile … [+4496 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Zachary B. Wolf, CNN","title":"Analysis: Here's what's jeopardizing burn pits help for vets","description":"The GOP's ringleader obstructing passage of the burn pits legislation is Sen. Pat Toomey of Pennsylvania, a budget hawk who is retiring from the Senate and so is no longer facing voters. What's Toomey's gripe? It's an accounting dispute.","url":"http://us.cnn.com/2022/08/01/politics/veteran-burn-pits-what-matters/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220801135355-01-jon-stewart-burn-pits-protest-0801-super-tease.jpg","publishedAt":"2022-08-01T22:35:21Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Sonnet Swire, CNN","title":"Stewart and veterans slam Republicans over stalling bill to help those affected by toxic burn pits","description":"Comedian Jon Stewart and veterans' advocates on Monday called on senators to stay overnight when they return to Capitol Hill to pass a stalled bill aimed at expanding health care access for military veterans who became ill after being exposed to toxic burn pi…","url":"http://us.cnn.com/2022/08/01/politics/pact-act-senate-jon-stewart/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220728124232-01-jon-stewart-0728-super-tease.jpg","publishedAt":"2022-08-01T16:43:28Z","content":"(CNN)Comedian Jon Stewart and veterans' advocates on Monday called on senators to stay overnight when they return to Capitol Hill to pass a stalled bill aimed at expanding health care access for mili… [+3654 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Dean Obeidallah","title":"Opinion: There's a good reason Jon Stewart is angry at Ted Cruz","description":"While Jon Stewart has been doing whatever he can to help veterans, Dean Obeidallah writes, the GOP has been using the issue -- unsuccessfully -- to try to score political points, leaving veterans in the lurch.","url":"http://us.cnn.com/2022/08/01/opinions/ted-cruz-jon-stewart-veterans-obeidallah/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220731185757-jon-stewart-burn-pits-vpx-super-tease.jpg","publishedAt":"2022-08-01T13:06:14Z","content":"Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+4911 chars]"}]}