{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Mostafa Salem, Adam Pourahmadi","title":"Syria denies holding journalist Austin Tice after White House claims otherwise","description":"The Syrian government denied it is holding or has any information on the whereabouts of Austin Tice, an American journalist who went missing a decade ago while reporting on the Middle Eastern nation's civil war.","url":"http://www.cnn.com/2022/08/17/middleeast/austin-tice-syria-us-intl/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/181204144353-austin-tice-family-photo.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_800","publishedAt":"2022-08-17T11:14:15Z","content":"The Syrian government denied it is holding or has any information on the whereabouts of Austin Tice, an American journalist who went missing a decade ago while reporting on the Middle Eastern nations… [+631 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner and Jeff Zeleny, CNN","title":"Liz Cheney's defeat was 19 months in the making","description":"Rep. Liz Cheney's supporters say her reelection hopes were doomed on January 13, 2021, when a week after the insurrection at the Capitol, she and nine other House Republicans voted to impeach former President Donald Trump.","url":"http://us.cnn.com/2022/08/17/politics/why-liz-cheney-lost/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220816234848-07-liz-cheney-election-night-081622-super-tease.jpg","publishedAt":"2022-08-17T11:02:37Z","content":"Jackson, Wyoming (CNN)Rep. Liz Cheney's supporters say her reelection hopes were doomed on January 13, 2021, when a week after the insurrection at the Capitol, she and nine other House Republicans vo… [+11781 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Wayne Chang, Simone McCarthy, Shawn Deng, CNN, Reuters","title":"China is seeding clouds to replenish its shrinking Yangtze River","description":"The Yangtze had dried up in parts as swaths of China battle drought and the nation's worst heat waves in more than 60 years.","url":"http://us.cnn.com/2022/08/17/asia/china-heat-drought-climate-yangtze-intl/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220817060632-01-china-yangtze-heat-drought.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-17T10:17:37Z","content":"Chinese planes are firing rods into the sky to bring more rainfall to its crucial Yangtze River, which has dried up in parts, as swaths of the nation fall into drought and grapple with the worst heat… [+3627 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Rachel Janfaza, CNN","title":"CNN projects Alaska special election will head to ranked choice voting tabulation","description":"The results of the Alaska special general election to fill the remainder of the late Rep. Don Young's term remain uncertain, as CNN projected none of the candidates on the ballot topped 50% on Tuesday -- a necessary feat given the state's new ranked choice vo…","url":"http://us.cnn.com/2022/08/17/politics/alaska-special-election/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220816193342-sarah-palin-file-080422-super-tease.jpg","publishedAt":"2022-08-17T06:48:29Z","content":"(CNN)The results of the Alaska special general election to fill the remainder of the late Rep. Don Young's term remain uncertain, as CNN projected none of the candidates on the ballot topped 50% on T… [+2723 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Wyoming GOP primary 'a very good night for Donald Trump' - CNN Video","description":"CNN's Nia Malika Henderson and Dana Bash analyze what Rep. Liz Cheney's loss in the Wyoming GOP primary means for Donald Trump and the state of the Republican party.","url":"http://us.cnn.com/videos/politics/2022/08/17/wyoming-liz-cheney-loses-a-very-good-night-for-donald-trump-sot-dlt-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnn/.e/img/4.0/logos/cnn_logo_social.jpg","publishedAt":"2022-08-17T04:22:20.5782511Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Eliza Mackintosh and Yuliia Presniakova, CNN","title":"He was abducted and tortured by Russian soldiers. Then they started using his Instagram to push pro-Kremlin propaganda","description":"Before the war broke out, Igor Kurayan, a 55-year-old from the southern Ukrainian port city of Kherson, shared frequent gardening updates on social media.","url":"http://us.cnn.com/2022/08/17/europe/abducted-ukrainians-social-media-russian-propaganda-cmd-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803151927-20220802-ihor-kurayan-super-tease.jpg","publishedAt":"2022-08-17T04:03:11Z","content":"Lviv, Ukraine (CNN)Before the war broke out, Igor Kurayan, a 55-year-old from the southern Ukrainian port city of Kherson, shared frequent gardening updates on social media. His feeds were full of pa… [+14214 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Bradner, CNN","title":"Three takeaways from primaries in Wyoming","description":"Wyoming Rep. Liz Cheney, who since the insurrection at the Capitol has become the Republican Party's most forceful critic of former President Donald Trump, was ousted from her House seat in by Trump-backed Harriet Hageman, CNN projected Tuesday.","url":"http://us.cnn.com/2022/08/16/politics/wyoming-alaska-primary-election-takeaways/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220816224913-03-liz-cheney-election-night-081622-super-tease.jpg","publishedAt":"2022-08-17T03:39:11Z","content":"Jackson, Wyoming (CNN)Wyoming Rep. Liz Cheney, who since the insurrection at the Capitol has become the Republican Party's most forceful critic of former President Donald Trump, was ousted from her H… [+3923 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Gregory Krieg","title":"Liz Cheney faces referendum on her Trump criticism in tough Wyoming primary","description":"The immediate political future of Wyoming Rep. Liz Cheney, one of former President Donald Trump's most powerful critics in the GOP, is at stake on Tuesday as the last of the House Republicans who voted for his impeachment to face primary voters.","url":"http://us.cnn.com/2022/08/16/politics/liz-cheney-wyoming-alaska-primaries/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220816182737-01-liz-cheney-sept-2020.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-16T22:31:31Z","content":"The immediate political future of WyomingRep. Liz Cheney, one of former President Donald Trumps most powerful critics in the GOP, is at stake on Tuesday as the last of the House Republicans who voted… [+6091 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed","title":"Colorado judge says Jenna Ellis must appear before 2020 election scheme grand jury probe","description":"A judge in Colorado said on Tuesday that Jenna Ellis, an attorney who represented Donald Trump during and after the 2020 election, must appear before the Fulton County, Georgia, grand jury investigating the former President's election schemes.","url":"http://us.cnn.com/2022/08/16/politics/jenna-ellis-testimony-georgia/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/201208121723-jenna-ellis-1202.jpg?q=x_2,y_88,h_1123,w_1995,c_crop/w_800","publishedAt":"2022-08-16T21:33:47Z","content":"A judge in Colorado said on Tuesday that Jenna Ellis, an attorney who represented Donald Trump during and after the 2020 election, must appear before the Fulton County, Georgia, grand jury investigat… [+3354 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By Maureen Chowdhury, Elise Hammond and Melissa Macaya, CNN","title":"Live updates: Wyoming and Alaska election results 2022","description":"Tuesday's primary elections in Wyoming and Alaska feature contests with two high-profile GOP critics of former President Donald Trump. Follow here for live results and news updates.","url":"https://www.cnn.com/politics/live-news/primary-election-results-wyoming-alaska-2022/h_64312823d82e48c0f92472e98e47550c","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220817003026-cheney-hageman-split-super-tease.jpg","publishedAt":"2022-08-16T12:05:27Z","content":"Alaska Sen. Lisa Murkowski will advance to the November general election, CNN projects, along with the Trump-backed former Alaska Department of Administration commissioner Kelly Tshibaka, following t… [+2260 chars]"}]}