{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"'Gold, gold, gold': A look inside Mar-a-Lago - CNN Video","description":"New details show the gold-plated interior of Former President Donald Trump's Mar-a-Lago estate. CNN's Brian Todd reports.","url":"http://us.cnn.com/videos/politics/2022/09/02/inside-mar-a-lago-donald-trump-todd-dnt-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902200134-inside-mar-a-lago-09-02-22-super-tease.jpeg","publishedAt":"2022-09-03T04:52:20.9224917Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Trump's former AG Barr: No reason for classified docs to be at Mar-a-Lago  - CNN Video","description":"Former Attorney General William Barr appeared on Fox News to say there is no \"legitimate reason\" for classified documents to have been at Mar-a-Lago and cast doubt on the idea that they had somehow been declassified.","url":"http://us.cnn.com/videos/politics/2022/09/02/bill-barr-fox-mar-a-lago-documents.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/201222172423-02-bill-barr-0210-super-tease.jpg","publishedAt":"2022-09-03T04:07:29.2639288Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Matias Grez and Steve Almasy, CNN","title":"Serena Williams' legendary tennis career likely over after third-round singles' play loss at US Open","description":"Serena Williams' legendary tennis career has likely come to an end after she fell to Australia's Ajla Tomljanović in the third round of the US Open at Arthur Ashe Stadium in Flushing, New York. The 23-time grand slam singles champion leaves an indelible mark,…","url":"http://us.cnn.com/2022/09/02/tennis/serena-williams-ajla-tomljanovic-us-open-spt-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902211115-07-serena-williams-090222-super-tease.jpg","publishedAt":"2022-09-03T02:23:24Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jamie Gangel, Kristen Holmes, Jeremy Herb and Evan Perez, CNN","title":"After Mar-a-Lago search, Meadows turns over more texts and emails to Archives","description":"Within a week of the FBI search of former President Donald Trump's Mar-a-Lago resort, former White House chief of staff Mark Meadows handed over texts and emails to the National Archives that he had not previously turned over from his time in the administrati…","url":"http://us.cnn.com/2022/09/02/politics/mark-meadows-texts-emails-national-archives/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902174605-mark-meadows-file-restricted-072522-super-tease.jpg","publishedAt":"2022-09-03T00:05:20Z","content":"(CNN)Within a week of the FBI search of former President Donald Trump's Mar-a-Lago resort, former White House chief of staff Mark Meadows handed over texts and emails to the National Archives that he… [+5577 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Marshall Cohen, CNN","title":"Revelatory moments from the historic Mar-a-Lago special master hearing","description":"A hearing Thursday in West Palm Beach, Florida, was the first chance former President Donald Trump's lawyers had to convince US District Judge Aileen Cannon in person that the FBI search warrant on Mar-a-Lago for government records, including those identified…","url":"http://us.cnn.com/2022/09/02/politics/key-lines-mar-a-lago-special-master-hearing/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901175456-01-trump-special-master-request-hearing-super-tease.jpg","publishedAt":"2022-09-02T23:59:48Z","content":"(CNN)A hearing Thursday in West Palm Beach, Florida, was the first chance former President Donald Trump's lawyers had to convince US District Judge Aileen Cannon in person that the FBI search warrant… [+12671 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jamiel Lynch, CNN","title":"Memphis police are looking for school teacher who was abducted while out for early morning jog","description":"Memphis Police are searching for school teacher Eliza 'Liza' Fletcher who they say was abducted while she was out on a jog Friday morning.","url":"http://us.cnn.com/2022/09/02/us/memphis-police-missing-teacher-eliza-eliza-fletcher-jog/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220902144912-02-memphis-missing-teacher-running-super-tease.jpg","publishedAt":"2022-09-02T22:14:19Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed and Katie Bo Lillis, CNN","title":"Mar-a-Lago search inventory shows documents marked as classified mixed with clothes, gifts, press clippings","description":"The search inventory released showed that classified documents had been mixed in with personal items and other materials in the boxes in which they were stored.\nFederal investigators also retrieved more than 11,000 non-classified government documents.","url":"http://us.cnn.com/2022/09/02/politics/judge-releases-full-detailed-inventory-from-the-mar-a-lago-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830182631-02-mar-a-lago-aerial-0810-super-tease.jpg","publishedAt":"2022-09-02T18:35:29Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Annie Grayer, CNN","title":"McCarthy requests documents and testimony from Garland over Mar-a-Lago search","description":"House Minority Leader Kevin McCarthy sent a letter to Attorney General Merrick Garland about the search of former President Donald Trump's home at Mar-a-Lago requesting that Garland and FBI Director Christopher Wray testify in public and provide documents Rep…","url":"http://us.cnn.com/2022/09/02/politics/mccarthy-garland-testimony-documents/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901131549-kevin-mccarthy-0729-super-tease.jpg","publishedAt":"2022-09-02T17:39:04Z","content":"(CNN)House Minority Leader Kevin McCarthy sent a letter to Attorney General Merrick Garland about the search of former President Donald Trump's home at Mar-a-Lago requesting that Garland and FBI Dire… [+2792 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Uliana Pavlova, Anna Cooban","title":"Russia cuts off gas exports to Europe via Nord Stream indefinitely","description":"Russia won't immediately resume exports of natural gas to Europe through its Nord Stream 1 pipeline, worsening a shortage that threatens to tip the continent into an energy crisis this winter.","url":"http://us.cnn.com/2022/09/02/energy/nord-stream-1-pipeline-turned-off/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220901084039-nord-stream-1-baltic-sea-pipeline-0830.jpg?q=w_800,c_fill","publishedAt":"2022-09-02T17:14:04Z","content":"Russiawont immediately resume exports of natural gas to Europe through its Nord Stream 1 pipeline, worsening a shortage that threatens to tip the continent into an energy crisis this winter. \r\nOn Fri… [+3180 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Ted Gup","title":"Opinion: What's really at stake when top secrets are stored at Mar-a-Lago?","description":"The families of those who died while doing undercover work for the CIA come to mind in reading the reports of former President Donald Trump possibly taking ultra-sensitive classified documents, writes Ted Gup.","url":"http://us.cnn.com/2022/08/29/opinions/mar-a-lago-search-secret-documents-gup/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220819153438-mar-a-lago-file-081022-super-tease.jpg","publishedAt":"2022-08-29T11:45:23Z","content":"Ted Gup is the author of \"Nation of Secrets: The Threat to Democracy and the American Way of Life\" and \"The Book of Honor: Covert Lives and Classified Deaths at the CIA.\" In January, he will be teach… [+9162 chars]"}]}