{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"See Brian Stelter's message on final 'Reliable Sources' show  - CNN Video","description":"Anchor Brian Stelter says goodbye on the final episode of \"Reliable Sources with Brian Stelter.\" The show has aired on CNN in various iterations for 30 years.","url":"http://us.cnn.com/videos/media/2022/08/21/brian-stelter-goodbye-final-reliable-sources-episode-rs-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220821121149-brian-stelter-goodbye-thumb-08212022-vpx-super-tease.jpg","publishedAt":"2022-08-21T16:52:22.0659477Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"See what life is like for women and children in Kabul under Taliban rule - CNN Video","description":"CNN's Clarissa Ward returns to Kabul, where the Taliban declared victory one year ago as the US withdrew from Afghanistan. Nearly half of the country's population is hungry and living in poverty, according to the UN.","url":"http://us.cnn.com/videos/world/2022/08/15/taliban-kabul-one-year-later-us-withdrawal-afghanistan-ward-intl-lead-pkg-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220815164140-women-walking-by-foot-kabul-ward-pkg-0815-super-tease.jpg","publishedAt":"2022-08-21T15:37:24.1278993Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Kyung Lah and Jack Hannah, CNN","title":"Mother of Marine killed as the US quit Afghanistan now has to bury another son","description":"Lance Cpl. Kareem Nikoui was killed by terrorists in the chaotic US withdrawal from Afghanistan in August 2021. Not even a year later, his bereaved mother lost another son to the grief.","url":"http://us.cnn.com/2022/08/21/us/california-mother-loses-two-sons/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220820151856-07-shana-chappell-super-tease.jpg","publishedAt":"2022-08-21T12:48:40Z","content":"By Kyung Lah and Jack Hannah, CNN\r\nUpdated 8:48 AM ET, Sun August 21, 2022\r\nNorco, California (CNN)Shana Chappell sits on the grass in front of the tombstone, not sure where to look.\r\nIt's the grave … [+9416 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Paul Vercammen, CNN","title":"Would you rip up your lawn for $6 a square foot? Welcome to drought-stricken California","description":"The megadrought affecting the American West has been record-breaking, with no tangible relief in sight. It's forcing cities to crack down on lawn-watering, and paying residents to replace their lawns with drought-resistant plants.","url":"http://us.cnn.com/2022/08/19/us/california-drought-lawns/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220820013737-04-california-drought-lawns-super-tease.jpg","publishedAt":"2022-08-21T12:01:23Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Fred Pleitgen, Mohammed Tawfeeq, Josh Pennington, Jonny Hallam","title":"Daughter of 'spiritual guide' to Putin's Ukraine invasion killed in car explosion: Russian media","description":"Darya Dugina, the daughter of influential Russian philosopher Alexander Dugin, was reportedly killed on Saturday when the car she was traveling in exploded in the Moscow region, the Russian state news agency TASS has reported.","url":"http://us.cnn.com/2022/08/20/europe/darya-dugina-killed-car-explosion-alexander-dugin-russia-intl-hnk/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220820225925-01-darya-dugina-car-crash-alexander-dugin-russia.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-21T03:06:48Z","content":"Darya Dugina, the daughter of influential Russian philosopher Alexander Dugin, was reportedly killed on Saturday when the car she was traveling in exploded in theMoscow region, the Russian state news… [+1843 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Catherine E. Shoichet, CNN","title":"Life in the US isn't what these Afghans expected","description":"A year after fleeing Kabul on evacuation flights, some Afghans are still struggling to find their footing in the United States. Affordable housing is a major concern, advocates say.","url":"http://us.cnn.com/2022/08/18/us/afghan-evacuees-one-year-later/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220816182824-01-afghan-evacuees-maryland-family-super-tease.jpg","publishedAt":"2022-08-19T16:54:10Z","content":"Groups across the United States are still working to help tens of thousands of Afghans who were evacuated here, and advocates told CNN donations and volunteers are still needed. \r\nHere are several or… [+203 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Scottie Andrew","title":"How a vacation to Hawaii can be relaxing for tourists -- and harmful to its residents","description":"Hawaii's reliance on tourism has resulted in Native Hawaiians getting priced out of their homes and havoc on the natural landscape. Activists say if visitors to Hawaii decenter themselves and instead take with them respect and a willingness to learn, Hawaii m…","url":"http://us.cnn.com/2022/08/18/us/hawaii-tourism-impact-united-shades-cec/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220817095928-01-tourism-hawaii-united-shades-cec-top-card-restricted.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-18T13:02:58Z","content":"Editors Note: United Shades of America with W. Kamau Bell airs Sundays at 10 p.m. ET. Watch this weeks episode for more on activist efforts to return Hawaii to Native Hawaiians. \r\nThe Hawaii most tou… [+7572 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Clarissa Ward, Brent Swails and Scott McWhinnie, CNN","title":"'Sometimes we eat dinner, sometimes we don't.' Afghan food crisis poses dilemma for the West one year after Taliban takeover","description":"Nearly half of Afghans live on less than one meal a day. Women walk miles for bread. One year on, the country is isolated and impoverished.","url":"http://us.cnn.com/2022/08/15/asia/afghanistan-poverty-taliban-anniversary-intl-cmd/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814112037-02-afghanistan-poverty-taliban-anniversary-super-tease.jpg","publishedAt":"2022-08-15T21:15:13Z","content":"By Clarissa Ward, Brent Swails and Scott McWhinnie, CNN\r\nUpdated 5:15 PM ET, Mon August 15, 2022\r\nKabul, Afghanistan (CNN)At midday, Shakeela Rahmati starts the long walk from her home in a poor neig… [+5888 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Salma Abdelaziz and Niamh Kennedy, CNN","title":"She fled Afghanistan with her law degree sewn into her dress. Many of her colleagues were left behind","description":"When Fawzia Amini worked as a senior judge in Afghanistan's Supreme Court, she presided over cases of violent crimes against women, hearing harrowing and heart-breaking accounts of child marriage, sexual assault and femicide.","url":"http://us.cnn.com/2022/08/14/world/afghanistan-women-judges-taliban-intl-cmd/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811133937-01-afghanistan-female-judges-taliban-super-tease.jpg","publishedAt":"2022-08-14T10:25:37Z","content":"London (CNN)When Fawzia Amini worked as a senior judge in Afghanistan's Supreme Court, she presided over cases of violent crimes against women, hearing harrowing and heart-breaking accounts of child … [+6759 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Peter Bergen, CNN National Security Analyst","title":"Opinion: Biden's Afghanistan exit decision looks even worse a year later","description":"Peter Bergen writes that the US troop withdrawal from Afghanistan will long be seen as a defeat rather than a victory. The Biden administration now faces a policy dilemma in working to support Afghans without propping up the Taliban.","url":"http://us.cnn.com/2022/08/09/opinions/afghanistan-exit-a-year-later-bergen/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804183319-taliban-fighters-file-091121-super-tease.jpg","publishedAt":"2022-08-12T12:22:49Z","content":"Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. Bergen's new paperback is \"The Rise and fall of Osama bin Lad… [+15364 chars]"}]}