{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: See how DeSantis addressed FBI's Mar-a-Lago search at rally - CNN Video","description":"CNN's Kyung Lah goes inside the first large Republican rally since the FBI searched Trump's Mar-A-Lago residence, where Florida Gov. Ron Desantis (R) headlined the event.","url":"http://us.cnn.com/videos/politics/2022/08/15/gop-arizona-rally-desantis-lake-fbi-mar-a-lago-trump-search-lah-pkg-lead-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220815173516-desantis-az-rally-lah-pkg-vpx-super-tease.jpg","publishedAt":"2022-08-16T00:52:22.1869977Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Dean Obeidallah","title":"Opinion: Once a proud law and order party, the GOP is taking aim at the FBI","description":"Republicans have been quick to defend former President Donald Trump after the FBI carried out a court-authorized search of his Mar-a-Lago property, but Dean Obeidallah wants to know where the GOP's outrage is over threats to the bureau.","url":"http://us.cnn.com/2022/08/15/opinions/republicans-fbi-trump-search-documents-threats-obeidallah/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812224938-conclu-fbi-politizado-opinion-super-tease.jpg","publishedAt":"2022-08-16T00:19:02Z","content":"Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5359 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: CNN analysis raises security concerns at Trump's Mar-a-Lago resort  - CNN Video","description":"A CNN review of former President Donald Trump's Mar-a-Lago resort raises new concerns over the home being able to meet the standards needed to store classified documents. CNN's Brian Todd reports.","url":"http://us.cnn.com/videos/politics/2022/08/15/trump-mar-a-lago-security-concerns-todd-pkg-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220815192638-trump-mar-a-lago-split-file-super-tease.jpg","publishedAt":"2022-08-15T23:52:27.2805334Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Zachary B. Wolf","title":"The number of people with Top Secret clearance will shock you","description":"The most tantalizing detail around the FBI's recent search of Mar-a-Lago is that 11 sets of documents were classified. It's shining a light on the system of classification by which the government hides information from its people in the name of everyone's nat…","url":"http://us.cnn.com/2022/08/15/politics/classified-information-what-matters/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220812164314-receipt-for-property-mar-a-lago-081222.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-15T22:26:55Z","content":"A version of this story appears in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nThe central question surrounding the FBIs search of Mar-a-Lago last weekis the one th… [+7927 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Katelyn Polantz and Hannah Rabinowitz, CNN","title":"DOJ opposes making public details in Mar-a-Lago search warrant's probable cause affidavit","description":"The Justice Department is opposing the release of details in an affidavit that lays out the argument that investigators made to a federal magistrate judge explaining the probable cause it had to search former President Donald Trump's Mar-a-Lago estate last we…","url":"http://us.cnn.com/2022/08/15/politics/justice-department-mar-a-lago-search-affidavit/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220813101305-mar-a-lago-2021-file-super-tease.jpg","publishedAt":"2022-08-15T20:59:54Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Norman Eisen, Asha Rangappa and Dennis Aftergut","title":"Opinion: Trump is worried after FBI search -- and he should be","description":"Trump's groundless caterwauling this past week proves he's concerned about possible prosecution. He should be. There are just too many ongoing investigations to think that he can dodge them all, write Norman Eisen, Asha Rangappa and Dennis Aftergut","url":"http://us.cnn.com/2022/08/15/opinions/search-warrant-trumps-mar-a-lago-trump-criminal-liability/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814203055-mar-a-lago-search-trump-republicans-garland-super-tease.jpg","publishedAt":"2022-08-15T20:07:17Z","content":"Norman Eisen is a senior fellow at the Brookings Institution. He was former President Barack Obama's ethics czar and was special impeachment counsel to the House Judiciary Committee in 2019-2020. Ash… [+8689 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Matt McFarland, CNN Business","title":"Tesla's 'full self-driving' feature may have finally met its match","description":"\"Full self-driving,\" the controversially named driver-assist feature from Tesla, may have finally met its match.","url":"http://us.cnn.com/2022/08/15/business/tesla-fsd-california-dmv/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220815125009-01-tesla-self-driving-autopilot-file-restricted-super-tease.jpg","publishedAt":"2022-08-15T19:24:09Z","content":"Washington, DC (CNN)\"Full self-driving,\" the controversially named driver-assist feature from Tesla, may have finally met its match. \r\nTesla's foil isn't a silver-haired US Senator, world-class auton… [+7240 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Scottie Andrew","title":"Academy apologizes to Sacheen Littlefeather, who refused an Oscar on Marlon Brando's behalf","description":"Almost 50 years after Littlefeather refused Brando's Oscar for \"The Godfather\" at the 1973 ceremony, the Academy of Motion Picture Arts and Sciences will formally apologize to her for the mistreatment she experienced during her speech and in the years to foll…","url":"http://us.cnn.com/2022/08/15/entertainment/sacheen-littlefeather-oscars-apology-academy-cec/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220815141343-01-sacheen-littlefeather.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-15T18:57:32Z","content":"Sacheen Littlefeather had only 60 seconds to speak at the 1973 Academy Awards. In her brief speech, she refused the Oscar for best actor on behalf of Marlon Brando, faced a mixture of loud boos and c… [+3835 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jennifer Gray","title":"Hints of a hurricane are showing up in long-range forecast models, but experts call it a 'fantasy storm'","description":"During hurricane season, meteorologists -- as well as some of you -- look at computer forecast models ad nauseum. We look several times a day to see what's on the horizon. Will there be a storm? Where? When? If one model shows a storm, we look to see if anoth…","url":"http://us.cnn.com/2022/08/15/weather/atlantic-hurricane-fantasy-forecast-wxn/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220815103249-weather-gfs-forecast-model-pivotal-weather-20220815.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-15T18:23:51Z","content":"Editors Note: A version of this article originally appeared in the weekly weather newsletter, the CNN Weather Brief, which is released every Monday. You can sign up here to receive them every week an… [+4596 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"Analysis: Republicans pressure Garland as intrigue deepens over search of Trump home","description":"The FBI's stunning search of ex-President Donald Trump's home triggered a legal and political earthquake whose aftershocks are only widening a week on, with key questions that will shape the nation's future still clouded in mystery.","url":"http://us.cnn.com/2022/08/15/politics/republicans-garland-trump-home-search-analysis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220814203055-mar-a-lago-search-trump-republicans-garland-super-tease.jpg","publishedAt":"2022-08-15T11:11:00Z","content":null}]}