{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Sonia Moghe, CNN","title":"New head of Alex Jones' company faces questions from lawyers for Sandy Hook families","description":"The accountant now in charge of overseeing right-wing conspiracy theorist Alex Jones' company Free Speech Systems through its bankruptcy was questioned Wednesday by attorneys for families of Sandy Hook shooting victims over $62 million in funds Jones has draw…","url":"http://us.cnn.com/2022/08/03/media/infowars-alex-jones-free-speech-systems-bankruptcy/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803181942-alex-jones-defamation-trial-restricted-080322-super-tease.jpg","publishedAt":"2022-08-04T01:29:21Z","content":"(CNN Business)The accountant now in charge of overseeing right-wing conspiracy theorist Alex Jones' company Free Speech Systems through its bankruptcy was questioned Wednesday by attorneys for famili… [+4411 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch moment attorney exposes Alex Jones' dishonesty during Sandy Hook trial - CNN Video","description":"During the Sandy Hook defamation trial, attorneys for the plaintiffs presented text messages from right-wing radio host Alex Jones that they say prove Jones lied about spreading misinformation about the Sandy Hook shooting and its victims. CNN's Miguel Marque…","url":"http://us.cnn.com/videos/media/2022/08/03/alex-jones-dishonesty-sandy-hook-defamation-trial-marquez-dnt-lead-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803182332-alex-jones-defamation-trial-080322-super-tease.jpg","publishedAt":"2022-08-03T23:07:20.9219699Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"See Alex Jones' reaction when mom confronts him with the truth about her son - CNN Video","description":"Parents of Sandy Hook victims shared their devastating testimony in a Texas courtroom in one of several defamation cases against conspiracy theorist Alex Jones who also testified. CNN's Miguel Marquez reports.","url":"http://us.cnn.com/videos/media/2022/08/03/alex-jones-sandy-hook-victims-trial-defamation-case-parents-conspiracy-marquez-pkg-ac360-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802225528-sandy-hook-parent-vpx3-super-tease.jpeg","publishedAt":"2022-08-03T21:52:25.8917113Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Oliver Darcy, CNN Business","title":"Sandy Hook family attorney exposes Alex Jones' dishonesty during brutal cross-examination","description":"The dishonesty of right-wing conspiracy theorist Alex Jones was spotlighted in a Texas court on Wednesday as a lawyer for a pair of Sandy Hook parents cross-examined the Infowars founder and fact-checked his answers in real-time.","url":"http://us.cnn.com/2022/08/03/media/alex-jones-sandy-hook-trial/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803124445-alex-jones-aug-3-super-tease.jpg","publishedAt":"2022-08-03T20:58:41Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Dan Merica, CNN","title":"'Kansas will not be our last fight' -- Abortion rights victory gives Democrats new hope for midterms","description":"It isn't often that Democrats look to deep-red Kansas for resounding affirmation. But on Tuesday night, when Kansans overwhelmingly voted to keep protections for abortion rights in their state constitution, that is exactly what happened.","url":"http://us.cnn.com/2022/08/03/politics/democrats-republicans-abortion-elections-kansas/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803152848-04-kansas-abortion-reaction-super-tease.jpg","publishedAt":"2022-08-03T20:57:17Z","content":"(CNN)It isn't often that Democrats look to deep-red Kansas for resounding affirmation. But on Tuesday night, when Kansans overwhelmingly voted to keep protections for abortion rights in their state c… [+7968 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Nicole Hemmer","title":"Opinion: The scariest part of the Alex Jones story","description":"Nicole Hemmer writes that as Alex Jones sits through a hearing to determine damages he will need to pay to Sandy Hook parents, it's important to remember that Jones and his vile conspiracy theories are no longer limited to the fringes. He has become a part of…","url":"http://us.cnn.com/2022/08/03/opinions/alex-jones-sandy-hook-conspiracies-gop-hemmer/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803124445-alex-jones-aug-3-super-tease.jpg","publishedAt":"2022-08-03T20:46:21Z","content":"Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+7075 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Melanie Zanona, Clare Foran","title":"Indiana Republican Rep. Jackie Walorski dies in car accident that also killed 2 staffers","description":"Indiana Republican Rep. Jackie Walorski has died in a car accident that also killed two of Walorski's staffers, House Republican leaders announced Wednesday.","url":"http://www.cnn.com/2022/08/03/politics/jackie-walorski-died-indiana-republican/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220803155029-02-jackie-walorski-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-03T20:17:25Z","content":"Indiana Republican Rep. Jackie Walorski has died in a car accident that also killed two of Walorskis staffers, House Republican leaders announced Wednesday.\r\nI am devastated and saddened to learn abo… [+2541 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Dakin Andone, CNN","title":"Parkland families talk of 'unspeakable loss' as they continue victim impact testimony in gunman's death penalty trial","description":"It wasn't until Anthony Montalto was sitting next to his wife testifying in a Florida courtroom Wednesday that he realized he was wearing the same clothes he wore the last time he took his daughter Gina to a father-daughter dance.","url":"http://us.cnn.com/2022/08/03/us/parkland-trial-nikolas-cruz-victim-testimony/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220803083735-01-parkland-victim-impact-statements-0802-super-tease.jpg","publishedAt":"2022-08-03T17:37:13Z","content":"(CNN)It wasn't until Anthony Montalto was sitting next to his wife testifying in a Florida courtroom Wednesday that he realized he was wearing the same clothes he wore the last time he took his daugh… [+4559 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Oliver Darcy, CNN Business","title":"Sandy Hook parents testify about the 'hell' Alex Jones inflicted on them through lies about the shooting","description":"The parents of a child who was murdered during the 2012 Sandy Hook shooting delivered emotional testimony in a Texas court on Tuesday, telling a jury that the lies pushed by right-wing conspiracy theorist Alex Jones have stained the legacy of their son and to…","url":"http://us.cnn.com/2022/08/02/media/alex-jones-sandy-hook-trial/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220802190614-scarlett-lewis-sandy-hook-trial-super-tease.jpg","publishedAt":"2022-08-03T14:17:12Z","content":"New York (CNN Business)The parents of a child who was murdered during the 2012 Sandy Hook shooting delivered emotional testimony in a Texas court on Tuesday, telling a jury that the lies pushed by ri… [+9429 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Oliver Darcy, CNN Business","title":"Alex Jones' company files for bankruptcy amid Texas trial to award damages to Sandy Hook families","description":"Right-wing conspiracy theorist Alex Jones' primary company filed for bankruptcy protection on Friday, an unexpected move that comes as a trial is underway in Texas to determine how much in damages he will have to pay the families of two Sandy Hook victims who…","url":"http://us.cnn.com/2022/07/29/media/alex-jones-free-speech-systems-bankruptcy/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220729191335-alex-jones-file-072822-super-tease.jpg","publishedAt":"2022-07-30T11:27:12Z","content":"New York (CNN Business)Right-wing conspiracy theorist Alex Jones' primary company filed for bankruptcy protection on Friday, an unexpected move that comes as a trial is underway in Texas to determine… [+3437 chars]"}]}