{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Peniel E. Joseph","title":"Opinion: Why I'm not giving up on the embattled dream of America","description":"This year's July 4 celebrations come at a time of escalating political division in the US, writes Peniel E. Joseph. But with the nation's 250th birthday only four years away, he has hope that Americans can confront difficult questions and embrace the power to…","url":"http://us.cnn.com/2022/07/02/opinions/july-4-dream-of-embattled-america-joseph/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220625142718-abortion-protest-062522-super-tease.jpg","publishedAt":"2022-07-02T17:32:59Z","content":"Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+5694 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Ketanji Brown Jackson becomes first Black woman on Supreme Court - CNN Video","description":"Ketanji Brown Jackson is sworn in as the 116th justice of the Supreme Court by Chief Justice John Roberts, making history as the first Black woman to serve on the high court. Jackson is filling the seat of retiring Justice Stephen Breyer.","url":"http://us.cnn.com/videos/politics/2022/06/30/ketanji-brown-jackson-supreme-court-justice-swearing-in-ceremony-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220630122726-ketanji-brown-jackson-swearing-in-brightened-super-tease.jpg","publishedAt":"2022-07-02T16:37:24.5299712Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ray Sanchez, CNN","title":"The hot-car death of 22-month-old Cooper Harris was heartbreakingly familiar. His father's unusual murder conviction has now been thrown out","description":"Those nightmarish hot-car death cases often draw national attention. But they rarely lead to criminal charges from prosecutors who must weigh the intent of grieving parents who insist they simply forgot leaving their child in a hot car.","url":"https://www.cnn.com/2022/07/02/us/justin-ross-harris-son-hot-car-death/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220622083444-justin-ross-harris-2016-court-file-super-tease.jpg","publishedAt":"2022-07-02T16:01:04Z","content":"(CNN)On the final morning of his short life, 22-month-old Cooper Harris was up early, at 5:15, an hour before sunrise in the Atlanta suburb where he lived with his parents. \r\nHis father, Justin Ross … [+17177 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ariane de Vogue","title":"Marshal of the Supreme Court asks Maryland officials to enforce anti-picketing laws","description":"The marshal of the Supreme Court is asking Maryland officials to direct law enforcement to enforce the state's laws prohibiting picketing outside the homes of Supreme Court justices, according to letters sent to Gov. Larry Hogan and Mark Elrich, the county ex…","url":"http://us.cnn.com/2022/07/02/politics/supreme-court-justices-homes-maryland/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220520094415-us-supreme-court-building-0503.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-02T16:00:46Z","content":"The marshal of the Supreme Court is asking Maryland officials to direct law enforcement to enforce the states laws prohibiting picketing outside the homes of Supreme Court justices, according to lett… [+835 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Mick Krever, Phil Black, Kostyantin Gak, and Richard Harlow, CNN","title":"Deep in the eastern Ukrainian forest, this group of volunteers waits as Russia's military creeps closer","description":"Maxym is waiting. For just over a month, he and his comrades have been sleeping in earthen dugouts, eating from cans warmed over campfires, and following news of the Russian military advancing just kilometers away.","url":"http://us.cnn.com/2022/07/02/europe/russia-advance-zeroing-intl-cmd/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220701154458-02-russia-advancing-east-ukraine-super-tease.jpg","publishedAt":"2022-07-02T10:26:01Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Ariane de Vogue","title":"Supreme Court makes it clear there's a red America and a blue America","description":"The US Supreme Court ended its most explosive term in decades this week deeply split along ideological lines, surfacing two different visions of America and the Constitution.","url":"http://us.cnn.com/2022/07/02/politics/supreme-court-red-blue-america-abortion-guns-climate-change/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220701132359-20220701-scotus-red-blue-divide.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-02T04:08:41Z","content":"The US Supreme Court ended its most explosive term in decades this week deeply split along ideological lines, surfacing two different visions of America and the Constitution.\r\nThe nine justices, in t… [+13629 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Lauren del Valle, Veronica Stracqualursi","title":"New York lawmakers pass gun safety bill in response to US Supreme Court striking down handgun law","description":"The New York State Legislature on Friday passed a bill restricting the concealed carry of firearms in locations such as government buildings and schools after the US Supreme Court last week struck down the state's century-old law that had placed restrictions …","url":"http://us.cnn.com/2022/07/01/politics/new-york-gun-law-concealed-carry/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220701143626-02-new-york-state-capitol-file.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-02T00:21:37Z","content":"The New York State Legislature on Friday passed a bill restricting the concealed carry of firearms in locations such as government buildings and schools after the US Supreme Court last week struck do… [+334 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Dan Berman, CNN","title":"What is the Supreme Court and why does it have so much power?","description":"With recent decisions on abortion, gun control, religious freedom and the environment, the US Supreme Court once again reasserted its central role in America.","url":"http://us.cnn.com/2022/07/01/politics/what-is-the-supreme-court-how-does-it-work/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/140613173815-scotus-supreme-court-summer-story-top.jpg","publishedAt":"2022-07-01T20:03:30Z","content":"A previous version of this story appeared on March 26, 2012.\r\n (CNN)With recent decisions on abortion, gun control, religious freedom and the environment, the US Supreme Court once again reasserted i… [+7489 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Noah Gray and Zachary Cohen, CNN","title":"Accounts of Trump angrily demanding to go to the Capitol on January 6 circulated in Secret Service over past year","description":"Then-President Donald Trump angrily demanded to go to the US Capitol on January 6, 2021, and berated his protective detail when he didn't get his way, according to two Secret Service sources who say they heard about the incident from multiple agents, includin…","url":"http://us.cnn.com/2022/07/01/politics/secret-service-lunging-incident/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220628220529-donald-trump-january-6-2021-rally-1-super-tease.jpg","publishedAt":"2022-07-01T18:29:23Z","content":"(CNN)Then-President Donald Trump angrily demanded to go to the US Capitol on January 6, 2021, and berated his protective detail when he didn't get his way, according to two Secret Service sources who… [+5595 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Joan Biskupic","title":"The force of the Supreme Court's right turn has shaken the country","description":"The Supreme Court reached into every corner of American life, reordering intimate family choices, breaching the separation of church and state, and diminishing the steps government can take to prevent gun violence or protect the environment.","url":"http://us.cnn.com/2022/07/01/politics/supreme-court-analysis-abortion-guns-climate-change/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/210317180021-scotus-conservatives-split.jpg?q=x_0,y_0,h_619,w_1100,c_fill/w_800","publishedAt":"2022-07-01T09:04:05Z","content":"The Supreme Court reached into every corner of American life, reordering intimate family choices, breaching the separation of church and state, and diminishing the steps government can take to preven… [+7490 chars]"}]}