{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Paul LeBlanc","title":"The Washington Post: FBI searched Trump's Mar-a-Lago residence for classified nuclear documents","description":"The FBI sought to locate classified documents related to nuclear weapons, among other items, when agents searched former President Donald Trump's Mar-a-Lago resort in Palm Beach, Florida, this week, people familiar with the investigation told The Washington P…","url":"http://us.cnn.com/2022/08/11/politics/trump-mar-a-lago-search-nuclear-classified-documents/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220811111735-mar-a-lago-aerial-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-12T00:42:28Z","content":"The FBI sought to locate classified documents related to nuclear weapons, among other items, when agents searched former President Donald Trumps Mar-a-Lago resort in Palm Beach, Florida, this week, p… [+633 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Watergate whistleblower has warning for Trump - CNN Video","description":"Former Nixon White House counsel John Dean joined CNN's Wolf Blitzer to discuss Attorney General Merrick Garland's press conference and the Justice Department's move to unseal the FBI warrant authorizing a search of former President Donald Trump's Mar-a-Lago …","url":"http://us.cnn.com/videos/politics/2022/08/11/merrick-garland-attorney-general-doj-press-conference-john-dean-reax-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811190621-john-dean-tsr-08112022-super-tease.jpg","publishedAt":"2022-08-11T23:37:17.4280612Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Zachary B. Wolf","title":"Here's why the public owns Trump's presidential records","description":"That former President Donald Trump apparently tried to hold documents from his presidency away from the National Archives is completely unprecedented. As to why the public owns presidential documents, it's a relatively recent development that has roots in Wat…","url":"http://us.cnn.com/2022/08/11/politics/trump-search-doj-what-matters/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220811132025-05-trump-leaving-trump-tower-081022.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-11T23:35:33Z","content":"A version of this story appears in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nAttorney General Merrick Garland employed an unexpected and unorthodox legal chess mo… [+10617 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed","title":"CNN and other news outlets ask court to unseal entire court record related to Mar-a-Lago search","description":"CNN, joined by The Washington Post, NBC News and Scripps, asked a court on Thursday to unseal documents connected to the FBI search of former President Donald Trump's Florida residence this week -- including documents not covered by the Justice Department's o…","url":"http://us.cnn.com/2022/08/11/politics/media-outlets-unseal-mar-a-lago-court-record/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220811111735-mar-a-lago-aerial-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-11T22:51:57Z","content":"CNN, joined by The Washington Post, NBC News and Scripps, asked a court on Thursday to unseal documents connected to the FBI search of former President Donald Trumps Florida residence this week inclu… [+4276 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Michelle Watson, Dakin Andone and Josh Campbell, CNN","title":"Standoff with an armed suspect who tried to enter the FBI's Cincinnati office has ended, officials say","description":"A law enforcement standoff with a suspect who authorities say attempted to breach the FBI's field office in Cincinnati on Thursday has ended, according to Clinton County Emergency Management Agency.","url":"http://us.cnn.com/2022/08/11/us/cincinnati-fbi-office-armed-subject/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811123026-01-fbi-cincinnati-office-incident-0811-super-tease.jpg","publishedAt":"2022-08-11T21:13:10Z","content":"(CNN)A law enforcement standoff with a suspect who authorities say attempted to breach the FBI's field office in Cincinnati on Thursday has ended, according to Clinton County Emergency Management Age… [+2513 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Chris Cillizza, CNN Editor-at-large","title":"Analysis: Merrick Garland just called Donald Trump's bluff","description":"For the last 72 hours, since the FBI conducted a search of Donald Trump's Mar-a-Lago home, the former President has spouted any number of claims about what happened and why. He's said that Democrats led the search (they didn't) and raised the possibility that…","url":"http://us.cnn.com/2022/08/11/politics/garland-trump-mar-a-lago-search-bluff/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811152300-07-merrick-garland-0811-super-tease.jpg","publishedAt":"2022-08-11T20:49:09Z","content":"(CNN)For the last 72 hours, since the FBI conducted a search of Donald Trump's Mar-a-Lago home, the former President has spouted any number of claims about what happened and why. He's said that Democ… [+3201 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Zachary Cohen, Jamie Gangel and Sara Murray, CNN","title":"First on CNN: Elaine Chao, Trump's former Transportation Secretary, met with Jan. 6 committee as other Cabinet members engage with panel","description":"The House select committee investigating January 6, 2021, has recently interviewed former Transportation Secretary Elaine Chao and is in talks with former Education Secretary Betsy DeVos as well as former National Security Adviser Robert O'Brien, multiple sou…","url":"http://us.cnn.com/2022/08/11/politics/elaine-chao-trump-cabinet-january-6-25th-amendment/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811134637-elaine-chao-0422-file-super-tease.jpg","publishedAt":"2022-08-11T20:00:21Z","content":"Washington (CNN)The House select committee investigating January 6, 2021, has recently interviewed former Transportation Secretary Elaine Chao and is in talks with former Education Secretary Betsy De… [+4740 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Tierney Sneed, Evan Perez, Hannah Rabinowitz","title":"Merrick Garland says FBI filed motion to unseal Trump Mar-a-Lago warrant and property receipt","description":"In his first public statement since federal agents searched former President Donald Trump's home at Mar-a-Lago earlier this week, Attorney General Merrick Garland on Thursday said that the Justice Department had filed in court a request that the search warran…","url":"http://us.cnn.com/2022/08/11/politics/garland-announcement-justice-department/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220811152300-07-merrick-garland-0811.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-11T18:07:58Z","content":"In his first public statement since federal agents searched former President Donald Trumps home at Mar-a-Lago earlier this week, Attorney General Merrick Garland on Thursday said that the Justice Dep… [+2466 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Evan Perez, Gabby Orr and Pamela Brown, CNN","title":"Feds seized documents from Mar-a-Lago in June with grand jury subpoena","description":"The FBI search at Mar-a-Lago this week came months after federal investigators served an earlier grand jury subpoena and took away sensitive national security documents from former President Donald Trump's property during a June meeting, people familiar with …","url":"http://us.cnn.com/2022/08/11/politics/mar-a-lago-search-subpoena-latest/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220811111735-mar-a-lago-aerial-0810-super-tease.jpg","publishedAt":"2022-08-11T16:01:58Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Frida Ghitis","title":"Opinion: Ominous warnings after search of Trump's home make no sense","description":"Frida Ghitis writes that Donald Trump's most militant supporters, who are claiming the republic is under attack because of the FBI search of the former president's home, could not be more wrong. In strong democracies, no one is above the law --  including a f…","url":"http://us.cnn.com/2022/08/10/opinions/fbi-search-ominous-warnings-democracy-ghitis/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220808234744-trump-fbi-search-political-storm-analysis.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-10T22:17:49Z","content":"Editors Note: Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a weekly opinion contributor to CNN, a contributing columnist to The Washingto… [+6297 chars]"}]}