{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Paul LeBlanc, CNN","title":"Analysis: Here's everything we've learned from the January 6 committee hearings so far","description":"The House select committee investigating the January 6, 2021, US Capitol attack has gone to great lengths to present the findings of its sprawling investigation in a succinct, digestible way. Here's everything we've learned from the panel's public hearings so…","url":"http://us.cnn.com/2022/06/16/politics/jan-6-committee-hearings-so-far-what-matters/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616151047-01-jan-6-hearing-061622-super-tease.jpg","publishedAt":"2022-06-16T22:49:13Z","content":"A version of this story appears in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)The House select committee investigating the January 6, 2021, US Cap… [+9546 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: Congressman says Trump willing to put his own VP in danger 'just to stay in power' - CNN Video","description":"Rep. Pete Aguilar (D-CA) tells CNN's Jake Tapper that the goal of the third January 6 hearing is to establish that former President Donald Trump lost the election, and that his purported legal theories had no basis in law. The committee aims to convey \"just h…","url":"http://us.cnn.com/videos/politics/2022/06/16/pete-aguilar-2022-january-6-hearing-the-lead-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616135629-pete-aguilar-january-6-committee-super-tease.jpg","publishedAt":"2022-06-16T22:07:27.9794961Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Chris Cillizza, CNN Editor-at-large","title":"Analysis: The 16 most compelling lines from today's January 6 committee hearing","description":"The third public hearing of the January 6 committee this month is in the books. It was heavily focused on the pressure campaign that Donald Trump brought to bear on Mike Pence to overturn the Electoral College results in advance of January 6, 2021.","url":"http://us.cnn.com/2022/06/16/politics/january-6-committee-hearing-day-3-key-lines-mike-pence/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616152314-19-january-6-hearings-0616-pence-super-tease.jpg","publishedAt":"2022-06-16T21:16:08Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Shawna Mizelle and Tierney Sneed, CNN","title":"Jan. 6 panel sends request to Ginni Thomas after she says she looks 'forward to talking'","description":"House January 6 committee Chair Bennie Thompson on Thursday said the panel investigating the US Capitol attack has sent a letter to Virginia \"Ginni\" Thomas asking her to speak with them about her role in the effort to overturn the 2020 electoral results.","url":"http://us.cnn.com/2022/06/16/politics/ginni-thomas-january-6-committee/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210206031134-ginni-thomas-file-2017-super-tease.jpg","publishedAt":"2022-06-16T21:04:44Z","content":"Washington (CNN)House January 6 committee Chair Bennie Thompson on Thursday said the panel investigating the US Capitol attack has sent a letter to Virginia \"Ginni\" Thomas asking her to speak with th… [+3326 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kara Scannell","title":"Michael Avenatti pleads guilty to stealing millions of dollars from clients","description":"Disgraced attorney Michael Avenatti pleaded guilty Thursday to embezzling millions of dollars from four of his clients, taking another step closer toward resolving a flurry of federal charges against him.","url":"http://us.cnn.com/2022/06/16/politics/michael-avenatti-guilty-plea/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220612215954-01-michael-avenatti-file-super-tease.jpg","publishedAt":"2022-06-16T20:49:07Z","content":"(CNN)Disgraced attorney Michael Avenatti pleaded guilty Thursday to embezzling millions of dollars from four of his clients, taking another step closer toward resolving a flurry of federal charges ag… [+2756 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Ivanka describes 'heated' phone call between Pence and Trump  - CNN Video","description":"The House select committee investigating the January 6 Capitol riot presents a pre-produced compilation of key Trump allies recounting a \"heated\" phone call between former President Trump and former Vice President Pence.","url":"http://us.cnn.com/videos/politics/2022/06/16/trump-pence-call-ivanka-2022-january-6-hearings-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616152918-trump-pence-call-ivanka-2022-january-6-hearings-vpx-00013509-super-tease.png","publishedAt":"2022-06-16T20:07:39.5736245Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Watch: See how close rioters got to Pence as they breached the Capitol - CNN Video","description":"In video animations showing the movement of former Vice President Mike Pence, the House select committee investigating January 6 revealed how close rioters got to Pence at one point after they entered the Capitol.","url":"http://us.cnn.com/videos/politics/2022/06/16/pence-rioters-capitol-location-2022-january-6-hearings-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616153221-pence-rioters-location-graphics-jan-6-hearing-1-super-tease.jpg","publishedAt":"2022-06-16T20:07:25.4487548Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Fredreka Schouten, CNN","title":"New Mexico county official convicted of January 6 trespassing refuses to certify 2022 primary results based on debunked conspiracy","description":"A New Mexico county commissioner, awaiting sentencing for his January 6 conviction, said Thursday that he plans to defy a state Supreme Court order and will not vote to certify the results of a recent primary election in a flareup over vote-tallying machines …","url":"http://us.cnn.com/2022/06/16/politics/new-mexico-otero-county-election/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616125304-couy-griffin-file-super-tease.jpg","publishedAt":"2022-06-16T20:04:08Z","content":"(CNN)A New Mexico county commissioner, awaiting sentencing for his January 6 conviction, said Thursday that he plans to defy a state Supreme Court order and will not vote to certify the results of a … [+3600 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, Marshall Cohen, Zachary Cohen","title":"3 takeaways from the January 6 hearings day 3","description":"The House select committee investigating the Capitol insurrection on Thursday detailed how former President Donald Trump tried to pressure his vice president to join in his scheme to overturn the presidential election -- and how Pence's refusal put his life i…","url":"http://us.cnn.com/2022/06/16/politics/january-6-hearing-day-3-takeaways/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220616135112-13-january-6-hearings-0616.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-06-16T19:00:44Z","content":"The House select committee investigating the Capitol insurrection on Thursday detailed how former President Donald Trump tried to pressure his vice president to join in his scheme to overturn the pre… [+4913 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"By <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Elise Hammond, Maureen Chowdhury, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Melissa Macaya, CNN","title":"Live updates: Jan. 6 hearings day 3","description":"The House committee investigating the Jan. 6 insurrection at the US Capitol is holding its third public hearing of the month. Watch live and follow news updates here.","url":"https://www.cnn.com/politics/live-news/january-6-hearings-june-16","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220613193914-jan-6-hearing-061322-super-tease.jpg","publishedAt":"2022-06-16T14:00:45Z","content":"The Justice Department pressed the House select committee investigating the Jan. 6 riot to turn over transcripts of witness interviews, noting that refusing to turn over the documents is leading to d… [+2593 chars]"}]}