{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Katie Lobosco","title":"What to know about government classification of secrets","description":"The US government has a formal system of protecting information that, if disclosed, could hurt national security. In light of the recent removal of some classified documents from former President Donald Trump's Mar-a-Lago home, here are key things to know abo…","url":"http://us.cnn.com/2022/08/12/politics/government-classified-documents-secrets-scif/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220810084406-01-trump-leaving-trump-tower-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-12T23:52:54Z","content":"The US government has a formal system of protecting information that, if disclosed, could hurt national security. \r\nThe system can apply to documents regarding intelligence activities, foreign relati… [+3514 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Josh Campbell, Jessica Schneider, Donie O'Sullivan and Paul P. Murphy, CNN","title":"FBI investigating 'unprecedented' number of threats against bureau in wake of Mar-a-Lago search","description":"The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of Donald Trump's Mar-a-Lago resort, including against agents listed in court records as being involved in the search, a law enforcem…","url":"http://us.cnn.com/2022/08/12/politics/fbi-threats-maralago-trump-search/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812183806-fbi-0812-super-tease.jpg","publishedAt":"2022-08-12T23:42:14Z","content":"(CNN)The FBI is investigating an \"unprecedented\" number of threats against bureau personnel and property in the wake of the search of former President Donald Trump's Mar-a-Lago resort, including some… [+2894 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen and Sara Murray, CNN","title":"Key lines from the search warrant and receipt for Trump's Florida home","description":"A federal judge on Friday unsealed the search warrant and property receipt from the FBI search of former President Donald Trump's Mar-a-Lago resort in Palm Beach, Florida.","url":"http://us.cnn.com/2022/08/12/politics/search-warrant-receipt-trump-fbi-maralago-key-lines/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812163049-fbi-search-warrant-mar-a-lago-081222-super-tease.jpg","publishedAt":"2022-08-12T21:14:42Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Katelyn Polantz, Zachary Cohen, Sara Murray and Marshall Cohen, CNN","title":"FBI took 11 sets of classified material from Trump's Mar-a-Lago home while investigating possible Espionage Act violations","description":"The Justice Department removed 11 sets of classified documents from former President Donald Trump's Mar-a-Lago residence while executing a search warrant this week for possible violations of the Espionage Act and other crimes, according to court documents uns…","url":"http://us.cnn.com/2022/08/12/politics/trump-mar-a-lago-investigation/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812095955-06-trump-leaving-trump-tower-0810-super-tease.jpg","publishedAt":"2022-08-12T21:12:42Z","content":"(CNN)The Justice Department removed 11 sets of classified documents from former President Donald Trump's Mar-a-Lago residence while executing a search warrant this week for possible violations of the… [+6487 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Trump's search warrant cites 3 criminal laws, NYT reports. CNN legal analyst breaks down what we know so far - CNN Video","description":"CNN's legal analyst Elie Honig details what's known so far about the FBI's warrant authorizing a search of former President Donald Trump's Mar-a-Lago estate.","url":"http://us.cnn.com/videos/politics/2022/08/12/trump-fbi-mar-a-lago-search-warrant-honig-analysis-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220607092629-elie-honig-lead-0606-super-tease.jpg","publishedAt":"2022-08-12T20:22:30.0377437Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"READ: Search warrant for Trump's Mar-a-Lago resort","description":"The US District Court for the Southern District of Florida on Friday unsealed the search warrant and property receipt from the FBI search of former President Donald Trump's Mar-a-Lago resort in Palm Beach earlier this week.","url":"http://us.cnn.com/2022/08/12/politics/read-search-warrant-trump-mar-a-lago/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220811111735-mar-a-lago-aerial-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-12T20:04:17Z","content":"The US District Court for the Southern District of Florida on Friday unsealed the search warrant and property receipt from the FBI search of former President Donald Trumps Mar-a-Lago resort in Palm B… [+63 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"David Zurawik","title":"Analysis: We thought Murdoch's news outlets were abandoning Trump. Then the FBI searched Mar-a-Lago","description":"If nothing else can be said with certainty about Donald Trump after a week of coverage filled with speculation about the purpose of the FBI search at Mar-a-Lago, it is that he still has the biggest cable TV news channel, Fox News, solidly behind him. He also …","url":"http://us.cnn.com/2022/08/12/media/fox-news-coverage-fbi-mar-a-lago-search/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220810140547-04-trump-leaving-trump-tower-0810.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-12T19:51:30Z","content":"If nothing else can be said with certainty about Donald Trump after a week of coverage filled with speculation about the purpose of the FBI search at Mar-a-Lago, it is that he still has the biggest c… [+6246 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Julian Zelizer, CNN Political Analyst","title":"Opinion: Why Trump thinks the FBI search could be a winner for him","description":"Attacking the legitimacy of our institutions was a central pillar to Donald Trump's rhetoric both as candidate and president, writes Julian Zelizer. Now under multiple investigations, Trump seems to be finding his rhythm once again.","url":"http://us.cnn.com/2022/08/12/opinions/trump-attacks-on-institutions-zelizer/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812090229-pm-digital-trump-super-tease.jpg","publishedAt":"2022-08-12T16:36:55Z","content":"Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, \"The Presidency of Donald J. Trump: … [+6262 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ray Sanchez and Adam Thomas, CNN","title":"Author Salman Rushdie attacked at New York event","description":"Salman Rushdie -- a celebrated author and winner of the world's top literary prizes - - was attacked on stage before giving a lecture at the Chautauqua Institution, according to an AP reporter who witnessed a man on the stage \"punching or stabbing\" the noveli…","url":"http://us.cnn.com/2022/08/12/us/salman-rushdie-attacked/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220812112309-salman-rushdie-file-2019-restricted-super-tease.jpg","publishedAt":"2022-08-12T15:43:05Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Clare Foran and Kristin Wilson, CNN","title":"House to vote Friday to pass Democrats' sweeping health care and climate bill","description":"The House of Representatives is on track to vote on Friday to pass Democrats' $750 billion health care, energy and climate bill, in a significant victory for President Joe Biden and his party.","url":"http://us.cnn.com/2022/08/12/politics/house-vote-health-care-climate-tax-bill/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220520155446-05-nancy-pelosi-file-super-tease.jpg","publishedAt":"2022-08-12T09:09:29Z","content":"(CNN)The House of Representatives is on track to vote on Friday to pass Democrats' $750 billion health care, energy and climate bill, in a significant victory for President Joe Biden and his party. \r… [+6804 chars]"}]}