{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Maggie Haberman: This is how Trump likely has been consuming the Jan. 6 hearings - CNN Video","description":"CNN political analyst Maggie Haberman describes what she has heard about former President Donald Trump's consumption of the January 6 House select committee hearings in light of ex-Trump White House counsel Pat Cipollone's testimony with the committee.","url":"http://us.cnn.com/videos/politics/2022/07/08/haberman-nyt-trump-cipollone-testimony-2022-jan-6-hearings-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708155106-haberman-vpx-july-9-super-tease.jpg","publishedAt":"2022-07-09T00:37:30.1484586Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Gunman's father claims no responsibility over shooting - CNN Video","description":"Robert Crimo Jr., the father of the confessed Highland Park parade shooter, says he thought his son was going to use the guns he helped purchase at the shooting range.","url":"http://us.cnn.com/videos/us/2022/07/07/robert-crimo-parents-highland-park-campbell-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708094328-robert-crimo-jr-highland-park-shooter-father-super-tease.jpeg","publishedAt":"2022-07-09T00:37:27.8820718Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Casey Tolan and Daniel A. Medina, CNN","title":"Highland Park gunman's family was in turmoil for years leading up to parade shooting","description":"When Bob's Pantry and Deli opened for business in the Chicago suburb of Highland Park in 2008, loyal customers lined up in the snow at 4 a.m. to support Bob Crimo, who was striking out on his own after years running a convenience store franchise. Photos from …","url":"http://us.cnn.com/2022/07/08/us/highland-park-suspect-family-turmoil-invs/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708094328-robert-crimo-jr-highland-park-shooter-father-super-tease.jpeg","publishedAt":"2022-07-08T21:32:43Z","content":"(CNN)When Bob's Pantry and Deli opened for business in the Chicago suburb of Highland Park in 2008, loyal customers lined up in the snow at 4 a.m. to support Bob Crimo, who was striking out on his ow… [+15870 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Clare Duffy, Brian Fung, Rachel Metz","title":"Musk tells Twitter he wants out of deal to buy it. Twitter says it will force him to close the sale","description":"Elon Musk moved Friday afternoon to terminate his $44 billion deal to buy Twitter — the latest twist in a whirlwind process in which the billionaire Tesla CEO became the company's biggest shareholder, turned down a board seat, agreed to buy the social media p…","url":"http://us.cnn.com/2022/07/08/tech/elon-musk-twitter-deal-exit/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220520082604-02-elon-musk-0322.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-08T21:32:17Z","content":"Elon Musk moved Friday afternoon to terminate his $44 billion deal to buy Twitter the latest twist in a whirlwind process in which the billionaire Tesla CEO became the companys biggest shareholder, t… [+6278 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Aya Elamroussi, Josh Campbell and Yon Pomrenze, CNN","title":"Highland Park shooter's rooftop position made it difficult for officers to find him quickly as parade turned into chaos, police chief says","description":"The Fourth of July parade shooter's location -- concealed on a rooftop along Highland Park's Central Avenue -- made it hard for law enforcement to figure out immediately where bullets were raining from when he opened fire with a semi-automatic rifle, the Illi…","url":"http://us.cnn.com/2022/07/08/us/highland-park-illinois-shooting-july-fourth-parade-friday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220708021150-01-highland-park-illinois-shooting-july-fourth-parade-friday-restricted-super-tease.jpg","publishedAt":"2022-07-08T20:36:19Z","content":"Highland Park, Illinois (CNN)The Fourth of July parade shooter's location -- concealed on a rooftop along Highland Park's Central Avenue -- made it hard for law enforcement to figure out immediately … [+7678 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Joe Sutton and Christina Maxouris, CNN","title":"The 8-year-old boy paralyzed from waist down after Highland Park parade shooting woke up and asked to see his twin and dog","description":"An 8-year-old boy who was attending the Highland Park Fourth of July parade with his parents and twin brother was shot and is now paralyzed from the waist down, family spokesperson Anthony Loizzi told CNN on Thursday.","url":"http://us.cnn.com/2022/07/07/us/highland-park-shooting-cooper-roberts-8-year-old-paralyzed/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220707145149-cooper-roberts-highland-park-critical-condition-super-tease.jpg","publishedAt":"2022-07-08T20:30:38Z","content":"(CNN)An 8-year-old boy who was attending the Highland Park Fourth of July parade with his parents and twin brother was shot and is now paralyzed from the waist down, family spokesperson Anthony Loizz… [+3766 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kate Sullivan, CNN","title":"Here's what's in Biden's executive order on abortion rights","description":"President Joe Biden on Friday signed an executive order aimed at protecting access to reproductive health services in the wake of the Supreme Court overturning Roe v. Wade and eliminating the constitutional right to an abortion.","url":"http://us.cnn.com/2022/07/08/politics/what-is-in-biden-abortion-executive-order/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220706153940-01-joe-biden-cleveland-070622-super-tease.jpg","publishedAt":"2022-07-08T18:24:35Z","content":"(CNN)President Joe Biden on Friday signed an executive order aimed at protecting access to reproductive health services in the wake of the Supreme Court overturning Roe v. Wade and eliminating the co… [+4314 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Travis Caldwell, Joe Sutton and Rebekah Riess, CNN","title":"New York Post: Father of Highland Park gunman wants his son to serve a 'long' sentence","description":"Days after a gunman killed seven and wounded dozens more in a rampage at a Fourth of July parade in Highland Park, Illinois, the shooter's father told the New York Post he wants his son to serve a long prison sentence.","url":"http://us.cnn.com/2022/07/07/us/highland-park-illinois-shooting-july-fourth-parade-thursday/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220706175331-highland-park-chicago-crimo-tiroteo-confesion-masacre-redaccion-mexico-yilber-vega-00011909-super-tease.jpg","publishedAt":"2022-07-08T15:30:49Z","content":"(CNN)Days after a gunman killed seven and wounded dozens more in a rampage at a Fourth of July parade in Highland Park, Illinois, the shooter's father told the New York Post he wants his son to serve… [+11445 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Holly Yan, CNN","title":"The woman who planned her synagogue's funerals was killed in the Highland Park massacre. Now a friend embarks on an unimaginable task","description":"At first, the grief-stricken congregation didn't know who would take the reins from Jacki Sundheim and plan her synagogue funeral with the same tenacity and care that she always bestowed onto others.","url":"http://us.cnn.com/2022/07/08/us/jacki-sundheim-funeral-director/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220707000948-02-jamie-greenebaum-highland-park-super-tease.jpg","publishedAt":"2022-07-08T13:49:07Z","content":"Glencoe, Illinois (CNN)Anytime there was a major life event at her synagogue, Jacki Sundheim was on top of it. \r\nThe 63-year-old meticulously planned virtually every bar mitzvah, bat mitzvah, wedding… [+2858 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"CNN Staff","title":"Who was Shinzo Abe, the former Japanese Prime Minister?","description":"Japan's former Prime Minister Shinzo Abe has died after being shot during a campaign speech Friday in Nara, central Japan. He was 67.","url":"http://us.cnn.com/2022/07/08/asia/shinzo-abe-former-japan-pm-death-intl-hnk/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220707231111-04-shinzo-abe-070722-file-super-tease.jpg","publishedAt":"2022-07-08T09:42:01Z","content":null}]}