{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Rosa Flores and Christina Maxouris, CNN","title":"A fact-focused report on the Uvalde school massacre is expected to be released to the public Sunday","description":"A Texas House investigative committee is expected to release a preliminary report Sunday on the Uvalde, Texas, school massacre that left 21 people dead, more than a month after the group began its search for answers.","url":"http://us.cnn.com/2022/07/17/us/texas-house-uvalde-shooting-report/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220527101520-01b-uvalde-leader-news-school-shooting-coverage-super-tease.jpg","publishedAt":"2022-07-17T04:02:33Z","content":"(CNN)A Texas House investigative committee is expected to release a preliminary report Sunday on the Uvalde, Texas, school massacre that left 21 people dead, more than a month after the group began i… [+3600 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Frida Ghitis","title":"Opinion: Biden's risky fist bump with MBS","description":"Biden's Saudi trip has been a high stakes gambit filled with urgent, concrete objectives, writes Frida Ghitis. And Biden had greater aims than simply lowering gas prices for Americans in order to boost his own political standing, as so many suggest.","url":"http://us.cnn.com/2022/07/16/opinions/biden-saudi-trip-fist-bump-with-mbs-ghitis/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220715123924-01b-biden-mbs-fist-bump-super-tease.jpg","publishedAt":"2022-07-17T02:25:53Z","content":"Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a… [+7836 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: Wolf Blitzer presses Saudi diplomat who was in meeting with Biden on Khashoggi's murder - CNN Video","description":"CNN's Wolf Blitzer presses Saudi diplomat Adel al-Jubeir, who was in the room during President Joe Biden's meeting with Saudi Crown Prince Mohammed Bin Salman, about the murder of journalist Jamal Khashoggi.","url":"http://us.cnn.com/videos/world/2022/07/15/adel-al-jubeir-saudi-diplomat-murder-khashoggi-meeting-biden-mbs-sot-tsr-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220715195421-saudi-diplomat-adel-al-jubeir-vpx1-super-tease.jpg","publishedAt":"2022-07-17T02:07:23.8289617Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Hannah Sarisohn and Josh Campbell, CNN","title":"Man who allegedly fatally stabbed professional race car driver was killed in a police shooting, authorities say","description":"A man who allegedly fatally stabbed professional race car driver Bobby East at a Southern California gas station was later killed in a police shooting as authorities attempted to arrest him, according to a news release from the Westminster, California, Police…","url":"http://us.cnn.com/2022/07/16/us/bobby-east-nascar-stabbing-death/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220716201027-bobby-east-nascar-stabbing-death-super-tease.jpg","publishedAt":"2022-07-17T00:41:47Z","content":"(CNN)A man who allegedly fatally stabbed professional race car driver Bobby East at a Southern California gas station was later killed in a police shooting as authorities attempted to arrest him, acc… [+1357 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Kate Bennett, CNN","title":"Jill Biden on President Joe Biden's hindered progress: 'He had so many hopes'","description":"First lady Jill Biden on Saturday voiced frustration about the stalled progress of President Joe Biden's tenure in the White House during a private Democratic National Committee fundraiser.","url":"http://us.cnn.com/2022/07/16/politics/jill-biden-joe-biden-democratic-national-committee-fundraiser/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220716164024-01-jill-biden-joe-biden-democratic-national-committee-fundraiser-super-tease.jpg","publishedAt":"2022-07-16T21:31:37Z","content":"(CNN)First lady Jill Biden on Saturday voiced frustration about the stalled progress of President Joe Biden's tenure in the White House during a private Democratic National Committee fundraiser.\r\nThe… [+3937 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Ariel Edwards-Levy, CNN","title":"Here's what the post-Roe polling says about voters' top issues","description":"Few individual news events have the power to singlehandedly rearrange voters' electoral priorities. But if anything held that possibility, it might have been the Supreme Court's decision to overturn Roe vs. Wade. Beyond its immediate consequences for abortion…","url":"http://us.cnn.com/2022/07/16/politics/top-issue-polls-abortion/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220709223001-protest-dc-super-tease.jpg","publishedAt":"2022-07-16T20:58:35Z","content":"(CNN)Few individual news events have the power to singlehandedly rearrange voters' electoral priorities. But if anything held that possibility, it might have been the Supreme Court's decision to over… [+10216 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Opinion by Julian Zelizer, CNN Political Analyst","title":"Opinion: Why Gen Z is done with Biden -- and Trump","description":"It is not uncommon to hear people ask what we need to do to get young people more engaged in politics, writes Julian Zelizer. While these concerns are important, but we also need to look at what our political system does wrong","url":"http://us.cnn.com/2022/07/14/opinions/young-voters-disillusioned-politics-zelizer/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220711232932-biden-trump-split-0711-super-tease.jpg","publishedAt":"2022-07-16T14:39:41Z","content":"Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, \"The Presidency of Donald J. Trump: … [+7620 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Phil Mattingly, Allie Malloy, Tamara Qiblawi and Celine Alkhaldi, CNN","title":"MBS fires back at Biden after the President confronts Saudi prince about Khashoggi","description":"Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, fired back at US President Joe Biden after the president confronted him about the 2018 murder of Saudi journalist Jamal Khashoggi during a meeting on Friday, according to a source familiar with …","url":"http://us.cnn.com/2022/07/16/middleeast/biden-mbs-khashoggi-abu-akleh-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220715123924-01b-biden-mbs-fist-bump-super-tease.jpg","publishedAt":"2022-07-16T11:17:23Z","content":"(CNN)Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, hit back at Joe Biden after the US President confronted him about the 2018 murder of Saudi journalist Jamal Khashoggi during a me… [+5047 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb","title":"January 6 committee's investigation stirs up fresh revelations ahead of last planned hearing","description":"The House January 6 committee corroborated key details involving former President Donald Trump's heated exchange with the Secret Service when Trump was told he could not go to the Capitol -- the latest in a string of shocking revelations that have come from t…","url":"http://us.cnn.com/2022/07/16/politics/january-6-committee-latest/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220613104923-03-jan-6-hearing-0613.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-16T10:01:10Z","content":"The House January 6 committee corroborated key details involving former President Donald Trumps heated exchange with the Secret Service when Trump was told he could not go to the Capitol the latest i… [+8095 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Annie Grayer, CNN","title":"Progressives push 10 executive actions on abortion access","description":"The Congressional Progressive Caucus released Friday a new slate of recommended executive actions tailored to protect abortion access and to pressure President Joe Biden to do more as Democrats continue to grapple with how to respond to Roe v. Wade being over…","url":"http://us.cnn.com/2022/07/15/politics/congressional-progressives-caucuses-abortion-executive-actions/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220714173837-pramila-jayapal-file-restricted-061622-super-tease.jpg","publishedAt":"2022-07-15T18:03:49Z","content":"(CNN)The Congressional Progressive Caucus released Friday a new slate of recommended executive actions tailored to protect abortion access and to pressure President Joe Biden to do more as Democrats … [+5441 chars]"}]}