{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Video: George Conway says new Mar-a-Lago filing has Trump 'dead to rights' - CNN Video","description":"Conservative attorney George Conway says the Department of Justice filing that contains new information about the FBI search at Mar-a-Lago has former President Donald Trump \"dead to rights.\"","url":"http://us.cnn.com/videos/politics/2022/08/31/george-conway-doj-mar-a-lago-search-new-information-sot-dlt-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831020927-george-conway-donald-trump-split-for-video-super-tease.jpg","publishedAt":"2022-08-31T06:52:23.5964231Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jessie Yeung, CNN","title":"World leaders mourn death of last Soviet leader Mikhail Gorbachev","description":"The death of former Soviet leader Mikhail Gorbachev, known for his pivotal role in ending the Cold War and introducing key reforms to the USSR, has prompted an outpouring of condolences and tributes from world leaders.","url":"http://us.cnn.com/2022/08/31/europe/mikhail-gorbachev-death-global-reactions-intl-hnk/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830212302-mikhail-gorbachev-super-tease.jpg","publishedAt":"2022-08-31T05:31:38Z","content":"(CNN)The death of former Soviet leader Mikhail Gorbachev, known for his pivotal role in ending the Cold War and introducing key reforms to the USSR, has prompted an outpouring of condolences and trib… [+4308 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, Marshall Cohen, Tierney Sneed","title":"Takeaways from the historic Justice Department court filing on the Mar-a-Lago search","description":"Former President Donald Trump has pushed an \"incomplete and inaccurate narrative\" in his recent court filings about the Mar-a-Lago search, the Justice Department said in a historic court filing late Tuesday night.","url":"http://us.cnn.com/2022/08/31/politics/takeaways-mar-a-lago-documents/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220830232932-doj-response-to-trump-special-master.jpg?q=w_800,c_fill","publishedAt":"2022-08-31T05:19:41Z","content":"Former President Donald Trump has pushed an incomplete and inaccurate narrative in his recent court filings about the Mar-a-Lago search, the Justice Department said in a historic court filing late Tu… [+6502 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"'It's weird': Melania Trump's post-White House endeavor raises eyebrows - CNN Video","description":"While the former President Donald Trump has fumed about the FBI's search of Mar-a-Lago, former first lady Melania Trump has been quiet. CNN's Kate Bennett has new details of Mrs. Trump's reaction to the search.","url":"http://us.cnn.com/videos/politics/2022/08/30/melania-trump-mar-a-lago-fbi-search-bennett-new-day-sot-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220515151053-melania-trump-getty-super-tease.jpg","publishedAt":"2022-08-31T04:37:48.2070872Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Jeremy Herb, Tierney Sneed, Marshall Cohen, Evan Perez and Sara Murray, CNN","title":"Justice Department says classified documents at Mar-a-Lago were likely 'concealed and removed' to block investigation","description":"More than 320 classified documents have now been recovered from Mar-a-Lago, the Justice Department said","url":"http://us.cnn.com/2022/08/30/politics/mar-a-lago-justice-department-response/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830232932-doj-response-to-trump-special-master-super-tease.jpg","publishedAt":"2022-08-31T04:31:12Z","content":"(CNN)US government documents were \"likely concealed and removed\" from a storage room at Mar-a-Lago as part of an effort to \"obstruct\" the FBI's investigation into former President Donald Trump's pote… [+8274 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Rachel Ramirez, CNN","title":"First on CNN: The rise in extreme heat is taking a toll on our well-being. It's about to get worse","description":"A new study shows extreme heat is associated with a decrease in our sense of comfort and happiness.","url":"http://us.cnn.com/2022/08/31/world/extreme-heat-wellbeing-climate/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830133404-01-extreme-heat-wellbeing-080822-file-restricted-super-tease.jpg","publishedAt":"2022-08-31T04:05:10Z","content":"(CNN)Extreme heat is on the rise around the world, and a new study shows it is taking a significant toll not just on our physical health but also our sense of well-being.\r\nA new analysis by Gallup in… [+5714 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"CNN","title":"READ: The Justice Department's response to Trump's request for a special master","description":"The Justice Department on Tuesday responded to Judge Aileen Cannon of the Southern District of Florida regarding former President Donald Trump's request for a special master to oversee the FBI's review of materials seized in the Mar-a-Lago search.","url":"http://us.cnn.com/2022/08/30/politics/read-doj-response-trump-special-master/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210209035327-doj-seal-super-tease.jpg","publishedAt":"2022-08-31T03:48:17Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Scott Glover and Curt Devine","title":"Automatic weapons are 'everywhere,' and this machine gun adapter may be to blame","description":"The number of shootings involving automatic weapons in the US has skyrocketed in recent years, suggesting a troubling resurgence in the use of machine guns by criminals, according to an analysis provided exclusively to CNN.","url":"http://us.cnn.com/2022/08/30/us/automatic-machine-gun-fire-invs/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220825030652-assault-rifles-for-sale-super-tease.jpg","publishedAt":"2022-08-31T01:05:45Z","content":"(CNN)The number of shootings involving automatic weapons in the US has skyrocketed in recent years, suggesting a troubling resurgence in the use of machine guns by criminals, according to an analysis… [+11370 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Sandee LaMotte, CNN","title":"Common steroids used for asthma, allergies linked to brain decline, study finds","description":"Both oral and inhaled glucocorticoids used for asthma, allergies and other inflammatory conditions may be linked to decreased white matter, which limits connectivity between different regions of the brain, a new study finds.","url":"http://us.cnn.com/2022/08/30/health/oral-inhaled-steroids-brain-changes-wellness/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220830122706-02-oral-inhaled-steroids-brain-changes-wellness-stock-super-tease.jpg","publishedAt":"2022-08-30T22:31:16Z","content":"Tree and grass pollen -- the main causes of spring allergies -- can blow into your house if you open your windows even a crack, \"especially during the early morning hours, when tree pollen counts are… [+350 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Katie Bo Lillis, Evan Perez, Jamie Gangel and Zachary Cohen, CNN","title":"Intel agencies have been working with the FBI for months on assessing Mar-a-Lago documents","description":"The intelligence community has been working with the FBI since mid-May to examine some of the classified documents taken from Mar-a-Lago in order to determine their level of classification, according to multiple sources familiar with the matter.","url":"http://us.cnn.com/2022/08/29/politics/intelligence-review-documents-fbi-mar-a-lago-classification-sources/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220829162445-01-mar-a-lago-aerial-general-use-for-all-platforms-super-tease.jpg","publishedAt":"2022-08-30T11:51:17Z","content":"(CNN)The intelligence community has been working with the FBI since mid-May to examine some of the classified documents taken from Mar-a-Lago in order to determine their level of classification, acco… [+5087 chars]"}]}