{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Reuters","title":"Open Champion Cameron Smith says it's 'not fair' LIV golfers are not getting ranking points","description":"British Open champion Cameron Smith said on Wednesday he felt it was unfair that those who joined LIV Golf are not receiving world ranking points and hopes that changes before his exemption into golf's four majors expires.","url":"http://espn.go.com/golf/story/_/id/34499292/open-champion-cameron-smith-says-not-fair-liv-golfers-not-getting-ranking-points","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0901%2Fr1055742_1296x729_16%2D9.jpg","publishedAt":"2022-09-01T07:48:00Z","content":"British Open champion Cameron Smith said on Wednesday he felt it was unfair that those who joined LIV Golf are not receiving world ranking points and hopes that changes before his exemption into golf… [+2057 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Alexa PhilippouESPN ","title":"Candace Parker delivers another classic to lead Chicago Sky to series-evening win over Connecticut Sun","description":"Candace Parker had a team-high 22 points, four rebounds, four assists and three blocks Wednesday night, leading Chicago to a win over Connecticut, and leaving her coach comparing her to Napa Valley wine.","url":"http://espn.go.com/wnba/story/_/id/34498973/candace-parker-delivers-another-classic-lead-chicago-sky-series-evening-win-connecticut-sun","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0901%2Fr1055425_1296x729_16%2D9.jpg","publishedAt":"2022-09-01T05:49:00Z","content":"CHICAGO -- Behind a vintage performance from 14-year vet and two-time WNBA champion Candace Parker, the 2-seed and defending WNBA champion Chicago Sky evened their best-of-five semifinal series again… [+4835 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Heather Dinich","title":"Sources: CFP Board of Managers to meet, with 'momentum' toward playoff expansion","description":"The College Football Playoff's Board of Managers will hold a virtual meeting on Friday that could accelerate playoff expansion as early as 2024, sources confirmed to ESPN.","url":"http://espn.go.com/college-football/story/_/id/34497744/sources-cfp-board-managers-meet-momentum-playoff-expansion","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0521%2Fr1015694_600x400_3%2D2.jpg","publishedAt":"2022-09-01T01:54:28Z","content":"The College Football Playoff's Board of Managers will hold a virtual meeting on Friday that could accelerate playoff expansion as early as 2024 if the 11 presidents and chancellors who comprise the s… [+3991 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"D'Arcy Maine","title":"Serena Williams works magic again at US Open, upsets No. 2 seed Anett Kontaveit in Round 2","description":"In front of another capacity crowd inside Arthur Ashe Stadium Wednesday night, Serena Williams mustered the same magic that pushed her to victory two days ago, upsetting No. 2 seed Anett Kontaveit 7-6 (4), 2-6, 6-2 in the second round.","url":"http://espn.go.com/tennis/story/_/id/34497452/serena-williams-works-magic-again-us-open-upsets-no-2-seed-anett-kontaveit-round-2","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0901%2Fr1055678_1296x729_16%2D9.jpg","publishedAt":"2022-09-01T01:26:00Z","content":"NEW YORK -- Serena Williams' expected retirement was put on hold yet again after the 23-time major champion pulled off a 7-6 (4), 2-6, 6-2, upset over No. 2 seed Anett Kontaveit in the second round o… [+3402 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"MLB argues umpire Angel Hernandez's 3 overturned calls in 2018 ALDS cost him World Series spot","description":"Major League Baseball says Ángel Hernández was on track to umpire in the 2018 World Series before getting overturned three times at first base on video reviews during Game 3 of that year's AL Division Series.","url":"http://espn.go.com/mlb/story/_/id/34497311/mlb-argues-umpire-angel-hernandez-3-overturned-calls-2018-alds-cost-world-series-spot","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0425%2Fr692861_1296x1296_1%2D1.jpg","publishedAt":"2022-09-01T01:13:00Z","content":"NEW YORK -- Angel Hernandez was on track to umpire in the 2018 World Series before getting overturned three times at first base on video reviews during Game 3 of that year's AL Division Series betwee… [+4069 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"David NewtonESPN Staff Writer ","title":"Carolina Panthers' Baker Mayfield clears air, denies making remark about Cleveland Browns","description":"Carolina Panthers quarterback Baker Mayfield denied making the fiery remark about the Cleveland Browns that made waves on social media this week, \"It's not how I phrased it. It's not even what I said.\"","url":"http://espn.go.com/nfl/story/_/id/34496357/carolina-panthers-baker-mayfield-clears-air-denies-making-remark-cleveland-browns","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0809%2Fr1046202_1296x729_16%2D9.jpg","publishedAt":"2022-08-31T22:30:00Z","content":"CHARLOTTE, N.C. -- Baker Mayfield didn't deny he wants to beat the Cleveland Browns in the Carolina Panthers' Sept. 11 opener at Bank of America Stadium, but he did deny saying he wants to \"f--- them… [+5316 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Los Angeles Rams' Aaron Donald on swinging helmet at Cincinnati Bengals players - 'It was just a practice'","description":"Aaron Donald downplayed swinging a helmet at Bengals players in a brawl at a joint practice between last season's Super Bowl teams last Thursday.","url":"http://espn.go.com/nfl/story/_/id/34496215/los-angeles-rams-aaron-donald-swinging-helmet-was-just-practice","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0831%2Fr1055541_1296x729_16%2D9.jpg","publishedAt":"2022-08-31T22:18:00Z","content":"Aaron Donald downplayed swinging a helmet at Cincinnati Bengals players in a brawl at a joint practice between last season's Super Bowl teams this past Thursday.\r\n\"It was just a practice. It was foot… [+1086 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Chicago White Sox manager Tony La Russa out indefinitely with unspecified medical issue, source confirms","description":"White Sox manager Tony La Russa is out indefinitely with an unspecified medical issue, a source confirmed to ESPN.","url":"http://espn.go.com/mlb/story/_/id/34495319/chicago-white-sox-manager-tony-la-russa-indefinitely-unspecified-medical-issue-source-confirms","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1038067_1296x729_16%2D9.jpg","publishedAt":"2022-08-31T19:25:00Z","content":"Chicago White Sox manager Tony La Russa is out indefinitely with an unspecified medical issue, a source confirmed to ESPN's Jesse Rogers.\r\nBench coach Miguel Cairo will manage the White Sox on an int… [+627 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"ESPN Fantasy","title":"ESPN+ Cheat Sheet 2022 Do Not Draft list, Ranking Tiers and more","description":"The ESPN+ cheat sheet features Eric Karabell's tiered rankings, his Do Not Draft list and Mike Clay's Ultimate Draft Board, all on one printable PDF cheat sheet.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34422035/espn+-cheat-sheet-2022-do-not-draft-list-ranking-tiers-more","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050166_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T02:59:17Z","content":"In your quest for fantasy football knowledge, you've probably done a ton of research. Or simply searched the term \"top fantasy football players 2022.\" Either way, you're putting in the work. You're l… [+1593 chars]"}]}