{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Chris LowESPN Senior Writer ","title":"Steve Sarkisian says Texas Longhorns better positioned to compete after weeding out 'some of the warts' from last year","description":"For the second straight preseason the Longhorns are locked in a quarterback battle, but coach Steve Sarkisian sees notable differences from last year -- not just in the QBs vying for the starting job, but in his entire team's approach to the new season.","url":"http://espn.go.com/college-football/story/_/id/34415703/steve-sarkisian-says-texas-longhorns-better-equipped-compete-weeding-some-warts-last-year","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0818%2Fr1049687_1296x729_16%2D9.jpg","publishedAt":"2022-08-18T01:19:00Z","content":"AUSTIN, Texas -- Texas coach Steve Sarkisian said Wednesday he's closing in on naming a starting quarterback and believes the Longhorns are better equipped as a team than they were a year ago to face… [+5310 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jesse RogersESPN Staff Writer ","title":"MLB Umpires Association, adamant that crews are simply upholding rule, address home-plate collision rule in statement","description":"The Major League Baseball Umpires Association released a tersely worded statement Wednesday regarding the criticism they're receiving surrounding the home plate collision rule, saying simply \"don't block home plate without possession of the baseball.\"","url":"http://espn.go.com/mlb/story/_/id/34415630/mlb-umpires-association-adamant-crews-simply-upholding-rule-address-home-plate-collision-rule-statement","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0818%2Fr1049681_1296x729_16%2D9.jpg","publishedAt":"2022-08-18T00:50:00Z","content":"CHICAGO -- The Major League Baseball Umpires Association released a tersely worded statement Wednesday regarding the criticism they're receiving surrounding the home-plate collision rule.\r\nThe rule h… [+3237 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Brett Baty makes immediate impact for New York Mets, who place Eduardo Escobar on injured list","description":"Touted Mets prospect Brett Baty was in the lineup for his major league debut Wednesday night, batting eighth against the Braves. He said his mother, father, sister and several other relatives had flown to Atlanta for his big league debut.","url":"http://espn.go.com/mlb/story/_/id/34414857/brett-baty-excited-make-impact-new-york-mets-place-eduardo-escobar-injured-list","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0817%2Fr1049630_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T22:44:00Z","content":"ATLANTA -- The New York Mets called up top prospect Brett Baty on Wednesday to fill in at third base for ailing Eduardo Escobar, putting the 22-year-old in the middle of a spirited race for the NL Ea… [+3846 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Pete Thamel","title":"College Football Playoff's board discusses possibility, potential of restructuring how college football is governed, sources say","description":"The 11 college presidents and chancellors who make up the College Football Playoff's Board of Managers met via Zoom on Monday and began a discussion that could reshape the future of college sports, sources have told ESPN.","url":"http://espn.go.com/college-football/story/_/id/34414293/college-football-playoff-board-discusses-possibility-potential-restructuring-how-college-football-governed-sources-say","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0817%2Fr1049579_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T20:48:00Z","content":"The 11 college presidents and chancellors who make up the College Football Playoff's Board of Managers met via Zoom on Monday and began a discussion that could reshape the future of college sports, s… [+3132 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Rob Demovsky","title":"Green Bay Packers young WRs meet with QBs after Aaron Rodgers' rant","description":"A day after Aaron Rodgers expressed his frustration with the Packers' young wide receivers, they were instructed to report to the quarterback meeting room Wednesday morning and met with all three quarterbacks.","url":"http://espn.go.com/nfl/story/_/id/34413984/green-bay-packers-young-wrs-meet-qbs-aaron-rodgers-rant","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0904%2Fr593566_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T20:03:00Z","content":"GREEN BAY, Wis. -- Rip them one day, meet with them the next. Those were the last two days in the life of Green Bay Packers quarterback Aaron Rodgers' quest to get a young group of receivers ready fo… [+3615 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adrian WojnarowskiSenior NBA Insider ","title":"LeBron James, Los Angeles Lakers agree to 2-year, $97.1 million extension that includes 3rd-year player option","description":"Lakers star LeBron James has agreed to a two-year, $97.1 million contract extension that includes a player option for the 2024-25 season, Klutch Sports CEO Rich Paul told ESPN.","url":"http://espn.go.com/nba/story/_/id/34413561/lebron-james-los-angeles-lakers-agree-2-year-971-million-extension-includes-3rd-year-player-option","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0210%2Fr972475_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T18:58:00Z","content":"Los Angeles Lakers star LeBron James has agreed to a two-year, $97.1 million contract extension that includes a player option for the 2024-25 season, Klutch Sports CEO Rich Paul told ESPN on Wednesda… [+1685 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Ben BabyESPN Staff Writer ","title":"Cincinnati Bengals QB Joe Burrow says his appendix ruptured, prompting surgery","description":"In his first news conference since his appendectomy on July 26, Bengals quarterback Joe Burrow said his appendix ruptured, which prompted surgery.","url":"http://espn.go.com/nfl/story/_/id/34413347/cincinnati-bengals-qb-joe-burrow-says-appendix-ruptured-prompting-surgery","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0706%2Fr1033305_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T17:41:00Z","content":"CINCINNATI -- What initially felt like discomfort for Cincinnati Bengals quarterback Joe Burrow turned into a more serious and pressing matter, he said Wednesday.\r\nIn his first news conference since … [+2644 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Christian McCaffrey knocked to ground, fan injured during scuffle at Carolina Panthers-New England Patriots joint practice","description":"Panthers star running back Christian McCaffrey was involved in a scuffle Wednesday during a joint practice with the Patriots that left a fan injured.","url":"http://espn.go.com/nfl/story/_/id/34412902/christian-mccaffrey-knocked-ground-fan-injured-scuffle-carolina-panthers-new-england-patriots-joint-practice","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0817%2Fr1049450_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T15:59:00Z","content":"Carolina Panthers star running back Christian McCaffrey was involved in a scuffle Wednesday during a joint practice with the New England Patriots that left a fan injured.\r\nMcCaffrey, who was out of b… [+825 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Pro Football Focus","title":"NFL bounce-back candidates - What went wrong for 32 struggling players, including Alvin Kamara, Baker Mayfield, plus 2022 outlooks","description":"Will Alvin Kamara, Khalil Mack and Baker Mayfield recover after lost seasons? Here's how 32 players could return to form in 2022.","url":"http://espn.go.com/nfl/insider/story/_/id/34383954/nfl-bounce-back-candidates-went-wrong-32-struggling-players-including-alvin-kamara-baker-mayfield-plus-2022-outlooks","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1048927_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T10:50:00Z","content":"Every NFL player has expectations coming into each season. Some will meet them. Others will exceed them.\r\nAnd then there are those who will fall short, some woefully. That's where we're putting our a… [+29345 chars]"}]}