{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Chris LowESPN Senior Writer ","title":"Texas A&M Aggies football coach Jimbo Fisher addresses Nick Saban spat, says 'it's time to shut up and play'","description":"Jimbo Fisher feels the best he has about the trajectory of Texas A&M's football program, and he's ready for the story to become what the Aggies do on the field and not his offseason spat with former boss Nick Saban.","url":"http://espn.go.com/college-football/story/_/id/34427131/texas-aggies-football-coach-jimbo-fisher-addresses-nick-saban-spat-says-shut-play","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0820%2Fr1050527_1296x729_16%2D9.jpg","publishedAt":"2022-08-20T01:23:00Z","content":"COLLEGE STATION, Texas -- Jimbo Fisher feels the best he has about the trajectory of Texas A&amp;M's football program, and he's ready for the story to become what the Aggies do on the field and not h… [+8820 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"San Diego Padres' Blake Snell cleared to start day after DUI suspect hits car","description":"San Diego Padres lefty Blake Snell was cleared for his scheduled start Friday, one night after he was involved in a minor crash during a traffic stop.","url":"http://espn.go.com/mlb/story/_/id/34426999/san-diego-padres-blake-snell-cleared-start-day-dui-suspect-hits-car","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0908%2Fr906087_1296x729_16%2D9.jpg","publishedAt":"2022-08-20T00:33:00Z","content":"Padres left-hander Blake Snell was cleared to make his start in San Diego against the Washington Nationals on Friday, one night after his vehicle was struck by a suspected drunk driver during a traff… [+999 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Joon LeeESPN ","title":"New York Yankees' Giancarlo Stanton poised to go on rehab assignment this weekend, Aaron Boone says","description":"Yankees slugger Giancarlo Stanton will work out before Friday's game, and if all goes well, will go on a rehab assignment with the Somerset Patriots on Saturday and Sunday, manager Aaron Boone told reporters Friday.","url":"http://espn.go.com/mlb/story/_/id/34426489/new-york-yankees-giancarlo-stanton-poised-go-rehab-assignment-weekend-aaron-boone-says","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050455_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T21:18:00Z","content":"NEW YORK -- The Yankees are one step closer to getting one of their biggest sluggers back in the lineup.\r\nGiancarlo Stanton will work out before Friday's game against the Toronto Blue Jays and if all… [+1895 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Vanessa Bryant testifies on 'hurt' caused by photos of Kobe Bryant taken at crash site","description":"Vanessa Bryant said she was \"blindsided again, devasted, hurt\" after learning that sheriff's deputies and firefighters had shared photos of Kobe and Gianna's bodies at the crash site.","url":"http://espn.go.com/nba/story/_/id/34426414/vanessa-bryant-testifies-hurt-caused-photos-kobe-bryant-taken-crash-site","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0225%2Fr670926_1093x615_16%2D9.jpg","publishedAt":"2022-08-19T21:12:54Z","content":"LOS ANGELES -- Vanessa Bryant testified Friday that she only beginning to grieve the loss of her husband basketball star Kobe Bryant and their 13-year-old daughter Gianna when she was faced with the … [+4862 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"ESPN","title":"Manchester United announce agreement with Real Madrid for €60m Casemiro signing","description":"Manchester United have completed the signing of Casemiro from Real Madrid, ending their months-long search for a midfielder.","url":"http://espn.go.com/soccer/soccer-transfers/story/4724889/manchester-united-announce-agreement-with-real-madrid-for-60m-casemiro-signing","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050203_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T19:15:00Z","content":"Manchester United have announced an agreement with Real Madrid to sign midfielder Casemiro. The transfer is subject to the agreement of personal terms, UK visa requirements and a medical, United said… [+2893 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adam RittenbergESPN Senior Writer ","title":"Quinn Ewers named starting quarterback for Texas Longhorns","description":"Quinn Ewers, who transferred to Texas from Ohio State after having not attempted a pass last season, beat out Hudson Card to be the starting quarterback for the Longhorns in 2022.","url":"http://espn.go.com/college-football/story/_/id/34425570/quinn-ewers-named-starting-quarterback-texas-longhorns","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0502%2Fr1007563_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T18:03:00Z","content":"The Texas Longhorns have named Quinn Ewers, the heralded recruit who began his college career early at Ohio State to capitalize on name, image and likeness opportunities before transferring back to h… [+1466 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jake TrotterESPN Staff Writer ","title":"Jacoby Brissett looks to 'prove every day' he's right QB to replace Deshaun Watson for Cleveland Browns","description":"The Browns have been steadfast in their support of Jacoby Brissett as the team's starting quarterback while Deshaun Watson is suspended, and the veteran back up says he doesn't take his position lightly.","url":"http://espn.go.com/nfl/story/_/id/34425365/jacoby-brissett-looks-prove-every-day-right-qb-replace-deshaun-watson-cleveland-browns","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050345_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T17:18:00Z","content":"BEREA, Ohio -- After losing quarterback Deshaun Watson to an 11-game suspension, the Cleveland Browns continue insist that they are \"comfortable\" and \"confident\" in Jacoby Brissett as their starter w… [+2207 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"D'Arcy Maine","title":"Top-ranked Iga Swiatek questions why US Open still uses different tennis balls for men and women","description":"Reigning world No. 1 Iga Swiatek says the balls used at the US Open are \"horrible\" and wonders why the final major of the season is the only Grand Slam that still uses different balls for the men and women.","url":"http://espn.go.com/tennis/story/_/id/34425055/top-ranked-iga-swiatek-questions-why-us-open-uses-different-tennis-balls-men-women","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050334_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T16:13:36Z","content":"Reigning world No. 1 and two-time major champion Iga Swiatek called the balls used at the US Open \"horrible\" during a news conference at the Western &amp; Southern Open this week, and questioned why … [+3561 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Eric KarabellESPN Senior Writer ","title":"Fantasy football rankings - Eric Karabell's quarterback tiers","description":"Rankings are important when drafting; it's even more important to know where value drops off at each position. Eric Karabell breaks the QBs into tiers.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34409048/fantasy-football-rankings-eric-karabell-quarterback-tiers","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1216%2Fr951911_1296x729_16%2D9.jpg","publishedAt":"2022-08-18T11:00:00Z","content":"Fantasy football drafts are all about value, supply and demand and, to some degree, just plain going with your gut. Anyone can see the raw stats from last season, project ahead and make those numbers… [+5809 chars]"}]}