{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Houston Astros' Triple-A affiliate goes off in 17-run inning","description":"The Sugar Land Space Cowboys, the Houston Astros' Triple-A affiliate, scored 17 runs in one inning Friday night in their 21-4 win over the Oklahoma City Dodgers.","url":"http://espn.go.com/mlb/story/_/id/34427862/houston-astros-triple-affiliate-goes-17-run-inning","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F0802%2Fmlb_baseball_b1_1296x729.jpg","publishedAt":"2022-08-20T05:08:11Z","content":"The Sugar Land Space Cowboys put together an inning for the ages Friday night, sending 23 men to the plate and scoring 17 runs in the sixth during a 21-4 win over the Oklahoma City Dodgers in Sugar L… [+1208 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marly RiveraESPN Writer ","title":"Aaron Boone after New York Yankees blanked again - 'We should be ticked off right now'","description":"Aaron Boone lit into the Yankees after their fifth shutout loss in August, saying the team should be \"ticked off\" about their recent play.","url":"http://espn.go.com/mlb/story/_/id/34427813/aaron-boone-new-york-yankees-blanked-again-ticked-right-now","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0820%2Fr1050565_1024x576_16%2D9.jpg","publishedAt":"2022-08-20T04:41:00Z","content":"NEW YORK -- After another lackluster performance by the New York Yankees in their 4-0 loss to the Toronto Blue Jays Friday night, manager Aaron Boone took his team to task.\r\n\"We should be ticked off … [+3938 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Houston Astros' Yordan Alvarez hospitalized in Atlanta area after exiting game","description":"Astros manager Dusty Baker said Yordan Alvarez had shortness of breath, which was made worse by the smoke in the air after the Braves shot off fireworks at Truist Park.","url":"http://espn.go.com/mlb/story/_/id/34427590/houston-astros-yordan-alvarez-hospitalized-atlanta-area-exiting-game","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0820%2Fr1050559_1296x729_16%2D9.jpg","publishedAt":"2022-08-20T03:18:00Z","content":"Houston Astros slugger Yordan Alvarez felt ill on the field and was removed with two outs in the bottom of the fifth inning of Friday night's game against the Braves in Atlanta.\r\nAccording to the tea… [+660 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Former major league pitcher Bill Lee collapses while warming up for Savanah Bananas","description":"Former Boston Red Sox star Bill Lee collapsed in the bullpen while warming up for the Savannah Bananas amateur team Friday night, but the 75-year-old pitcher walked off the field with assistance.","url":"http://espn.go.com/mlb/story/_/id/34427438/former-major-league-pitcher-bill-lee-collapses-warming-savanah-bananas","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2016%2F0524%2Fr86152_1296x729_16%2D9.jpg","publishedAt":"2022-08-20T02:53:00Z","content":"SAVANNAH, Ga. -- Former Boston Red Sox star Bill Lee collapsed in the bullpen while warming up for the Savannah Bananas amateur team Friday night, but the 75-year-old pitcher walked off the field wit… [+764 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Chris LowESPN Senior Writer ","title":"Texas A&M Aggies football coach Jimbo Fisher addresses Nick Saban spat, says 'it's time to shut up and play'","description":"Jimbo Fisher feels the best he has about the trajectory of Texas A&M's football program, and he's ready for the story to become what the Aggies do on the field and not his offseason spat with former boss Nick Saban.","url":"http://espn.go.com/college-football/story/_/id/34427131/texas-aggies-football-coach-jimbo-fisher-addresses-nick-saban-spat-says-shut-play","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0820%2Fr1050527_1296x729_16%2D9.jpg","publishedAt":"2022-08-20T01:23:00Z","content":"COLLEGE STATION, Texas -- Jimbo Fisher feels the best he has about the trajectory of Texas A&amp;M's football program, and he's ready for the story to become what the Aggies do on the field and not h… [+8820 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"San Diego Padres' Blake Snell cleared to start day after DUI suspect hits car","description":"San Diego Padres lefty Blake Snell was cleared for his scheduled start Friday, one night after he was involved in a minor crash during a traffic stop.","url":"http://espn.go.com/mlb/story/_/id/34426999/san-diego-padres-blake-snell-cleared-start-day-dui-suspect-hits-car","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0908%2Fr906087_1296x729_16%2D9.jpg","publishedAt":"2022-08-20T00:33:00Z","content":"Padres left-hander Blake Snell was cleared to make his start in San Diego against the Washington Nationals on Friday, one night after his vehicle was struck by a suspected drunk driver during a traff… [+999 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Vanessa Bryant testifies on 'hurt' caused by photos of Kobe Bryant taken at crash site","description":"Vanessa Bryant said she was \"blindsided again, devasted, hurt\" after learning that sheriff's deputies and firefighters had shared photos of Kobe and Gianna's bodies at the crash site.","url":"http://espn.go.com/nba/story/_/id/34426414/vanessa-bryant-testifies-hurt-caused-photos-kobe-bryant-taken-crash-site","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0225%2Fr670926_1093x615_16%2D9.jpg","publishedAt":"2022-08-19T21:12:54Z","content":"LOS ANGELES -- Vanessa Bryant testified Friday that she only beginning to grieve the loss of her husband basketball star Kobe Bryant and their 13-year-old daughter Gianna when she was faced with the … [+4862 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adam RittenbergESPN Senior Writer ","title":"Quinn Ewers named starting quarterback for Texas Longhorns","description":"Quinn Ewers, who transferred to Texas from Ohio State after having not attempted a pass last season, beat out Hudson Card to be the starting quarterback for the Longhorns in 2022.","url":"http://espn.go.com/college-football/story/_/id/34425570/quinn-ewers-named-starting-quarterback-texas-longhorns","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0502%2Fr1007563_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T18:03:00Z","content":"The Texas Longhorns have named Quinn Ewers, the heralded recruit who began his college career early at Ohio State to capitalize on name, image and likeness opportunities before transferring back to h… [+1466 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Eric KarabellESPN Senior Writer ","title":"Fantasy football rankings - Eric Karabell's quarterback tiers","description":"Rankings are important when drafting; it's even more important to know where value drops off at each position. Eric Karabell breaks the QBs into tiers.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34409048/fantasy-football-rankings-eric-karabell-quarterback-tiers","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1216%2Fr951911_1296x729_16%2D9.jpg","publishedAt":"2022-08-18T11:00:00Z","content":"Fantasy football drafts are all about value, supply and demand and, to some degree, just plain going with your gut. Anyone can see the raw stats from last season, project ahead and make those numbers… [+5809 chars]"}]}