{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Michael DiRoccoESPN Staff Writer ","title":"Jacksonville Jaguars' Travon Walker debuts, gets first sack in Hall of Fame game","description":"Jacksonville Jaguars top pick Travon Walker made his presence felt Thursday night in his NFL debut, registering a sack against the Las Vegas Raiders in the Hall of Fame game.","url":"http://espn.go.com/nfl/story/_/id/34349650/jacksonville-jaguars-travon-walker-debuts-gets-first-sack-hall-fame-game","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0805%2Fr1044654_1296x729_16%2D9.jpg","publishedAt":"2022-08-05T05:02:00Z","content":"CANTON, Ohio -- Jacksonville Jaguars rookie Travon Walker wasted no time making an impact in his first NFL game.\r\nWalker, the No. 1 overall pick in this year's NFL draft, played only two series in hi… [+2604 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Calgary Flames, Jonathan Huberdeau putting final touches on 8-year, $84 million extension","description":"The Calgary Flames signed newly-acquired forward Jonathan Huberdeau to an eight-year, $84 million contract extension on Thursday, the team announced.","url":"http://espn.go.com/nhl/story/_/id/34349352/calgary-flames-jonathan-huberdeau-putting-final-touches-8-year-84-million-extension","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0223%2Fr978370_1296x729_16%2D9.jpg","publishedAt":"2022-08-05T03:17:00Z","content":"The Calgary Flames have signed newly acquired forward Jonathan Huberdeau to an eight-year, $84 million contract extension, the team announced on Thursday.\r\n\"I'm thrilled to be part of the Calgary Fla… [+1112 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"NASCAR driver Kyle Busch, family escape shooting at Mall of America in Minnesota","description":"Kyle Busch, a two-time NASCAR Cup series champion, and his family safely escaped the Mall of America in suburban Minneapolis after someone fired shots.","url":"http://espn.go.com/racing/nascar/story/_/id/34349220/nascar-driver-kyle-busch-family-escape-shooting-mall-america-minnesota","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0805%2Fr1044642_1296x729_16%2D9.jpg","publishedAt":"2022-08-05T03:11:00Z","content":"BLOOMINGTON, Minn. -- Kyle Busch, a two-time NASCAR Cup series champion, and his family safely escaped the Mall of America in suburban Minneapolis after someone fired shots.\r\nBloomington police, whic… [+894 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Los Angeles Angels equal dubious MLB milestone with 7 home runs hit in losing cause","description":"The Los Angeles Angels tied a dubious major league record when they smashed seven home runs -- all solo shots -- but still lost to the Oakland Athletics 8-7 Thursday.","url":"http://espn.go.com/mlb/story/_/id/34348870/los-angeles-angels-equal-dubious-mlb-milestone-7-home-runs-hit-losing-cause","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0506%2Fr695896_1296x729_16%2D9.jpg","publishedAt":"2022-08-05T01:05:00Z","content":"The Los Angeles Angels tied a dubious major league record when they smashed seven home runs -- all solo shots -- but still lost to the Oakland Athletics8-7 Thursday.\r\nThe Angels are just the second t… [+1794 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Detroit Tigers legend Miguel Cabrera uncertain if he'll play beyond this season","description":"Miguel Cabrera, who had previously stated he would like to play in 2023, admitted Thursday he's not sure if this season will be his curtain call.","url":"http://espn.go.com/mlb/story/_/id/34348673/detroit-tigers-legend-miguel-cabrera-uncertain-play-season","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0422%2Fr1003274_1296x729_16%2D9.jpg","publishedAt":"2022-08-05T00:03:00Z","content":"Detroit Tigers legend Miguel Cabrera for the first time on Thursday said this may be the final season in his Hall of Fame career.\r\nCabrera had previously stated he wanted to play through the end of h… [+1525 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Sarah BarshopESPN Staff Writer ","title":"Los Angeles Rams coach Sean McVay says Matthew Stafford's elbow pain 'abnormal for a quarterback'","description":"Los Angeles Rams head coach Sean McVay said quarterback Matthew Stafford's right elbow pain is \"a little bit abnormal for a quarterback,\" comparing it instead to what pitchers deal with.","url":"http://espn.go.com/nfl/story/_/id/34348525/los-angeles-rams-coach-sean-mcvay-says-matthew-stafford-elbow-pain-abnormal-quarterback","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fi%2Fheadshots%2Fnfl%2Fplayers%2Ffull%2F12483.png","publishedAt":"2022-08-04T23:03:00Z","content":"IRVINE, Calif. -- Los Angeles Rams head coach Sean McVay said quarterback Matthew Stafford's right elbow pain is \"a little bit abnormal for a quarterback,\" comparing it instead to what pitchers deal … [+2388 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Former New Jersey Attorney General Peter C. Harvey selected to hear NFL's appeal of Deshaun Watson decision","description":"New Jersey Attorney General Peter C. Harvey was selected by Roger Goodell to hear the NFL's appeal of the disciplinary decision involving Deshaun Watson.","url":"http://espn.go.com/nfl/story/_/id/34347555/former-new-jersey-attorney-general-peter-c-harvey-selected-hear-nfl-appeal-deshaun-watson-decision","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0207%2Fr971359_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T20:17:00Z","content":"Former New Jersey Attorney General Peter C. Harvey has been designated by NFL commissioner Roger Goodell to hear the appeal of the disciplinary decision involving Cleveland Browns quarterback Deshaun… [+314 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"T.J. QuinnESPN Staff Writer ","title":"Brittney Griner sentenced to nine years in Russian prison","description":"Brittney Griner has been found guilty of drug possession and smuggling and was sentenced to nine years in a Russian prison, an expected conclusion to her trial that should allow negotiations for a prisoner swap to accelerate.","url":"http://espn.go.com/wnba/story/_/id/34346379/brittney-griner-found-guilty-drug-possession-smuggling","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0804%2Fr1044336_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T15:20:00Z","content":"A Russian court sentenced WNBA star Brittney Griner to nine years in prison Thursday, an expected conclusion to her trial that should allow negotiations for a prisoner swap to accelerate.\r\nGriner, wh… [+5607 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Kevin PeltonESPN Senior Writer ","title":"NBA offseason grades - Where the Los Angeles Lakers, Golden State Warriors and every West team check in","description":"Which West team has had the best offseason so far? Would you believe it was the franchise that just traded one of its superstars?","url":"http://espn.go.com/nba/insider/story/_/id/34336524/nba-offseason-grades-where-los-angeles-lakers-golden-state-warriors-every-west-team-check-in","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0217%2Fr975392_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T12:00:00Z","content":"Which NBA Western Conference teams have done the best and worst this offseason?\r\nAlthough the futures of Kevin Durant and Donovan Mitchell remain unresolved, the bulk of the NBA's summer activity has… [+12723 chars]"}]}