{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Mechelle VoepelESPN.com ","title":"Sabrina Ionescu ties Candace Parker's career triple-doubles record in historic performance for New York Liberty","description":"Sabrina Ionescu registered the third triple-double of her career -- and the highest-scoring triple-double in WNBA history -- as the Liberty prevailed in an offensive showdown with the Aces on Wednesday.","url":"http://espn.go.com/wnba/story/_/id/34204553/sabrina-ionescu-ties-candace-parker-career-triple-doubles-record-historic-performance-new-york-liberty","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0707%2Fr1033513_1296x729_16%2D9.jpg","publishedAt":"2022-07-07T06:08:09Z","content":"The New York Liberty set a franchise record for points as guard Sabrina Ionescu got her second triple-double of the season in a 116-107 victory at the Las Vegas Aces on Wednesday.\r\nIonescu's 31 point… [+2827 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Josh WeinfussESPN Staff Writer ","title":"Emotional Cherelle Griner tells rally of her frustration with wife Brittney Griner's detention, vows not to rest until she is free","description":"Cherelle Griner, the wife of Mercury center Brittney Griner, said Wednesday at a rally for the WNBA star's freedom that \"what and how I feel today is a deeper emotion than hurt. I'm frustrated.\"","url":"http://espn.go.com/wnba/story/_/id/34204372/emotional-cherelle-griner-tells-rally-frustration-wife-brittney-griner-detention-vows-not-rest-free","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0707%2Fr1033494_1296x729_16%2D9.jpg","publishedAt":"2022-07-07T04:23:51Z","content":"PHOENIX -- As her voice cracked, Cherelle Griner, the wife of Phoenix Mercury center Brittney Griner, told the crowd assembled inside the Footprint Center in downtown Phoenix on Wednesday afternoon f… [+4680 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Los Angeles Angels star Shohei Ohtani extends 0 earned run streak to four starts","description":"Shohei Ohtani became the sixth pitcher since earned runs became official to have 10 strikeouts and 0 earned runs in three straight starts.","url":"http://espn.go.com/mlb/story/_/id/34204213/los-angeles-angels-star-shohei-ohtani-extends-0-earned-run-streak-four-starts","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0707%2Fr1033481_1024x576_16%2D9.jpg","publishedAt":"2022-07-07T03:09:00Z","content":"MIAMI -- Shohei Ohtani continued his recent run of dominance on the mound, allowing one unearned run while striking out 10 in the Los Angeles Angels' 5-2 victory over the Miami Marlins on Wednesday n… [+2263 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Center Rudy Gobert says he's ready 'to win a championship' with Minnesota Timberwolves","description":"\"The goal is to win a championship,\" new Timberwolves center Rudy Gobert said. \"I came here for that.\"","url":"http://espn.go.com/nba/story/_/id/34203442/center-rudy-gobert-says-ready-win-championship-minnesota-timberwolves","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0706%2Fr1033391_1296x729_16%2D9.jpg","publishedAt":"2022-07-06T23:42:00Z","content":"Rudy Gobert reads Twitter comments, so he's aware that Minnesota fans didn't like him very much during his first nine NBA seasons. And he also heard Timberwolves coach Chris Finch complain regularly … [+3419 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Andrew Lopez","title":"New Orleans Pelicans' Zion Williamson after signing extension - Want to prove I'm a winner","description":"Zion Williamson's extension does not include a player option, something David Griffin says shows his \"level of commitment to this organization.\"","url":"http://espn.go.com/nba/story/_/id/34203393/new-orleans-pelicans-zion-williamson-signing-extension-want-prove-winner","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0929%2Fr916209_1296x729_16%2D9.jpg","publishedAt":"2022-07-06T22:57:00Z","content":"NEW ORLEANS -- What a difference a year makes.\r\nLast year on July 6, his 21st birthday, Zion Williamson found out that he had suffered a broken right foot, an injury that ended up costing him the 202… [+5301 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mechelle VoepelESPN.com ","title":"Iowa women's basketball commitment, family, seriously injured after being struck by car","description":"Ava Jones, a rising high school senior from Kansas who verbally committed to Iowa's women's basketball team Sunday, was seriously injured along with her parents when they were struck by a car in Louisville on Tuesday night.","url":"http://espn.go.com/womens-college-basketball/story/_/id/34203197/iowa-women-basketball-commitment-family-seriously-injured-being-struck-car","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F1116%2Fr26442_1296x729_16%2D9.jpg","publishedAt":"2022-07-06T22:18:00Z","content":"Ava Jones, a rising high school senior from Kansas who verbally committed to Iowa's women's basketball team Sunday, was seriously injured along with her parents when they were struck by a car in Loui… [+1418 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jake TrotterESPN Staff Writer ","title":"Source - Cleveland Browns trade Baker Mayfield to Carolina Panthers for conditional draft pick","description":"The Cleveland Browns have agreed to trade quarterback Baker Mayfield to the Carolina Panthers in exchange for a conditional draft pick, a source confirmed to ESPN.","url":"http://espn.go.com/nfl/story/_/id/34201889/cleveland-browns-trade-baker-mayfield-carolina-panthers-draft-pick","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1226%2Fr955117_1296x729_16%2D9.jpg","publishedAt":"2022-07-06T17:43:00Z","content":"BEREA, Ohio -- The Cleveland Browns have agreed to trade quarterback Baker Mayfield to the Carolina Panthers in exchange for a conditional draft pick, a source confirmed to ESPN.\r\nThe Panthers will p… [+7415 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Nick Kyrgios reaches men's singles semifinals at Wimbledon","description":"Australian Nick Kyrgios, who is currently ranked No. 40 in the world, beat Cristian Garin to become the lowest ranked and first unseeded men's semifinalist at Wimbledon since 2008.","url":"http://espn.go.com/tennis/story/_/id/34201594/nick-kyrgios-reaches-men-singles-semifinals-wimbledon","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0706%2Fr1033212_1296x729_16%2D9.jpg","publishedAt":"2022-07-06T16:53:00Z","content":"LONDON -- Nick Kyrgios advanced to the semifinals at a Grand Slam tournament for the first time by beating Cristian Garin 6-4, 6-3, 7-6 (5) on Centre Court at Wimbledon on Wednesday.\r\nKyrgios reached… [+376 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"'It's a dying breed. And it sucks' - The decline of the starting pitcher -- and what it means for baseball's future","description":"Starters have never thrown harder -- or less. Here's why finding a solution to its ace problem is crucial for MLB.","url":"http://espn.go.com/mlb/insider/story/_/id/34196864/dying-breed-sucks-decline-starting-pitcher-means-baseball-future","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0705%2Fr1032887_1296x729_16%2D9.jpg","publishedAt":"2022-07-06T11:00:00Z","content":"ALEK MANOAH IS a man of many opinions, and one of those is that with a gilded right arm and 6-foot-6 and 285 pounds of mass to buttress it, he should throw the baseball as much as he can. But during … [+27215 chars]"}]}