{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"M.A. VoepelESPN.com ","title":"Minnesota Lynx celebrate Sylvia Fowles in last regular-season home game ahead of WNBA legend's retirement","description":"Fans, teammates past and present, and admiring opponents were all on hand Friday night to celebrate Minnesota Lynx and WNBA legend Sylvia Fowles in her last regular-season home game before retirement.","url":"http://espn.go.com/wnba/story/_/id/34392415/minnesota-lynx-celebrate-sylvia-fowles-last-regular-season-home-game-ahead-wnba-legend-retirement","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0813%2Fr1047789_1296x729_16%2D9.jpg","publishedAt":"2022-08-13T06:24:00Z","content":"MINNEAPOLIS -- As the Target Center crowd chanted \"Syl's House!\" and teammates and opponents alike looked on with pride, Minnesota Lynx center Sylvia Fowles soaked up the affection here Friday night.… [+6608 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Josh WeinfussESPN Staff Writer ","title":"Kyler Murray dons headset, calls plays in Arizona Cardinals' first preseason game","description":"Kyler Murray helped call offensive plays during the fourth quarter of the Cardinals' win over the Bengals on Friday night.","url":"http://espn.go.com/nfl/story/_/id/34392185/kyler-murray-dons-headset-calls-plays-arizona-cardinals-first-preseason-game","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0813%2Fr1047774_1024x576_16%2D9.jpg","publishedAt":"2022-08-13T04:10:00Z","content":"He may not have been in uniform on Friday night but Arizona Cardinals quarterback Kyler Murray was still able to put to use what he did in practice in the weeks leading up to the first preseason game… [+2444 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Rich CiminiESPN Staff Writer ","title":"Jets QB Zach Wilson exits preseason opener with right knee injury","description":"Quarterback Zach Wilson injured his right knee on the second series of the New York Jets' preseason opener against Philadelphia and limped immediately to the locker room Friday night.","url":"http://espn.go.com/nfl/story/_/id/34391061/jets-qb-zach-wilson-exits-preseason-opener-right-knee-injury","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0524%2Fr1017062_1296x729_16%2D9.jpg","publishedAt":"2022-08-13T00:45:17Z","content":"PHILADELPHIA - The New York Jets' preseason began in the worst possible fashion, as quarterback Zach Wilson injured his right knee on the second series and limped immediately to the locker room Frida… [+935 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"San Diego Padres star Fernando Tatis Jr. suspended 80 games after testing positive for PED","description":"Fernando Tatis Jr. tested positive for Clostebol, a performance-enhancing substance, and will miss the remainder of the season.","url":"http://espn.go.com/mlb/story/_/id/34390702/san-diego-padres-star-fernando-tatis-jr-suspended-80-games-ped-violation","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0314%2Fr986118_1296x729_16%2D9.jpg","publishedAt":"2022-08-12T23:09:00Z","content":"San Diego Padres shortstop Fernando Tatis Jr. has been suspended for 80 games after testing positive for Clostebol, a performance-enhancing substance in violation of Major League Baseball's Joint Dru… [+5065 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Rory Sabbatini to keep full PGA Tour card after reworked rankings following LIV Golf fallout","description":"Rory Sabbatini will move from No. 31 on the PGA Tour career money list to No. 22 after LIV Golf suspensions and resignations take effect, meaning he can use an exemption and have a full PGA Tour card for next season.","url":"http://espn.go.com/golf/story/_/id/34390660/rory-sabbatini-keep-full-pga-tour-card-reworked-rankings-following-liv-golf-fallout","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0613%2Fr556382_1296x729_16%2D9.jpg","publishedAt":"2022-08-12T23:06:00Z","content":"MEMPHIS, Tenn. -- Rory Sabbatini can get a full PGA Tour card for next season, courtesy of the players who have signed up with Saudi-funded LIV Golf and have been suspended.\r\nThe circumstances evolve… [+1751 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jake TrotterESPN Staff Writer ","title":"Cleveland Browns' Deshaun Watson, in interview, apologizes to 'all of the women that I have impacted in this situation'","description":"Browns quarterback Deshaun Watson, for the first time, apologized to the women who have accused him of sexual misconduct during massage sessions in an interview Friday.","url":"http://espn.go.com/nfl/story/_/id/34390654/cleveland-browns-deshaun-watson-interview-apologizes-all-women-impacted-situation","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0812%2Fr1047678_1296x729_16%2D9.jpg","publishedAt":"2022-08-12T22:56:28Z","content":"JACKSONVILLE, Fla. -- Cleveland Browns quarterback Deshaun Watson, for the first time, apologized to the women who have accused him of sexual misconduct during massage sessions in an interview Friday… [+3475 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Associated Press","title":"Journeyman Wynton Bernard keys Colorado Rockies win after 10 seasons in minors","description":"Wynton Bernard, who spent the last 10 years in the minor leagues, had a memorable Major League debut by singling and stealing a base in the Colorado Rockies' 5-3 win over the Arizona Diamondbacks on Friday night.","url":"http://espn.go.com/mlb/story/_/id/34390652/journeyman-wynton-bernard-keys-colorado-rockies-win-10-seasons-minors","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0812%2Fr1047689_1296x729_16%2D9.jpg","publishedAt":"2022-08-12T22:54:00Z","content":"DENVER -- Wynton Bernard finally got his chance to play in the major leagues a decade after he was drafted by the San Diego Padres.\r\nBernard singled, stole a base and scored in his major league debut… [+2442 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marc Raimondi","title":"UFC president Dana White not planning fighter raises - 'These guys get paid what they're supposed to get paid'","description":"UFC president Dana White reiterated in a GQ interview that he believes his promotion's fighters are paid reasonably and that a dramatic change isn't coming while he is in charge.","url":"http://espn.go.com/mma/story/_/id/34389555/ufc-president-dana-white-not-planning-fighter-raises-guys-get-paid-supposed-get-paid","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1218%2Fr952786_1296x729_16%2D9.jpg","publishedAt":"2022-08-12T18:16:00Z","content":"UFC president Dana White says fighter pay in the organization won't change dramatically while he is in his current position, telling GQ in a video published Thursday that he believes fighters \"get pa… [+4099 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Bill ConnellyESPN Staff Writer ","title":"The 25 most important players in 2022's College Football Playoff race","description":"We know Will Anderson Jr. and C.J. Stroud will have big seasons in 2022. But which players, stars or not, will have the biggest impact on the College Football Playoff race this year?","url":"http://espn.go.com/college-football/insider/story/_/id/34376097/the-25-most-important-players-2022-college-football-playoff-race","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0810%2Fr1046563_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T11:00:00Z","content":"In 2019, we knew all about Trevor Lawrence but didn't necessarily see Joe Burrow coming. In 2020, Lawrence and Justin Fields were slam dunks, but no one was predicting what we got from Mac Jones and … [+21095 chars]"}]}