{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Mark SchlabachESPN Senior Writer ","title":"Sources -- Tiger Woods to meet with group of players at BMW Championship, rally support for PGA Tour against rival LIV series","description":"A player who was invited to attend Tuesday's meeting told ESPN that it will include many of the top 20 players in the world and a handful of other influential PGA Tour members who haven't defected to LIV Golf.","url":"http://espn.go.com/golf/story/_/id/34406098/sources-tiger-woods-meet-group-players-bmw-championship-rally-support-pga-tour-rival-liv-series","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1217%2Fr952454_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T02:08:00Z","content":"Tiger Woods is scheduled to meet with several of the top golfers in the world on Tuesday in an effort to rally support around the PGA Tour in its ongoing battle with the rival LIV Golf series, source… [+4164 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Chris LowESPN Senior Writer ","title":"Oklahoma coach Brent Venables praises Sooners' resolve in wake of Cale Gundy resignation - They've 'not allowed it to become a distraction'","description":"First-year Oklahoma coach Brent Venables told ESPN he is proud of his team's resolve in the wake of longtime assistant Cale Gundy's sudden resignation and how quickly the players have bought into the new staff's vision following Lincoln Riley's departure.","url":"http://espn.go.com/college-football/story/_/id/34406042/oklahoma-coach-brent-venables-praises-sooners-resolve-wake-cale-gundy-resignation-not-allowed-become-distraction","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1048947_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T01:56:00Z","content":"NORMAN, Okla. -- First-year Oklahoma coach Brent Venables said Monday that he's been proud of his team's resolve and focus following longtime assistant coach Cale Gundy's sudden resignation last week… [+4951 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jesse RogersESPN Staff Writer ","title":"'That's a classic': Cy Young favorites Justin Verlander, Dylan Cease set to clash in Chicago","description":"A rare, late season matchup of American League Cy Young favorites takes place on Tuesday night at Guaranteed Rate Field when Houston Astros ace Justin Verlander takes on White Sox righty Dylan Cease.","url":"http://espn.go.com/mlb/story/_/id/34405864/cy-young-favorites-justin-verlander-dylan-cease-set-clash-chicago","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1048932_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T01:10:00Z","content":"CHICAGO -- A rare, late season matchup of Cy Young favorites takes place on Tuesday night at Guaranteed Rate Field when Houston Astros ace Justin Verlander takes on White Sox righty Dylan Cease.\r\nThe… [+3295 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jenna LaineESPN Staff Writer ","title":"Tampa Bay Buccaneers agree to deal with Carl Nassib, source says","description":"OLB Carl Nassib has agreed to a one-year deal with the Bucs, a source told ESPN's Adam Schefter on Monday.","url":"http://espn.go.com/nfl/story/_/id/34405532/tampa-bay-buccaneers-agree-deal-carl-nassib-source-says","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0622%2Fr871034_1296x729_16%2D9.jpg","publishedAt":"2022-08-15T23:51:00Z","content":"TAMPA, Fla. -- The Tampa Bay Buccaneers agreed to a one-year deal with outside linebacker Carl Nassib on Monday, a source told ESPN's Adam Schefter.\r\nReserve outside linebacker Cam Gill suffered a Li… [+1383 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adrian WojnarowskiSenior NBA Insider ","title":"Sources - Philadelphia 76ers, Ben Simmons reach settlement on grievance over withheld pay","description":"The 76ers and Ben Simmons reached a settlement agreement on the grievance Simmons filed to recoup a portion of the nearly $20 million withheld from him as a result of his failure to play games last season.","url":"http://espn.go.com/nba/story/_/id/34405414/sources-philadelphia-76ers-ben-simmons-reach-settlement-grievance-withheld-pay","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0323%2Fr990453_1296x729_16%2D9.jpg","publishedAt":"2022-08-15T22:56:00Z","content":"Brooklyn Nets All-Star guard Ben Simmons and his former team, the Philadelphia 76ers, reached a settlement agreement on the grievance Simmons filed to recoup a portion of the nearly $20 million withh… [+2789 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Alden GonzalezESPN Staff Writer ","title":"Fernando Tatis Sr. says 'all of baseball' loses with son suspended 80 games for 'something so insignificant'","description":"Fernando Tatis Sr. acknowledged to \"The Midday Show\" that his son made a mistake in not realizing the medication contained a steroid but added that it \"could've been managed\" better by the league, without going into specifics.","url":"http://espn.go.com/mlb/story/_/id/34405332/fernando-tatis-sr-says-all-baseball-loses-son-suspended-80-games-insignificant","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0217%2Fespn_tatis_1296x729.jpg","publishedAt":"2022-08-15T22:43:00Z","content":"Fernando Tatis Jr.'s father backed up his son's claim that he violated Major League Baseball's drug policy because of a steroid that was contained within a ringworm medication and called it \"a catast… [+4260 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Los Angeles Dodgers starter Walker Buehler will have season-ending elbow surgery next week","description":"Los Angeles starter Walker Buehler, who was targeting a mid-September return to the rotation, will have season-ending elbow surgery next week and miss the playoffs, the Dodgers announced on Monday.","url":"http://espn.go.com/mlb/story/_/id/34405165/los-angeles-dodgers-starter-walker-buehler-season-ending-elbow-surgery-next-week","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0815%2Fr1048864_1296x729_16%2D9.jpg","publishedAt":"2022-08-15T22:06:00Z","content":"Los Angeles starter Walker Buehler will have season-ending elbow surgery next week, the Dodgers announced on Monday.\r\nBuehler has had an up-and-down road back from suffering a flexor tendon strain in… [+350 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Alex ScarboroughESPN Staff Writer ","title":"LSU Tigers say QB Myles Brennan will no longer play college football","description":"LSU announced Monday that quarterback Myles Brennan, who has missed most of the last two seasons with injuries, will no longer play college football.","url":"http://espn.go.com/college-football/story/_/id/34403950/lsu-tigers-say-qb-myles-brennan-no-longer-play-college-football","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0922%2Fr749068_2_1296x729_16%2D9.jpg","publishedAt":"2022-08-15T17:49:00Z","content":"Myles Brennan, who started at quarterback for LSU in 2020 and missed most of the last two seasons with injuries, will no longer play college football, the school announced on Monday.\r\nBrennan had bee… [+2002 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Eric KarabellESPN Senior Writer ","title":"Fantasy football 'Do Not Draft' list - Ezekiel Elliott, Saquon Barkley are being drafted too high","description":"Drafts are all about value. Eric Karabell provides his list of NFL players you're better off avoiding based on where they're going to be drafted.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34361536/fantasy-football-do-not-draft-list-ezekiel-elliott-saquon-barkley-being-drafted-too-high","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0807%2Fr1045427_2_1296x729_16%2D9.jpg","publishedAt":"2022-08-07T07:39:03Z","content":"Even though half of the starting running backs from the NFC East still finished among the top 10 volume scorers in fantasy football last season, fantasy managers near and far had plenty to complain a… [+11032 chars]"}]}