{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Associated Press","title":"United States men's soccer team qualifies  for first Olympics since 2008","description":"The United States men routed Honduras in the semifinals of the CONCACAF U-20 Championship to secure the first Olympics berth since 2008.","url":"http://espn.go.com/soccer/united-states-u20/story/4693745/united-states-mens-soccer-team-qualifies-for-first-olympics-since-2008","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0701%2Fr875096_1296x729_16%2D9.jpg","publishedAt":"2022-07-02T03:09:00Z","content":"The United States qualified for its first Olympic men's soccer tournament since 2008 when the Americans beat Honduras 3-0 at San Pedro Sula on Friday night in the semifinals of the Under-20 champions… [+1593 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"David PurdumESPN Staff Writer ","title":"Bettors liking Los Angeles Lakers' title odds despite no big moves from the team","description":"Bettors have been gravitating toward odds for the Lakers to win the NBA title next season despite the team not having made any significant moves to a roster that missed the playoffs last season.","url":"http://espn.go.com/chalk/story/_/id/34181118/bettors-liking-los-angeles-lakers-title-odds-no-big-moves-team","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0619%2Fr710131_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T20:53:26Z","content":"The Phoenix Suns and Miami Heat saw their championship odds improve at sportsbooks, when news broke Thursday that Kevin Durant was requesting a trade from the Brooklyn Nets and reportedly eyeing thos… [+1639 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Tim MacMahonESPN Staff Writer ","title":"Sources - Utah Jazz trading star center Rudy Gobert to Minnesota Timberwolves for four first-round picks","description":"Minnesota is sending its 2023, 2025 and 2027 picks unprotected and a top-5-protected 2029 pick to Utah in exchange for Rudy Gobert, sources told ESPN.","url":"http://espn.go.com/nba/story/_/id/34180894/sources-utah-jazz-trading-star-center-rudy-gobert-minnesota-timberwolves","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1216%2Fr951820_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T19:45:00Z","content":"The Utah Jazz agreed to trade center Rudy Gobert to the Minnesota Timberwolves in a blockbuster deal that will pair him with fellow All-Star big man Karl-Anthony Towns, sources told ESPN's Adrian Woj… [+3802 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Heather DinichESPN Senior Writer ","title":"Pac-12 'to explore all expansion options' after UCLA and USC announce exit to Big Ten in 2024","description":"Pac-12 presidents and chancellors were authorized Friday to \"explore all expansion options\" for the conference after USC and UCLA decided to join the Big Ten in 2024.","url":"http://espn.go.com/college-sports/story/_/id/34180745/pac-12-explore-all-expansion-options-ucla-usc-exit-big-ten","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0520%2Fr545826_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T19:05:00Z","content":"The Pac-12 presidents and chancellors on Friday morning authorized the conference \"to explore all expansion options\" following the decisions of USC and UCLA to join the Big Ten in 2024, according to … [+1719 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Golden State Warriors, Kevon Looney agree to three-year contract, sources say","description":"Free-agent center Kevon Looney, whose rebounding prowess helped the Warriors in their run to the NBA title, has agreed to a three-year, $25.5 million deal to return to Golden State, sources told ESPN.","url":"http://espn.go.com/nba/story/_/id/34180739/golden-state-warriors-kevon-looney-agree-three-year-contract-sources-say","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0126%2Fr966268_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T19:04:00Z","content":"Free-agent center Kevon Looney has agreed to a three-year, $25.5 million deal to return to the Golden State Warriors, sources told ESPN's Adrian Wojnarowski on Friday.\r\nLooney has grown into a stable… [+900 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Boston Celtics acquire Malcolm Brogdon in trade with Indiana Pacers, sources say","description":"The Celtics acquired playmaking point guard Malcom Brogdon in a trade with the Pacers without having to give up a core player, sources told ESPN. The Pacers landed another first-round pick in the deal.","url":"http://espn.go.com/nba/story/_/id/34180437/boston-celtics-acquire-malcolm-brogdon-trade-indiana-pacers-sources-say","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0701%2Fr1031354_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T17:55:00Z","content":"The Indiana Pacers are trading guard Malcolm Brogdon to the Boston Celtics, sources told ESPN's Adrian Wojnarowski on Friday.\r\nThe Celtics are sending Daniel Theis, Aaron Nesmith and a 2023 first-rou… [+646 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adrian WojnarowskiSenior NBA Insider ","title":"Sources -- Atlanta Hawks trade Kevin Huerter to Sacramento Kings for Justin Holiday, Mo Harkless, future first-round pick","description":"The Sacramento Kings have acquired sharpshooter Kevin Huerter from the Atlanta Hawks in return for Justin Holiday, Mo Harkless and a top-14 protected first-round pick in 2024, sources tell ESPN.","url":"http://espn.go.com/nba/story/_/id/34180318/sources-atlanta-hawks-trade-kevin-huerter-sacramento-kings-justin-holiday-mo-harkless-future-first-round-pick","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1018%2Fr924880_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T17:39:00Z","content":"The Sacramento Kings reached a deal to acquire Atlanta Hawks guard Kevin Huerter for a 2024 protected first-round pick and two players on Friday, sources told ESPN.\r\nThe Kings are sending Justin Holi… [+572 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jamison HensleyESPN Staff Writer ","title":"Baltimore Ravens' Jaylon Ferguson died from combined effects of fentanyl, cocaine, officials say","description":"The Maryland Department of Heath said the death of Ravens linebacker Jaylon Ferguson on June 21 was ruled an accident. He was 26.","url":"http://espn.go.com/nfl/story/_/id/34180056/baltimore-ravens-jaylon-ferguson-died-combined-effects-fentanyl-cocaine-officials-say","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0506%2Fr539053_1296x729_16%2D9.jpg","publishedAt":"2022-07-01T16:50:57Z","content":"OWINGS MILLS, Md. -- Baltimore Ravens outside linebacker Jaylon Ferguson died from the combined effects of fentanyl and cocaine, according to medical examiners on Friday.\r\nA spokesman for the Marylan… [+1743 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Kevin Durant and Kyrie Irving trades we want to see - Deals that would completely shake up the NBA","description":"Which teams could land Kevin Durant or Kyrie Irving? We're finding new homes for two Brooklyn superstars.","url":"http://espn.go.com/nba/insider/story/_/id/34174524/kevin-durant-kyrie-irving-trades-want-see-deals-completely-shake-nba","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1015%2Fr923209_1296x729_16%2D9.jpg","publishedAt":"2022-06-30T21:47:00Z","content":"Sometimes, it only takes one tweet to alter the entire landscape of the NBA. This was one of those tweets.\r\nKevin Durant's trade request to the Brooklyn Nets rocked the league just hours before the s… [+7580 chars]"}]}