{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Philadelphia Phillies release Didi Gregorius as Jean Segura returns from 60-day injured list","description":"The Phillies released shortstop Didi Gregorius on Thursday in a series of moves involving players acquired at the trade deadline and the return of infielder Jean Segura.","url":"http://espn.go.com/mlb/story/_/id/34346851/philadelphia-phillies-release-didi-gregorius-jean-segura-returns-injury","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0807%2Fr892367_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T17:45:00Z","content":"The Philadelphia Phillies released shortstop Didi Gregorius on Thursday in a series of moves involving players acquired at the trade deadline and the return of infielder Jean Segura from the 60-day i… [+1077 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Judge - Lawyers for Brian Flores, others can't gather more evidence before decision on whether lawsuit will be sent to arbitration","description":"A judge ruled that lawyers for coaches Brian Flores, Steve Wilks and Ray Horton cannot gather additional evidence to support their arguments that the lawsuit alleging racial discrimination should remain in court rather than be sent to arbitration.","url":"http://espn.go.com/nfl/story/_/id/34346741/lawyers-brian-flores-steve-wilks-ray-horton-gather-more-evidence-decision-arbitration","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0730%2Fr1042137_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T16:56:00Z","content":"NEW YORK -- A judge on Thursday quickened the time it will take to rule whether NFL commissioner Roger Goodell gets to decide the merits of racial discrimination claims made by Black coaches against … [+2715 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"St. Louis Cardinals, Chicago Cubs to play 2-game series in June of 2023 in London","description":"Major League Baseball is planning to return to London next season with the Cubs and Cardinals squaring off in a two-game series in June of 2023, the league announced on Thursday.","url":"http://espn.go.com/mlb/story/_/id/34346738/st-louis-cardinals-chicago-cubs-play-2-game-series-june-2023-london","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0509%2Fr1010663_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T16:50:00Z","content":"NEW YORK -- Major League Baseball plans to return to London next year for the first time since 2019.\r\nThe league announced Thursday that the St. Louis Cardinals and Chicago Cubs will play a two-game … [+1518 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Brooke PryorESPN Staff Writer ","title":"Sources - Pittsburgh Steelers, hold-in WR Diontae Johnson agree to two-year contract extension","description":"The Steelers and wide receiver Diontae Johnson reached agreement on a two-year extension that averages $18.355 million per year, sources told ESPN's Adam Schefter and Kimberley Martin.","url":"http://espn.go.com/nfl/story/_/id/34346714/pittsburgh-steelers-hold-wr-diontae-johnson-agree-two-year-extension","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0607%2Fr1022429_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T16:26:00Z","content":"PITTSBURGH -- Diontae Johnson got his deal.\r\nAfter a week-long hold-in at the Pittsburgh Steelers' training camp, the wide receiver and team reached a two-year extension that averages $18.355 million… [+1759 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"T.J. QuinnESPN Staff Writer ","title":"Brittney Griner sentenced to nine years in Russian prison","description":"Brittney Griner has been found guilty of drug possession and smuggling and was sentenced to nine years in a Russian prison, an expected conclusion to her trial that should allow negotiations for a prisoner swap to accelerate.","url":"http://espn.go.com/wnba/story/_/id/34346379/brittney-griner-found-guilty-drug-possession-smuggling","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0804%2Fr1044336_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T15:20:00Z","content":"A Russian court sentenced WNBA star Brittney Griner to nine years in prison Thursday, an expected conclusion to her trial that should allow negotiations for a prisoner swap to accelerate.\r\nGriner, wh… [+5607 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Kevin PeltonESPN Senior Writer ","title":"NBA offseason grades - Where the Los Angeles Lakers, Golden State Warriors and every West team check in","description":"Which West team has had the best offseason so far? Would you believe it was the franchise that just traded one of its superstars?","url":"http://espn.go.com/nba/insider/story/_/id/34336524/nba-offseason-grades-where-los-angeles-lakers-golden-state-warriors-every-west-team-check-in","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0217%2Fr975392_1296x729_16%2D9.jpg","publishedAt":"2022-08-04T12:00:00Z","content":"Which NBA Western Conference teams have done the best and worst this offseason?\r\nAlthough the futures of Kevin Durant and Donovan Mitchell remain unresolved, the bulk of the NBA's summer activity has… [+12723 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jake TrotterESPN Staff Writer ","title":"NFL appeals ruling that Deshaun Watson of Cleveland Browns should be suspended six games","description":"The league said NFL commissioner Roger Goodell will determine who will hear the appeal. Under the CBA, Goodell has the option to consider the appeal himself or can appoint a designee to do so.","url":"http://espn.go.com/nfl/story/_/id/34342566/nfl-appealing-deshaun-watson-six-game-suspension","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0207%2Fr971359_1296x729_16%2D9.jpg","publishedAt":"2022-08-03T20:06:00Z","content":"BEREA, Ohio -- The NFL on Wednesday appealed the six-game suspension for Cleveland Browns quarterback Deshaun Watson, seeking a tougher penalty for violating the league's personal conduct policy in t… [+8087 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Arizona Cardinals WR Marquise Brown charged with criminal speeding","description":"Arizona Cardinals receiver Marquise Brown was arrested and charged with criminal speeding on Wednesday morning.","url":"http://espn.go.com/nfl/story/_/id/34342237/arizona-cardinals-wr-marquise-brown-charged-criminal-speeding","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0705%2Fr1032861_1296x729_16%2D9.jpg","publishedAt":"2022-08-03T19:34:00Z","content":"GLENDALE, Ariz. -- Arizona Cardinals receiver Marquise Brown was arrested and charged with criminal speeding on Wednesday morning.\r\nArizona Department of Public Safety spokesman Bart Graves confirmed… [+1633 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mechelle VoepelESPN.com ","title":"UConn Huskies women's basketball star Paige Bueckers to miss 2022-23 season after tearing ACL","description":"UConn women's basketball star Paige Bueckers suffered a torn ACL in her left knee during a pickup game on Monday and has been ruled out for the 2022-23 season.","url":"http://espn.go.com/womens-college-basketball/story/_/id/34342277/uconn-huskies-women-basketball-star-paige-bueckers-miss-season-tearing-acl","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0803%2Fr1044058_1296x729_16%2D9.jpg","publishedAt":"2022-08-03T19:34:00Z","content":"UConn women's basketball junior guard Paige Bueckers suffered a torn anterior cruciate ligament in her left knee on Monday and will miss the 2022-23 season, the school announced Wednesday.\r\nBueckers … [+1404 chars]"}]}