{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Hall of Fame QB Len Dawson, who led Kansas City Chiefs to Super Bowl IV win, dies at age 87","description":"Len Dawson, a Pro Football Hall of Famer as both a quarterback and a broadcaster, has died at the age of 87, according to his family.","url":"http://espn.go.com/nfl/story/_/id/34451383/hall-fame-qb-len-dawson-led-kansas-city-chiefs-super-bowl-iv-win-dies-age-87","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0813%2Fr1047796_1296x729_16%2D9.jpg","publishedAt":"2022-08-24T11:42:00Z","content":"Len Dawson, who led the Kansas City Chiefs to victory in Super Bowl IV and was elected to the Pro Football Hall of Fame as both a player and broadcaster, has died at the age of 87, according to his f… [+3086 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Family of Houston Astros' Yordan Alvarez arrives from Cuba to see him play professionally for first time","description":"When Astros slugger Yordan Alvarez stepped up to the plate in the first inning Tuesday night, he had three extra special guests cheering for him.","url":"http://espn.go.com/mlb/story/_/id/34450128/family-houston-astros-yordan-alvarez-arrives-cuba-see-play-professionally-first","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0824%2Fr1052331_1296x729_16%2D9.jpg","publishedAt":"2022-08-24T02:37:00Z","content":"HOUSTON -- When Astros slugger Yordan Alvarez stepped up to the plate in the first inning Tuesday night, he had three extra special guests cheering for him.\r\nFresh after arriving from Cuba, his fathe… [+4081 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Brady Henderson","title":"Pete Carroll says Seattle Seahawks will take 'all the time we need' to decide on starting quarterback","description":"Seattle coach Pete Carroll said his timeline for settling on a starter changed when Drew Lock was sidelined with COVID-19 last week.","url":"http://espn.go.com/nfl/story/_/id/34449647/pete-carroll-says-seattle-seahawks-take-all-need-decide-starting-quarterback","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0617%2Fr1026290_1296x729_16%2D9.jpg","publishedAt":"2022-08-24T00:10:00Z","content":"RENTON, Wash. -- The Seattle Seahawks' quarterback battle between Geno Smith and Drew Lock might not be decided anytime soon.\r\nCoach Pete Carroll said Tuesday that the Seahawks will take \"all the tim… [+4829 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Philadelphia Phillies star Bryce Harper homers in first at-bat of rehabilitation assignment","description":"Phillies slugger Bryce Harper homered to right-center field in his first at-bat for Philadelphia's Triple-A team Tuesday night as part of his rehabilitation assignment from a broken left thumb.","url":"http://espn.go.com/mlb/story/_/id/34449615/philadelphia-phillies-star-bryce-harper-homers-first-bat-rehabilitation-assignment","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0823%2Fr1052283_1296x729_16%2D9.jpg","publishedAt":"2022-08-23T23:48:00Z","content":"ALLENTOWN, Pa. -- Phillies slugger Bryce Harper homered to right-center field in his first at-bat for Philadelphia's Triple-A team Tuesday night as part of his rehabilitation assignment from a broken… [+1126 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"San Diego Padres' Fernando Tatis Jr. apologizes for 80-game suspension, will have shoulder surgery","description":"San Diego's Fernando Tatis Jr. said of his 80-game suspension that \"there is no one else to blame but myself.\" The star shortstop, who will have surgery on his left shoulder during his time away, said he was \"truly sorry\" after testing positive.","url":"http://espn.go.com/mlb/story/_/id/34449357/san-diego-padres-fernando-tatis-jr-apologizes-80-game-suspension-shoulder-surgery","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0815%2Fr1048715_1296x729_16%2D9.jpg","publishedAt":"2022-08-23T22:40:00Z","content":"San Diego Padres shortstop Fernando Tatis Jr., who has been suspended for 80 games after testing positive for the anabolic steroid Clostebol, on Tuesday publicly apologized to his teammates and fans … [+1469 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff CarlisleU.S. soccer correspondent ","title":"San Diego Wave to break NWSL single-game attendance record, Alex Morgan reveals","description":"The San Diego Wave has sold in excess of 27,000 tickets for its Sept. 17 match against Angel City, enough to break the NWSL's attendance record.","url":"http://espn.go.com/soccer/united-states-nwsl/story/4728873/san-diego-wave-to-break-nwsl-single-game-attendance-recordalex-morgan-reveals","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0823%2Fr1052265_1296x729_16%2D9.jpg","publishedAt":"2022-08-23T22:38:35Z","content":"The San Diego Wave has sold in excess of 27,000 tickets for its Sept. 17 match against Angel City FC, enough to break the National Women's Soccer League's all-time attendance record for a standalone … [+3497 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"Los Angeles Dodgers' Walker Buehler has second Tommy John surgery","description":"Dodgers right-hander Walker Buehler will miss the remainder of this season and likely 2023 as well after undergoing full reconstruction of his ulnar collateral ligament on Tuesday.","url":"http://espn.go.com/mlb/story/_/id/34449161/los-angeles-dodgers-walker-buehler-second-tommy-john-surgery","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1013%2Fr922088_1296x729_16%2D9.jpg","publishedAt":"2022-08-23T22:05:00Z","content":"Los Angeles Dodgers star right-hander Walker Buehler underwent Tommy John surgery Tuesday, he said on his Instagram account, officially ending his season and likely keeping him out for 2023 as well.\r… [+1294 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Paul GutierrezESPN Staff Writer ","title":"Focused Derek Carr set to 'just keep trying to play football' for Las Vegas Raiders amid headlines","description":"Las Vegas quarterback Derek Carr seemed indifferent on Tuesday, speaking about last week's claim by UFC president Dana White that he had brokered a deal with for Tom Brady to come to the Raiders in 2020, saying \"it really doesn't matter.\"","url":"http://espn.go.com/nfl/story/_/id/34449092/focused-derek-carr-set-just-keep-trying-play-football-las-vegas-raiders-amid-headlines","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0823%2Fr1052238_1296x729_16%2D9.jpg","publishedAt":"2022-08-23T21:41:00Z","content":"HENDERSON, Nev. -- A chagrined Derek Carr was asked Tuesday if he was immune to stories about his future as Las Vegas Raiders quarterback, in the wake of last weekend's claim by UFC president Dana Wh… [+2318 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adam SchefterESPN Senior Writer ","title":"Adam Schefter's fantasy football cheat sheet - Value picks and sleepers to target","description":"No one is more plugged in to the latest buzz around the NFL than Adam Schefter. So we asked him to share his favorite values in fantasy drafts with you.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34436772/adam-schefter-fantasy-football-cheat-sheet-value-picks-sleepers-target","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0827%2Fr417726_2_1296x729_16%2D9.jpg","publishedAt":"2022-08-23T21:30:00Z","content":"Each year, we try to quench your thirst for fantasy football sleepers and cheat sheets to get you ready for your drafts. For the past several years, we have given you direct access to Adam Schefter's… [+4342 chars]"}]}