{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"Andrew Benintendi, Whit Merrifield among 10 unvaccinated Kansas City Royals players out for Toronto Blue Jays series","description":"Ten Royals players, including four of their top hitters and two of their best starting pitchers this season, will not travel to Toronto for this week's four-game series because they have not received the COVID-19 vaccination.","url":"http://espn.go.com/mlb/story/_/id/34238893/andrew-benintendi-whit-merrifield-10-unvaccinated-kansas-city-royals-players-toronto-blue-jays-series","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1036012_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T21:16:00Z","content":"Ten Kansas City Royals players, including four of their top hitters and two of their best starting pitchers this season, will not travel to Toronto this week for the four-game series with the Blue Ja… [+3675 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Dave WilsonESPN Staff Writer ","title":"Oklahoma State football coach Mike Gundy asks why Texas, Oklahoma allowed in Big 12 business meetings","description":"Oklahoma State football coach Mike Gundy said that if he were the Big 12 commissioner, he wouldn't allow representatives from Texas and Oklahoma, which are leaving to join the SEC, to attend any of the conference's business meetings.","url":"http://espn.go.com/college-football/story/_/id/34238029/oklahoma-state-football-coach-mike-gundy-asks-why-texas-oklahoma-allowed-big-12-business-meetings","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1035929_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T19:14:00Z","content":"Oklahoma State football coach Mike Gundy offered advice -- \"jokingly,\" he said -- to new Big 12 commissioner Brett Yormark on Wednesday: Don't let the Texas Longhorns and Oklahoma Sooners continue to… [+2746 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"John KeimESPN Staff Writer ","title":"Attorney - Washington Commanders owner Dan Snyder won't testify under subpoena","description":"Dan Snyder's attorney said in a letter to the House Committee on Oversight and Reform that the Commanders owner won't agree to the stipulation that he testify under subpoena, and she called any assertion that he hasn't been cooperative false.","url":"http://espn.go.com/nfl/story/_/id/34237247/attorney-washington-commanders-owner-dan-snyder-testify-subpoena","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1035815_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T18:59:00Z","content":"Washington Commanders owner Daniel Snyder's attorney rejected the House Oversight committee's reasoning for wanting him to testify under a subpoena later this month, reiterating that he would do so v… [+3967 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"David PurdumESPN Staff Writer ","title":"Rory McIlroy betting favorite to win The Open, but long shot Tiger Woods is sportsbooks' largest liability","description":"Rory McIlroy is the consensus favorite to win The Open, but bettors in the U.S. and abroad can't resist backing long shot Tiger Woods.","url":"http://espn.go.com/chalk/story/_/id/34237446/rory-mcilroy-betting-favorite-win-open-longshot-tiger-woods-sportsbooks-largest-liability","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0711%2Fr1035241_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T17:57:00Z","content":"Rory McIlroy is the consensus favorite to win The Open and the only golfer with odds in the single digits at the majority of sportsbooks, but bettors in the U.S. and abroad can't resist backing long … [+1543 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Free agent goaltender Darcy Kuemper, fresh off Stanley Cup win, joins Washington Capitals","description":"Free agent goaltender Darcy Kuemper, who backstopped the Colorado Avalanche to a Stanley Cup championship last month, signed a five-year contract with the Washington Capitals on Wednesday.","url":"http://espn.go.com/nhl/story/_/id/34237470/free-agent-goaltender-darcy-kuemper-fresh-stanley-cup-win-joins-washington-capitals","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0616%2Fr1025565_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T17:56:00Z","content":"Goaltender Darcy Kuemper, who won the Stanley Cup with the Colorado Avalanche last month, has signed a five-year free agent contract with the Washington Capitals.\r\nKuemper, 32, agreed to a $26.25 mil… [+2463 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Carolina Hurricanes get All-Star Brent Burns from San Jose Sharks","description":"The Sharks traded All-Star defenseman Brent Burns and AHL forward Lane Pederson to the Hurricanes for forward Steven Lorentz, AHL goalie Eetu Makiniemi and a conditional 2023 third-round pick.","url":"http://espn.go.com/nhl/story/_/id/34237181/carolina-hurricanes-get-all-star-brent-burns-san-jose-sharks","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1106%2Fr623990_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T17:05:00Z","content":"The Carolina Hurricanes acquired star defenseman Brent Burns from the San Jose Sharks in a multiplayer deal Wednesday.\r\nThe Sharks traded Burns and AHL forward Lane Pederson to Carolina for forward S… [+3511 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Toronto Blue Jays fire manager Charlie Montoyo amid recent struggles","description":"The Blue Jays have fired Charlie Montoyo after struggling to meet lofty expectations so far this season and have named bench coach John Schneider as interim manager.","url":"http://espn.go.com/mlb/story/_/id/34237064/toronto-blue-jays-fire-manager-charlie-montoyo-according-reports","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1004%2Fr918193_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T16:22:00Z","content":"TORONTO -- The Blue Jays fired manager Charlie Montoyo on Wednesday and promoted bench coach John Schneider to interim manager for the remainder of the season.\r\nGeneral manager Ross Atkins made the m… [+5450 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marc Raimondi","title":"Former WWE champion Big E feeling 'grateful' in recovery from neck injury despite recent setback","description":"Former WWE champion Big E considers himself \"grateful\" that doctors have said he will make a complete recovery from a broken neck he suffered during a March match despite a recent setback that will keep him out of the ring for at least a full year.","url":"http://espn.go.com/wwe/story/_/id/34236331/big-e-feeling-grateful-recovery-neck-injury-recent-setback","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0820%2Fr898211_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T14:12:00Z","content":"Former WWE champion Big E considers himself \"grateful\" that doctors have said he will make a complete recovery from a broken neck he suffered during a March match despite a recent setback that will k… [+4347 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeremy FowlerESPN Staff Writer ","title":"Ranking the NFL's top 10 wide receivers for 2022 - Execs, coaches, players make their picks for the best wideouts","description":"Who are the top 10 receivers in the NFL? Execs, coaches, scouts and players rank Davante Adams, Ja'Marr Chase and other stars.","url":"http://espn.go.com/nfl/insider/story/_/id/34169017/ranking-nfl-top-10-wide-receivers-2022-execs-coaches-players-make-their-picks-best-wideouts","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0706%2Fr1033343_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T11:00:00Z","content":"We all love \"best-of\" lists, but what if people around the NFL created their own? To preview the 2022 NFL season, we surveyed more than 50 league executives, coaches, scouts and players to help us st… [+20224 chars]"}]}