{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Matthew Tkachuk heads to Florida Panthers, Jonathan Huberdeau to Calgary Flames in blockbuster trade","description":"Matthew Tkachuk is being traded to the Florida Panthers, part of a blockbuster that sends Jonathan Huberdeau to the Calgary Flames in a swap of players who are each coming off the best season of their careers, the teams announced on Friday.","url":"http://espn.go.com/nhl/story/_/id/34282948/matthew-tkachuk-heads-florida-panthers-jonathan-huberdeau-calgary-flames-blockbuster-trade","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0720%2Fr1038689_1296x729_16%2D9.jpg","publishedAt":"2022-07-23T03:38:00Z","content":"SUNRISE, Fla. -- Matthew Tkachuk is being traded to the Florida Panthers, part of a blockbuster that sends Jonathan Huberdeau to the Calgary Flames in a swap of players who are each coming off the be… [+2226 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"'Unreal' - Sydney McLaughlin obliterates own world record in winning first 400m hurdles title at world championships","description":"Sydney McLaughlin shattered her world record by a whopping 0.73 seconds Friday, blazing through the 400-meter hurdles in 50.68 seconds for her first title at world championships.","url":"http://espn.go.com/olympics/trackandfield/story/_/id/34282867/unreal-sydney-mclaughlin-obliterates-own-world-record-winning-first-400m-hurdles-title-world-championships","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0723%2Fr1039473_1296x729_16%2D9.jpg","publishedAt":"2022-07-23T03:12:00Z","content":"EUGENE, Ore. -- Sydney McLaughlin shattered her world record by a whopping 0.73 seconds Friday, blazing through the 400-meter hurdles in 50.68 seconds for her first career gold medal at world champio… [+2039 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Toronto's Raimel Tapia hits inside-the-park grand slam as Blue Jays set franchise mark for runs scored in 28-5 rout of Boston Red Sox","description":"Toronto's Raimel Tapia hit an inside-the-park grand slam and the Blue Jays set a franchise record for runs in a game, rolling past the Boston Red Sox 28-5 on Friday night.","url":"http://espn.go.com/mlb/story/_/id/34282545/toronto-raimel-tapia-hits-park-grand-slam-blue-jays-set-franchise-mark-runs-scored-28-5-rout-boston-red-sox","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0723%2Fr1039458_1296x729_16%2D9.jpg","publishedAt":"2022-07-23T02:03:00Z","content":"BOSTON -- Raimel Tapia hit an inside-the-park grand slam after a misplay by Boston center fielder Jarren Duran and the Toronto Blue Jays set a franchise record for runs in a game, rolling past the Re… [+2307 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Josh WeinfussESPN Staff Writer ","title":"Arizona Cardinals' Kyler Murray on new deal -- 'No other place I wanted to be'","description":"Arizona Cardinals quarterback Kyler Murray addressed the questions that arose amid his offseason contract negotiations, saying, \"There's no other place I wanted to be the whole time.\"","url":"http://espn.go.com/nfl/story/_/id/34282508/arizona-cardinals-kyler-murray-new-deal-no-other-place-wanted-be","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0723%2Fr1039453_1296x729_16%2D9.jpg","publishedAt":"2022-07-23T01:38:51Z","content":"TEMPE, Ariz. -- After an offseason that bordered on the tumultuous as he waited for his extension to be done, Arizona Cardinals quarterback Kyler Murray said Friday, a day after agreeing to a mega de… [+2645 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Former Atlanta Braves, Chicago Cubs outfielder Dwight Smith dies at 58","description":"Dwight Smith, who had an eight-year Major League career including as a member of Atlanta's World Series-winning team in 1995, died Friday at age 58.","url":"http://espn.go.com/mlb/story/_/id/34282463/former-atlanta-braves-chicago-cubs-outfielder-dwight-smith-dies-58","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0722%2Fr1039402_1296x729_16%2D9.jpg","publishedAt":"2022-07-23T01:24:00Z","content":"ATLANTA -- Dwight Smith, a runner-up for NL rookie of the year who played on Atlanta's World Series-winning team in 1995, died Friday, the Braves announced. He was 58.\r\nThe Braves said the former out… [+1701 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Dan MurphyESPN Staff Writer ","title":"Penn State QB Sean Clifford, Big Ten commissioner Kevin Warren discuss improving benefits","description":"Big Ten players and an independent players' association are talking to Big Ten officials about improved benefits and a bigger voice in college football's future.","url":"http://espn.go.com/college-football/story/_/id/34262479/penn-state-qb-sean-clifford-big-ten-commissioner-kevin-warren-discuss-improving-benefits","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0716%2Fr1036805_1296x729_16%2D9.jpg","publishedAt":"2022-07-22T21:02:00Z","content":"Big Ten football players have had conversations with league commissioner Kevin Warren this week about giving athletes a bigger voice in the future and about improving a variety of benefits for player… [+6110 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marc Raimondi","title":"Vince McMahon retiring as WWE chairman and CEO, signaling massive shift in pro wrestling","description":"Vince McMahon is retiring as WWE chairman and CEO, he announced Friday. The 76-year-old McMahon also said that his daughter Stephanie and current WWE president Nick Khan will be taking over as co-CEOs.","url":"http://espn.go.com/wwe/story/_/id/34281650/vince-mcmahon-retiring-wwe-chairman-ceo-signaling-massive-shift-professional-wrestling","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0905%2Fr426573_1296x729_16%2D9.jpg","publishedAt":"2022-07-22T20:57:00Z","content":"The most important person in the history of professional wrestling is handing over the reins.\r\nVince McMahon is retiring as WWE chairman and CEO, he announced Friday. In a WWE press release, the 76-y… [+3737 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mark Schlabach","title":"NCAA -- 18 violations, almost $60K in illegal benefits by Tennessee football under former coach Jeremy Pruitt","description":"The NCAA says the Tennessee Volunteers football program committed 18 violations under former head coach Jeremy Pruitt, including nearly $60,000 in illegal benefits for players and recruits.","url":"http://espn.go.com/college-football/story/_/id/34281182/ncaa-alleges-18-violations-almost-60k-illegal-benefits-tennessee-football-former-coach-jeremy-pruitt","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0118%2Fr803502_1296x729_16%2D9.jpg","publishedAt":"2022-07-22T19:49:00Z","content":"The NCAA has charged Tennessee's football program with 18 Level I alleged rules violations, the most severe under its rules, for impermissible recruiting benefits totaling about $60,000 that were pai… [+4606 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Football Outsiders","title":"The best position group for all 32 NFL teams - Strongest units and top depth charts for 2022","description":"Football Outsiders finds the spot on every depth chart where teams don't have to worry heading into the season.","url":"http://espn.go.com/nfl/insider/story/_/id/34266941/the-best-position-group-all-32-nfl-teams-strongest-units-top-depth-charts-2022","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0722%2Fr1039096_1296x729_16%2D9.jpg","publishedAt":"2022-07-22T10:55:00Z","content":"Some NFL teams have few holes on their rosters. Other teams have positions where they are stuck making do with veterans and late-round youngsters. But no team is weak at every position on the depth c… [+26538 chars]"}]}