{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Jeff BorzelloESPN Staff Writer ","title":"Davidson men's basketball coach Bob McKillop announces retirement after 33 seasons","description":"Davidson coach Bob McKillop is retiring after 33 seasons at the North Carolina school. He will be replaced by his son Matt, who has been an assistant with the team since 2008.","url":"http://espn.go.com/mens-college-basketball/story/_/id/34108939/davidson-men-basketball-coach-bob-mckillop-announces-retirement-33-seasons","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0617%2Fr1026302_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T18:54:18Z","content":"Bob McKillop is retiring after 33 seasons as Davidson's head coach, he announced on Friday.\r\nMcKillop's son, Matt, who played at Davidson and has been an assistant coach under his father for the last… [+2819 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Texas Longhorns slugger Ivan Melendez wins Dick Howser Trophy as college baseball's top player","description":"Texas' Ivan Melendez, who leads the nation with 32 home runs and 94 RBI, won the Dick Howser Trophy on Friday as the outstanding player in college baseball.","url":"http://espn.go.com/college-sports/story/_/id/34108735/texas-longhorns-slugger-ivan-melendez-wins-dick-howser-trophy-college-baseball-top-player","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0616%2Fr1025661_608x342_16%2D9.jpg","publishedAt":"2022-06-17T18:31:00Z","content":"OMAHA, Neb. -- National home run leader Ivan Melendez of Texas won the Dick Howser Trophy on Friday as the outstanding player in college baseball.\r\nMelendez's 32 home runs are most in Division I sinc… [+690 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Davidson to retire Stephen Curry's No. 30 in August ceremony following Golden State Warriors star's graduation","description":"Stephen Curry's No. 30 will be the first number retired by Davidson, which will celebrate arguably the school's best player ever during an Aug. 31 ceremony.","url":"http://espn.go.com/nba/story/_/id/34108762/davidson-retire-stephen-curry-no-30-august-ceremony-following-golden-state-warriors-star-graduation","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0617%2Fr1026142_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T18:30:51Z","content":"One day after Stephen Curry added a fourth NBA title and first Finals MVP award to his illustrious résumé, his alma mater, Davidson, announced that the Golden State Warriors star would have his numbe… [+1203 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mark SchlabachESPN Senior Writer ","title":"Phil Mickelson cards 3-over-73 Friday, but misses U.S. Open cut at 11-over","description":"After struggling during first-round play on Thursday, Phil Mickelson played better Friday carding a 3-over-73 but it wasn't enough to make the cut at The Country Club in Brookline.","url":"http://espn.go.com/golf/story/_/id/34108652/phil-mickelson-cards-3-73-friday-misses-us-open-cut-11-over","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0617%2Fr1026293_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T18:13:00Z","content":"BROOKLINE, Mass. - The good news for Phil Mickelson, after he limped off the ninth green at The Country Club outside Boston on Friday, is that he won't have to worry about making the cut in his next … [+2583 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Source -- Former Tennessee Gov. Bill Haslam to gradually buy Predators","description":"Former Tennessee Governor Bill Haslam is joining the ownership group of the Nashville Predators with the intention of becoming the franchise's lead owner, sources confirmed to ESPN on Friday.","url":"http://espn.go.com/nhl/story/_/id/34108187/source-former-tennessee-gov-bill-haslam-gradually-buy-predators","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0516%2Fr1013681_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T17:19:00Z","content":"Former Tennessee governor Bill Haslam will become the new owner of the NHL's Nashville Predators \"over a period of years,\" an NHL source tells ESPN.\r\nSporitco reported on Thursday that Haslam, whose … [+1611 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Former NASCAR driver Clint Bowyer struck and killed pedestrian in highway accident","description":"Former NASCAR driver Clint Bowyer struck and killed a pedestrian on a highway in Missouri earlier this month, police said. Bowyer showed no signs of impairment at the time of the accident.","url":"http://espn.go.com/racing/nascar/story/_/id/34107994/former-nascar-driver-clint-bowyer-struck-killed-pedestrian-highway-accident","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0609%2Fr554385_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T16:24:02Z","content":"LAKE OZARK, Mo. -- Former NASCAR driver and Fox Sports analyst Clint Bowyer struck and killed a pedestrian on a highway in southwest Missouri earlier this month, police said.\r\nThe crash occurred June… [+825 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"John KeimESPN Staff Writer ","title":"NFL fines Ron Rivera $100K, docks Washington Commanders two 2023 OTA practices","description":"The NFL has fined Washington Commanders coach Ron Rivera $100,000 and docked the team two 2023 OTA practices due to excessive contact in practice drills.","url":"http://espn.go.com/nfl/story/_/id/34107579/nfl-fines-ron-rivera-100k-docks-washington-commanders-two-2023-ota-practices","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0617%2Fr1026221_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T15:10:00Z","content":"ASHBURN, Va. -- The NFL fined Washington Commanders coach Ron Rivera $100,000 and stripped the team of two OTA practices in 2023 for conducting excessive contact in spring drills, according to ESPN's… [+2814 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Vince McMahon steps aside as WWE chairman, CEO amid investigation into alleged hush money payment","description":"Vince McMahon is stepping aside from his role as CEO and chairman of World Wrestling Entertainment during an investigation into alleged hush money he agreed to pay to a former employee over an alleged affair.","url":"http://espn.go.com/wwe/story/_/id/34106615/vince-mcmahon-steps-aside-wwe-chairman-ceo-amid-investigation-alleged-hush-money-payment","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0125%2Fr318908_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T11:56:06Z","content":"Vince McMahon is stepping aside from his role as CEO and chairman of World Wrestling Entertainment during an investigation into a report that he agreed to pay hush money to a former employee over an … [+2149 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Kiley McDanielESPN MLB Insider ","title":"Top MLB draft prospects to watch in 2022 College World Series","description":"Which future major league stars are playing in Omaha? We break down the best from each roster.","url":"http://espn.go.com/mlb/insider/story/_/id/34096230/top-mlb-draft-prospects-watch-2022-college-world-series","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0614%2Fr1025115_1296x729_16%2D9.jpg","publishedAt":"2022-06-17T11:00:00Z","content":"At this time last year, I previewed the top prospects in the Men's College World Series and it was headlined by two incredibly famous soon-to-be-early-picks in Vanderbilt righties Jack Leiter and Kum… [+7157 chars]"}]}