{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Forward Johnny Gaudreau joins Columbus Blue Jackets with seven-year deal, sources say","description":"Free-agent forward Johnny Gaudreau, the premier name in this year's NHL free-agent market and former Calgary Flames winger, has agreed to join the Columbus Blue Jackets, sources confirmed to ESPN Wednesday night.","url":"http://espn.go.com/nhl/story/_/id/34239560/forward-johnny-gaudreau-joins-columbus-blue-jackets-seven-year-deal-sources-say","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0629%2Fr1030208_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T23:23:00Z","content":"Free-agent forward Johnny Gaudreau, the premier name in this year's NHL free-agent market, has agreed to join the Columbus Blue Jackets, sources confirmed to ESPN Wednesday night.\r\nAccording to multi… [+2599 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Gonzaga, Michigan State to play on USS Abraham Lincoln on Nov. 11","description":"Gonzaga and Michigan State will play on the flight deck of the USS Abraham Lincoln on Nov. 11 in the first aircraft carrier game in men's college basketball since 2012.","url":"http://espn.go.com/mens-college-basketball/story/_/id/34239444/gonzaga-michigan-state-play-uss-abraham-lincoln-nov-11","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2016%2F1005%2Fr136631_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T23:23:00Z","content":"SAN DIEGO -- They're going to try to play college basketball on an aircraft carrier again, and nautical veteran Tom Izzo and Michigan State will get a return trip to San Diego Bay to face Gonzaga on … [+4519 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Vegas Golden Knights create salary-cap space, ship star Max Pacioretty to Carolina Hurricanes, sources say","description":"The Vegas Golden Knights, looking to create some salary-cap room as free agency began around the NHL, traded star winger Max Paciorietty to the Carolina Hurricanes on Wednesday for future considerations.","url":"http://espn.go.com/nhl/story/_/id/34239188/vegas-golden-knights-create-salary-cap-space-ship-star-max-paciorietty-carolina-hurricanes","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1036037_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T22:17:00Z","content":"The Vegas Golden Knights traded star winger Max Paciorietty to the Carolina Hurricanes on Wednesday in a salary clearing move.\r\nPaciorietty and defenseman Dylan Coghlan were moved to the Hurricanes f… [+1167 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"Andrew Benintendi, Whit Merrifield among 10 unvaccinated Kansas City Royals players out for Toronto Blue Jays series","description":"Ten Royals players, including four of their top hitters and their best two starting pitchers this season, will not travel to Toronto for this week's four-game series because they have not received the COVID-19 vaccination.","url":"http://espn.go.com/mlb/story/_/id/34238893/andrew-benintendi-whit-merrifield-10-unvaccinated-kansas-city-royals-players-toronto-blue-jays-series","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1036012_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T21:16:00Z","content":"Ten Kansas City Royals players, including four of their top hitters and their best two starting pitchers this season, will not travel to Toronto for this week's four-game series with the Blue Jays be… [+1400 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"David Wilson","title":"Oklahoma State football coach Mike Gundy asks why Texas, Oklahoma allowed in Big 12 business meetings","description":"Oklahoma State football coach Mike Gundy said that if he was the Big 12 commissioner, he wouldn't allow representatives from Texas and Oklahoma, who are leaving to join the SEC, to attend any of the conference's business meetings.","url":"http://espn.go.com/college-football/story/_/id/34238029/oklahoma-state-football-coach-mike-gundy-asks-why-texas-oklahoma-allowed-big-12-business-meetings","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1035929_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T19:14:16Z","content":"Oklahoma State football coach Mike Gundy \"jokingly\" offered advice for new Big 12 commissioner Brett Yormark on Wednesday: Don't let the Texas Longhorns and Oklahoma Sooners continue to participate i… [+2721 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"John KeimESPN Staff Writer ","title":"Attorney - Washington Commanders owner Dan Snyder won't testify under subpoena","description":"Dan Snyder's attorney said in a letter to the House Committee on Oversight and Reform that the Commanders owner won't agree to the stipulation that he testify under subpoena and called any assertion that he hasn't been cooperative false.","url":"http://espn.go.com/nfl/story/_/id/34237247/attorney-washington-commanders-owner-dan-snyder-testify-subpoena","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1035815_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T18:59:39Z","content":"Washington Commanders owner Daniel Snyder's attorney rejected the House Oversight Committee's reasoning for wanting him to testify under a subpoena later this month, reiterating that he would do so v… [+3731 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Toronto Blue Jays fire manager Charlie Montoyo, according to reports","description":"The Blue Jays have fired manager Charlie Montoyo, according to multiple reports, after struggling to meet lofty expectations so far this season.","url":"http://espn.go.com/mlb/story/_/id/34237064/toronto-blue-jays-fire-manager-charlie-montoyo-according-reports","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1004%2Fr918193_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T16:22:00Z","content":"The struggling Toronto Blue Jays have fired manager Charlie Montoyo, according to multiple reports.\r\nDespite lofty expectations this season, the Blue Jays entered Wednesday with a 46-42 record and in… [+218 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marc Raimondi","title":"Big E feeling 'grateful' in recovery from neck injury despite recent setback","description":"Former WWE champion Big E considers himself \"grateful\" that doctors have said he will make a complete recovery from a broken neck he suffered during a March match despite a recent setback that will keep him out of the ring for at least a full year.","url":"http://espn.go.com/wwe/story/_/id/34236331/big-e-feeling-grateful-recovery-neck-injury-recent-setback","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0820%2Fr898211_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T14:12:29Z","content":"Former WWE champion Big E considers himself \"grateful\" that doctors have said he will make a complete recovery from a broken neck he suffered during a March match despite a recent setback that will k… [+4322 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeremy FowlerESPN Staff Writer ","title":"Ranking the NFL's top 10 wide receivers for 2022 - Execs, coaches, players make their picks for the best wideouts","description":"Who are the top 10 receivers in the NFL? Execs, coaches, scouts and players rank Davante Adams, Ja'Marr Chase and other stars.","url":"http://espn.go.com/nfl/insider/story/_/id/34169017/ranking-nfl-top-10-wide-receivers-2022-execs-coaches-players-make-their-picks-best-wideouts","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0706%2Fr1033343_1296x729_16%2D9.jpg","publishedAt":"2022-07-13T11:00:00Z","content":"We all love \"best-of\" lists, but what if people around the NFL created their own? To preview the 2022 NFL season, we surveyed more than 50 league executives, coaches, scouts and players to help us st… [+20262 chars]"}]}