{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Mark SchlabachESPN Senior Writer ","title":"Brooks Koepka says time for physical recovery, changed opinion led to LIV Golf move","description":"Brooks Koepka said ahead of his first LIV Golf tournament that he didn't agree to join the series until after he played in the U.S. Open, and that a simple change of opinion, coupled with more time to physically recover, led to the move.","url":"http://espn.go.com/golf/story/_/id/34163399/brooks-koepka-says-physical-recovery-changed-opinion-led-liv-golf-move","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0127%2Fr966636_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T23:10:34Z","content":"NORTH PLAINS, Ore. -- Four-time major champion Brooks Koepka said Tuesday that he didn't agree to join the LIV Golf Invitational Series until after playing in the U.S. Open two weeks ago.\r\nKoepka, sp… [+4220 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Los Angeles Angels RHP Archie Bradley out at least 4 weeks after fracturing elbow during brawl with Seattle Mariners","description":"Angels right-hander Archie Bradley will be sidelined for at least a month after suffering a fractured right elbow while going over the dugout railing to join Sunday's on-field brawl with the Mariners.","url":"http://espn.go.com/mlb/story/_/id/34163397/los-angeles-angels-rhp-archie-bradley-least-4-weeks-fracturing-elbow-brawl-seattle-mariners","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0628%2Fr1030180_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T23:09:33Z","content":"Los Angeles Angels right-hander Archie Bradley will be sidelined for at least a month after suffering a fractured right elbow while going over the dugout railing to join Sunday's on-field brawl with … [+758 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Sarah BarshopESPN Staff Writer ","title":"Deshaun Watson's NFL hearing to resume through at least Wednesday, source says","description":"Cleveland Brown quarterback Deshaun Watson's hearing before the NFL and NFL Players Association's jointly appointed disciplinary officer is scheduled to resume Wednesday and may continue even longer than that, a source told ESPN.","url":"http://espn.go.com/nfl/story/_/id/34163367/deshaun-watson-nfl-hearing-resume-least-wednesday","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0614%2Fr1025043_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T23:04:00Z","content":"Deshaun Watson's hearing before the NFL and NFL Players Association's jointly appointed disciplinary officer, Sue L. Robinson, has concluded for the day, ESPN's Dan Graziano reported Tuesday.\r\nThe he… [+1057 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Michael RothsteinESPN Staff Writer ","title":"WBA, WBO junior welterweight champion Kali Reis secures role in Season 4 of HBO's 'True Detective'","description":"Kali Reis, the WBA and WBO junior welterweight champion, is once again heading to Hollywood, cast as one of the leads in Season 4 of True Detective on HBO opposite two-time Best Actress Oscar-winner Jodie Foster.","url":"http://espn.go.com/boxing/story/_/id/34163302/wba-wbo-junior-welterweight-champion-kali-reis-secures-role-season-4-hbo-true-detective","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0628%2Fr1030167_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T22:29:00Z","content":"Kali Reis, the WBA and WBO junior welterweight champion, is once again heading to Hollywood, cast as one of the leads in Season 4 of \"True Detective\" on HBO opposite two-time Best Actress Oscar-winne… [+1463 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Tim MacMahonESPN Staff Writer ","title":"New York Knicks viewed as strong favorites to sign Dallas Mavericks guard Jalen Brunson in free agency, sources say","description":"The Knicks are considered strong favorites to sign guard Jalen Brunson, who is coming off a breakout season with the Mavericks, when free agency opens Thursday, sources told ESPN.","url":"http://espn.go.com/nba/story/_/id/34163217/new-york-knicks-viewed-strong-favorites-sign-dallas-mavericks-guard-jalen-brunson-free-agency-sources-say","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0628%2Fr1030165_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T22:14:00Z","content":"The New York Knicks are considered strong favorites to sign Dallas Mavericks guard Jalen Brunson in free agency, sources told ESPN.\r\nIt's widely anticipated that Brunson will agree to a four-year dea… [+3435 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Serena Williams loses first-round match at Wimbledon to Harmony Tan","description":"Serena Williams, in her first singles match since being injured in the first round of last year's Wimbledon, rallied multiple times in her first-round match on Centre Court but was unable to beat Harmony Tan, losing the decisive third-set tiebreaker 10-7.","url":"http://espn.go.com/tennis/story/_/id/34163043/serena-williams-loses-first-round-match-wimbledon-harmony-tan","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0628%2Fr1030105_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T21:37:00Z","content":"WIMBLEDON, England -- Serena Williams has lost her first singles match in nearly a year, getting beat by 115th-ranked Harmony Tan of France in a third-set tiebreaker at Wimbledon.\r\nWilliams was two p… [+687 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Tim MacMahonESPN Staff Writer ","title":"Sources - Utah Jazz finalizing deal to make Boston Celtics assistant Will Hardy new head coach","description":"The Jazz are finalizing a deal with Celtics assistant Will Hardy to name him the franchise's new head coach, sources told ESPN's Adrian Wojnarowski. Hardy, 34, will become the NBA's youngest active head coach.","url":"http://espn.go.com/nba/story/_/id/34162560/sources-utah-jazz-finalizing-deal-make-boston-celtics-assistant-hardy-new-head-coach","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0628%2Fr1030102_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T19:25:09Z","content":"The Utah Jazz are finalizing a five-year contract with Boston Celtics assistant Will Hardy to make him the franchise's next head coach, sources told ESPN's Adrian Wojnarowski.\r\nHardy, 34, will be the… [+1090 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Buster OlneyESPN Senior Writer ","title":"Sources - Los Angeles Dodgers' Freddie Freeman fires agents who led offseason contract talks","description":"Dodgers first baseman Freddie Freeman has fired the agents who led offseason contract negotiations between the former MVP and the Braves, and landed him in Los Angeles, sources told ESPN's Buster Olney.","url":"http://espn.go.com/mlb/story/_/id/34162315/sources-los-angeles-dodgers-freddie-freeman-fires-agents-led-offseason-contract-talks","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0628%2Fr1030071_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T18:23:00Z","content":"When Freddie Freeman left the Atlanta Braves and eventually landed with the Los Angeles Dodgers, there was shock within the industry because of Freeman's long history with the Braves.\r\nNow Freeman ha… [+3096 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Bobby Marks","title":"Ultimate 2022 NBA free agency guide - Needs, priorities and spending options for all 30 teams","description":"With free agency just days away, here's how things line up for every NBA team heading into the offseason.","url":"http://espn.go.com/nba/insider/story/_/id/34156470/ultimate-2022-nba-free-agency-guide-needs-priorities-spending-options-all-30-teams","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0512%2Fr852792_1296x729_16%2D9.jpg","publishedAt":"2022-06-28T12:00:00Z","content":"The 2022 NBA Finals and the 2022 NBA draft are behind us, which means it's time to turn our full attention to the 2022 NBA offseason. Free agents can begin negotiating with teams starting Thursday at… [+73063 chars]"}]}