{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Adam RittenbergESPN Senior Writer ","title":"Quinn Ewers named starting quarterback for Texas Longhorns","description":"Quinn Ewers, who transferred to Texas from Ohio State after having not attempted a pass last season, beat out Hudson Card to be the starting quarterback for the Longhorns in 2022.","url":"http://espn.go.com/college-football/story/_/id/34425570/quinn-ewers-named-starting-quarterback-texas-longhorns","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0502%2Fr1007563_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T18:03:00Z","content":"The Texas Longhorns have named Quinn Ewers, the heralded recruit who began his college career early at Ohio State to capitalize on name, image and likeness opportunities before transferring back to h… [+1466 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jake TrotterESPN Staff Writer ","title":"Jacoby Brissett looks to 'prove every day' he's right QB to replace Deshaun Watson for Cleveland Browns","description":"The Browns have been steadfast in their support of Jacoby Brissett as the team's starting quarterback while Deshaun Watson is suspended, and the veteran back up says he doesn't take his position lightly.","url":"http://espn.go.com/nfl/story/_/id/34425365/jacoby-brissett-looks-prove-every-day-right-qb-replace-deshaun-watson-cleveland-browns","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050345_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T17:18:00Z","content":"BEREA, Ohio -- After losing quarterback Deshaun Watson to an 11-game suspension, the Cleveland Browns continue insist that they are \"comfortable\" and \"confident\" in Jacoby Brissett as their starter w… [+2207 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"John KeimESPN Staff Writer ","title":"Ex-Washington Commanders trainer Ryan Vermillion's illegal drug distribution charges could be dropped as part of agreement","description":"Ryan Vermillion, the former Commanders trainer who was under DEA investigation, could have charges that illegally distributed prescription drugs dismissed after agreeing to deferred prosecution Friday.","url":"http://espn.go.com/nfl/story/_/id/34425255/ex-washington-commanders-trainer-ryan-vermillion-illegal-drug-distribution-charges-dropped-part-agreement","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050337_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T16:46:51Z","content":"ALEXANDRIA, Va. -- Former Washington Commanders head athletic trainer Ryan Vermillion, who has been under investigation by the Drug Enforcement Agency for illegally distributing oxycodone to NFL play… [+7211 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"D'Arcy Maine","title":"Top-ranked Iga Swiatek questions why US Open still uses different tennis balls for men and women","description":"Reigning world No. 1 Iga Swiatek says the balls used at the US Open are \"horrible\" and wonders why the final major of the season is the only Grand Slam that still uses different balls for the men and women.","url":"http://espn.go.com/tennis/story/_/id/34425055/top-ranked-iga-swiatek-questions-why-us-open-uses-different-tennis-balls-men-women","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0819%2Fr1050334_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T16:13:36Z","content":"Reigning world No. 1 and two-time major champion Iga Swiatek called the balls used at the US Open \"horrible\" during a news conference at the Western &amp; Southern Open this week, and questioned why … [+3561 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marc Raimondi","title":"Kamaru Usman, challenger Leon Edwards make weight for UFC 278 welterweight title fight","description":"Kamaru Usman and challenger Leon Edwards successfully made weight Friday morning -- both at exactly 170 pounds -- for their welterweight title fight in the main event of UFC 278 on Saturday at Vivint Arena.","url":"http://espn.go.com/mma/story/_/id/34424827/kamaru-usman-challenger-leon-edwards-make-weight-ufc-278-welterweight-title-fight","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0807%2Fr1045756_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T15:45:41Z","content":"SALT LAKE CITY -- The best pound-for-pound fighter in the world will be back in the Octagon this weekend.\r\nKamaru Usman and challenger Leon Edwards successfully made weight Friday morning -- both at … [+1626 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Atlanta Braves' Marcell Ozuna arrested on DUI charge","description":"Braves outfielder Marcell Ozuna, who missed most of the 2021 season after his arrest for domestic violence, was charged with DUI on Friday, according to jail records.","url":"http://espn.go.com/mlb/story/_/id/34424554/atlanta-braves-marcell-ozuna-arrested-dui-charge","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F1113%2Fr775363_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T14:41:20Z","content":"Atlanta Braves outfielder Marcell Ozuna was arrested early Friday morning on a DUI charge, according to Gwinnett County Jail records.\r\nOzuna, 31, was arrested by Norcross Police and booked into the G… [+1178 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adam RittenbergESPN Senior Writer ","title":"Nebraska Cornhuskers name Casey Thompson starting QB against Northwestern Wildcats","description":"Nebraska has named Casey Thompson, a transfer from Texas, as its starting quarterback for next week's season opener against Northwestern in Dublin, Ireland.","url":"http://espn.go.com/college-football/story/_/id/34424064/nebraska-cornhuskers-name-casey-thompson-starting-qb-northwestern-wildcats","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0301%2Fr980484_1296x729_16%2D9.jpg","publishedAt":"2022-08-19T13:17:33Z","content":"Nebraska has named Casey Thompson, a transfer from Texas, as its starting quarterback for next week's season opener against Northwestern in Dublin, Ireland.\r\nCoach Scott Frost, speaking Thursday nigh… [+1780 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jenna LaineESPN Staff Writer ","title":"Tampa Bay Buccaneers coach Todd Bowles noncommittal on Tom Brady's return","description":"Buccaneers coach Todd Bowles was noncommittal Thursday when asked by reporters about a return date for quarterback Tom Brady, who has been away from the team since Aug. 11 to tend to what has been described as \"personal things.\"","url":"http://espn.go.com/nfl/story/_/id/34419740/tampa-bay-buccaneers-coach-todd-bowles-noncommittal-tom-brady-return","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0730%2Fr1042396_1296x729_16%2D9.jpg","publishedAt":"2022-08-18T18:47:00Z","content":"Tampa Bay Buccaneers coach Todd Bowles was noncommittal Thursday when asked by reporters about a return date for quarterback Tom Brady, who has been away from the team since Aug. 11 to tend to what h… [+1703 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Eric KarabellESPN Senior Writer ","title":"Fantasy football rankings - Eric Karabell's quarterback tiers","description":"Rankings are important when drafting; it's even more important to know where value drops off at each position. Eric Karabell breaks the QBs into tiers.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34409048/fantasy-football-rankings-eric-karabell-quarterback-tiers","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1216%2Fr951911_1296x729_16%2D9.jpg","publishedAt":"2022-08-18T11:00:00Z","content":"Fantasy football drafts are all about value, supply and demand and, to some degree, just plain going with your gut. Anyone can see the raw stats from last season, project ahead and make those numbers… [+5809 chars]"}]}