{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Newest Florida Panther Matthew Tkachuk: 'I hate Edmonton, but I hate Tampa more now'","description":"Matthew Tkachuk, who was traded by the Calgary Flames to the Florida Panthers in a blockbuster deal last Friday night, says \"I hate Edmonton, but I hate Tampa more now.\"","url":"http://espn.go.com/nhl/story/_/id/34293619/hate-edmonton-hate-tampa-more-now","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0116%2Fr652996_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T17:20:00Z","content":"Matthew Tkachuk says he's ready for the Battle of Florida after waging the Battle of Alberta for the first six years of his NHL career.\r\n\"I hate Edmonton, but I hate Tampa more now,\" said Tkachuk, wh… [+3412 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Michael CollinsESPN Senior Writer ","title":"LIV golfer Sergio Garcia changes mind, not resigning DP World Tour membership","description":"LIV golfer Sergio Garcia says he's had a change of heart and does not plan to resign his DP World Tour membership, keeping open the possibility of playing on the European Ryder Cup team.","url":"http://espn.go.com/golf/story/_/id/34293614/liv-golfer-sergio-garcia-changes-mind-not-resigning-dp-world-tour-membership","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0725%2Fr1040368_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T17:16:59Z","content":"LIV Golf series player Sergio Garcia says he has changed his mind on giving up his DP World Tour membership.\r\n\"When I finished the Open Championship (last) Sunday, I said that I was most likely going… [+1736 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marcel Louis-Jacques","title":"Miami Dolphins RB Raheem Mostert says he's cleared from knee injury","description":"Dolphins running back Raheem Mostert announced Monday he has been cleared for training camp activities after rehabbing a knee injury that ended his 2021 season after Week 1.","url":"http://espn.go.com/nfl/story/_/id/34293472/miami-dolphins-rb-raheem-mostert-says-cleared-knee-injury","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0921%2Fr749172_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T16:25:00Z","content":"MIAMI -- Dolphins running back Raheem Mostert announced Monday he has been cleared for training camp activities after rehabbing a knee injury since early last season.\r\nMostert made the announcement o… [+3884 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Chase Elliott won't celebrate Pocono win after Denny Hamlin disqualified for failing postrace inspection","description":"Chase Elliott said he won't celebrate the victory awarded to him after Pocono winner Denny Hamlin was disqualified when his Toyota failed a postrace inspection.","url":"http://espn.go.com/racing/nascar/cup/story/_/id/34293338/chase-elliott-celebrate-pocono-win-denny-hamlin-disqualified-failing-postrace-inspection","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0725%2Fr1040341_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T15:59:00Z","content":"Chase Elliott left Pocono Raceway as a third-place finisher and learned when he landed home in Georgia that he had been declared the race winner.\r\nFor now, at least.\r\nJoe Gibbs Racing can still appea… [+5128 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mike Coppinger","title":"Paul 'Triple H' Levesque replaces Vince McMahon as WWE's head of creative direction","description":"Paul \"Triple H\" Levesque will oversee WWE's creative direction following the retirement of his father-in-law, Vince McMahon. McMahon, 74, retired after allegations that he doled out millions of dollars to quiet sexual misconduct claims.","url":"http://espn.go.com/wwe/story/_/id/34293405/paul-triple-h-levesque-replaces-vince-mcmahon-wwe-head-creative-direction","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0725%2Fr1040344_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T15:53:00Z","content":"Paul \"Triple H\" Levesque, one of the biggest names in wrestling since the mid-1990s, will now oversee WWE's creative direction, the organization announced Monday, following Vince McMahon's retirement… [+1892 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Mint 1952 Mickey Mantle card could fetch record price at auction","description":"A mint condition 1952 Mickey Mantle baseball card could break records when it goes up for auction next month.","url":"http://espn.go.com/mlb/story/_/id/34293166/mint-1952-mickey-mantle-card-fetch-record-price-auction","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0725%2Fr1040316_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T14:41:00Z","content":"NEW YORK -- A decades-old, mint condition Mickey Mantle baseball card could break records when it goes up for auction next month.\r\nThe collector's item from 1952 features one of baseball's most celeb… [+2481 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adrian WojnarowskiSenior NBA Insider ","title":"Boston Celtics among teams to engage in talks with Brooklyn Nets on possible Kevin Durant deal, sources say","description":"The Celtics have emerged among teams engaged in talks on a possible deal for Nets star Kevin Durant, sources told ESPN, with their ability to include Jaylen Brown as a centerpiece in any offer helping make Boston formidable in its pursuit.","url":"http://espn.go.com/nba/story/_/id/34291954/boston-celtics-teams-engage-talks-brooklyn-nets-possible-kevin-durant-deal-sources-say","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0725%2Fr1040240_1296x729_16%2D9.jpg","publishedAt":"2022-07-25T06:28:00Z","content":"As Brooklyn Nets star Kevin Durant's trade request approaches a fourth week, the Boston Celtics have emerged among teams engaged in talks on a possible deal, sources told ESPN.\r\nThe Celtics appear no… [+1901 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Washington Nationals' Victor Robles jabs back at Madison Bumgarner by sporting clown nose","description":"Victor Robles sported a clown nose on Sunday, a day after Diamondbacks pitcher Madison Bumgarner called him a \"clown\" for admiring his eighth-inning homer in a blowout loss.","url":"http://espn.go.com/mlb/story/_/id/34291551/washington-nationals-victor-robles-jabs-back-madison-bumgarner-sporting-clown-nose","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0725%2Fr1040235_1024x576_16%2D9.jpg","publishedAt":"2022-07-25T03:30:00Z","content":"PHOENIX -- LeBron James liked the clown nose. Dave Martinez wasn't as big of a fan.\r\nSorry skip, it appears Washington Nationals outfielder Victor Robles is siding with the NBA superstar on this one.… [+1315 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeremy Fowler, Louis Riddick, Seth Walder, Field Yates","title":"NFL Future Power Rankings 2022 - Projections for all 32 teams for the next three seasons","description":"Which NFL teams are set up for long-term success? We used a weighted set of rankings to project all 32 franchises from now through the 2024 season.","url":"http://espn.go.com/nfl/insider/story/_/id/34262543/nfl-future-power-rankings-2022-projections-all-32-teams-next-three-seasons","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0717%2Fnfl_future_power_rankings_1296x729.jpg","publishedAt":"2022-07-20T11:00:00Z","content":"Projecting ahead and building for future success -- beyond just the current season -- is crucial in the NFL. That's what the best teams all do to stay at the top of the standings. So which teams are … [+70913 chars]"}]}