{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Rich CiminiESPN Staff Writer ","title":"Sources - New York Jets add OT Duane Brown after Mekhi Becton's serious knee injury","description":"The Jets are signing offensive tackle Duane Brown after Mekhi Becton's likely season-ending knee injury.","url":"http://espn.go.com/nfl/story/_/id/34384400/sources-new-york-jets-add-ot-duane-brown-mekhi-becton-injury","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0301%2Fr980737_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T17:34:00Z","content":"FLORHAM PARK, N.J. -- With right tackle Mekhi Becton likely sidelined the entire season with a knee injury, the New York Jets finalized a two-year contract with offensive tackle tackle Duane Brown, a… [+1709 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Houston Astros manager Dusty Baker back after missing 5 games with COVID-19","description":"Houston Astros manager Dusty Baker returned Thursday for the finale of a series against the Texas Rangers following a five-game absence after testing positive for COVID-19.","url":"http://espn.go.com/mlb/story/_/id/34384198/houston-astros-manager-dusty-baker-back-missing-5-games-covid-19","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0504%2Fr1008134_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T17:28:00Z","content":"HOUSTON -- Houston Astros manager Dusty Baker returned Thursday for the finale of a series against the Texas Rangers following a five-game absence after testing positive for COVID-19.\r\nThe 73-year-ol… [+1989 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Brooke PryorESPN Staff Writer ","title":"Pittsburgh Steelers to start Mitch Trubisky over Mason Rudolph, Kenny Pickett in preseason opener","description":"Mitch Trubisky, who has taken almost all of the first-team reps for the Steelers during training camp, will start Pittsburgh's preseason opener Saturday. He will be followed by Mason Rudolph and Kenny Pickett.","url":"http://espn.go.com/nfl/story/_/id/34384088/pittsburgh-steelers-start-mitch-trubisky-mason-rudolph-kenny-pickett-preseason-opener","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0531%2Fr1019884_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T16:47:00Z","content":"LATROBE, Pa. -- The Pittsburgh Steelers have named a starting quarterback for their preseason opener, with coach Mike Tomlin going with Mitch Trubisky over Mason Rudolph and Kenny Pickett.\r\nThe order… [+2081 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Kristen ShiltonESPN NHL reporter ","title":"Vegas Golden Knights goaltender Robin Lehner set for hip surgery, expected to miss 2022-23 season","description":"Golden Knights goaltender Robin Lehner is not expected to play next season after it was determined that he needs hip surgery.","url":"http://espn.go.com/nhl/story/_/id/34383958/vegas-golden-knights-goaltender-robin-lehner-set-hip-surgery-expected-miss-2022-23-season","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0425%2Fr1004576_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T16:42:33Z","content":"Vegas Golden Knights goaltender Robin Lehner is expected to miss the 2022-23 season after he undergoes hip surgery, the team announced Thursday.\r\nA full timeline on Lehner's recovery is still to be d… [+1440 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jenna LaineESPN Staff Writer ","title":"Coach Todd Bowles - Tom Brady away from Tampa Bay Buccaneers to 'deal with some personal things'","description":"Buccaneers quarterback Tom Brady will be away from the team for a period of time to \"deal with some personal things,\" coach Todd Bowles said Thursday.","url":"http://espn.go.com/nfl/story/_/id/34383895/tom-brady-away-tampa-bay-buccaneers-deal-some-personal-things-coach-todd-bowles-says","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0730%2Fr1042396_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T15:51:00Z","content":"TAMPA, Fla. -- Buccaneers quarterback Tom Brady will be away from the team for a period of time to \"deal with some personal things,\" coach Todd Bowles said Thursday.\r\nBowles said Brady's absence was … [+422 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"RB James White retiring from NFL, says it was 'an honor to represent' New England Patriots","description":"Patriots running back James White announced his retirement from the NFL on Thursday.","url":"http://espn.go.com/nfl/story/_/id/34383755/rb-james-white-retiring-nfl-says-was-honor-represent-new-england-patriots","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F1214%2Fr790227_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T15:16:00Z","content":"New England Patriots running back James White announced his retirement from the NFL on Thursday.\r\nWhite, who re-signed with the Patriots on a two-year deal in the offseason, is on the team's physical… [+940 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"M.A. VoepelESPN.com ","title":"Skylar Diggins-Smith's status uncertain as Phoenix Mercury fight for WNBA playoff spot","description":"The status of WNBA All-Star guard Skylar Diggins-Smith, who has not played in the past two games while Phoenix battles for one of two remaining playoff spots, remains uncertain with two games remaining in the regular season.","url":"http://espn.go.com/wnba/story/_/id/34383695/skylar-diggins-smith-status-uncertain-phoenix-mercury-fight-wnba-playoff-spot","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0729%2Fr1041920_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T14:56:00Z","content":"The status of All-Star guard Skylar Diggins-Smith remains uncertain as the Phoenix Mercury continue to battle for one of the last two WNBA playoff spots with two games remaining in the regular season… [+5200 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Matt Miller","title":"Best 2023 NFL draft prospect on all 65 Power 5 college football teams - Players who could star and rise in class","description":"These are the best potential NFL players in all five major conferences, including double-digit quarterbacks.","url":"http://espn.go.com/nfl/draft2023/insider/story/_/id/34371201/best-2023-nfl-draft-prospect-all-65-power-5-college-football-teams-players-star-rise-class","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0811%2Fr1046965_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T10:45:00Z","content":"Picture this: It's a Saturday morning, there's a breeze in the air and College GameDay is on your television. Lee Corso is about to make his final pick of the day and you're wondering which 2023 NFL … [+26297 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Vanessa Bryant's attorney argues photos of Kobe Bryant's remains shared 'for a laugh'","description":"Vanessa Bryant's attorney told jurors on Wednesday that the cell-phone photos shot by first responders at the scene of a 2020 helicopter crash that killed Kobe Bryant died were \"visual gossip\" viewed \"for a laugh,\" and had no official purpose.","url":"http://espn.go.com/nba/story/_/id/34381927/vanessa-bryant-attorney-argues-photos-kobe-bryant-remains-shared-laugh","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0127%2Fr966371_1296x729_16%2D9.jpg","publishedAt":"2022-08-11T02:09:46Z","content":"LOS ANGELES -- An institutional \"culture of callousness\" led Los Angeles County deputies and firefighters to shoot and share photos of the remains of Kobe Bryant and other victims of the 2020 helicop… [+4367 chars]"}]}