{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Greg WyshynskiESPN ","title":"Tampa Bay Lightning's Nikita Kucherov forced from Game 3 after 'dangerous play' by Colorado Avalanche's Devon Toews","description":"Lightning star Nikita Kucherov left Game 3 of the Stanley Cup Final in the third period Monday night following what his teammate called a \"dangerous play\" by Avalanche defenseman Devon Toews.","url":"http://espn.go.com/nhl/story/_/id/34123981/tampa-bay-lightning-nikita-kucherov-forced-game-3-dangerous-play-colorado-avalanc-devon-toews","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0621%2Fr1027392_2_1296x729_16%2D9.jpg","publishedAt":"2022-06-21T05:21:00Z","content":"TAMPA -- Tampa Bay Lightning star Nikita Kucherov left Game 3 of the Stanley Cup Final following what his teammate called \"a dangerous play\" by Colorado Avalanche defenseman Devon Toews.\r\nKucherov le… [+1580 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marly RiveraESPN Writer ","title":"Gerrit Cole's longest no-hit bid of MLB career broken up in 8th inning as New York Yankees beat Tampa Bay Rays for 50th win","description":"Gerrit Cole took a no-hitter into the eighth inning -- the longest no-hit bid of his MLB career -- and the Yankees beat the Rays 4-2 on Monday night to put them 33 games over .500 at 50-17.","url":"http://espn.go.com/mlb/story/_/id/34123917/gerrit-cole-longest-no-hit-bid-mlb-career-broken-8th-inning-new-york-yankees-beat-tampa-bay-rays-50th-win","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0621%2Fr1027390_1296x729_16%2D9.jpg","publishedAt":"2022-06-21T04:44:00Z","content":"TAMPA -- Gerrit Cole will continue topping the list of best active major league pitchers without a no-hitter after a spectacular seven-inning performance in the New York Yankees' 4-2 win over the Tam… [+3404 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Elizabeth MerrillESPN Senior Writer ","title":"Auburn Tigers, battling stomach bug, rally to eliminate No. 2 Stanford Cardinal at Men's College World Series","description":"With a stomach bug and nearly seven decades of history working against it, Auburn rallied for a 6-2 win over No. 2 seed Stanford, sending the Cardinal home from Omaha without a victory for the first time in 18 Men's College World Series appearances.","url":"http://espn.go.com/college-sports/story/_/id/34123134/auburn-tigers-battling-stomach-bug-rally-eliminate-no-2-stanford-cardinal-men-college-world-series","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0621%2Fr1027343_1296x729_16%2D9.jpg","publishedAt":"2022-06-21T01:24:00Z","content":"OMAHA, Neb. -- With a stomach bug and nearly seven decades of history working against them, the Auburn Tigers were down to two options Monday when they fell behind to No. 2 Stanford at the Men's Coll… [+4288 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Kendra Andrews","title":"'We're back': Golden State Warriors revel in 4th title amid raucous parade","description":"The Warriors celebrated their fourth title in eight years in style as thousands crowded the streets of San Francisco for Monday's parade.","url":"http://espn.go.com/nba/story/_/id/34122834/golden-state-warriors-revel-4th-title-amid-raucous-parade","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0620%2Fr1027321_1024x576_16%2D9.jpg","publishedAt":"2022-06-20T23:47:43Z","content":"SAN FRANCISCO -- It's been two years since the Bay Area hosted a championship parade, but the city, nor the Warriors, forgot how to take in the moment.\r\nStephen Curry hopped on top of a banister at a… [+4018 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Dave WilsonESPN Staff Writer ","title":"Rueben Owens II, No. 2 RB recruit in class of 2023, commits to Louisville Cardinals football","description":"Rueben Owens II, the No. 2 running back in the 2023 ESPN 300, committed to Louisville on Monday, giving Scott Satterfield one of the biggest recruiting wins of his Cardinals coaching tenure.","url":"http://espn.go.com/college-football/story/_/id/34122822/rueben-owens-ii-no-2-rb-recruit-class-2023-commits-louisville-cardinals-football","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0620%2Fr1027320_1296x729_16%2D9.jpg","publishedAt":"2022-06-20T23:44:00Z","content":"Scott Satterfield secured one of the biggest wins of his Louisville football coaching tenure on Monday when top running back recruit Rueben Owens II committed to the Cardinals.\r\n\"I have always been a… [+1023 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Wife of WNBA star Brittney Griner says scheduled call never happened because embassy was unstaffed","description":"Cherelle Griner said Brittney tried to call her wife nearly a dozen times through the American embassy in Russia for the couple's anniversary but the call never went through because the embassy was not staffed on Saturday.","url":"http://espn.go.com/wnba/story/_/id/34122228/wife-wnba-star-brittney-griner-says-scheduled-call-never-happened-embassy-was-unstaffed","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0525%2Fr1017222_1296x729_16%2D9.jpg","publishedAt":"2022-06-20T21:04:00Z","content":"WASHINGTON -- WNBA star Brittney Griner tried to call her wife nearly a dozen times through the American embassy in Russia on the couple's fourth anniversary Saturday, but they never connected since … [+4118 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Houston Baptist men's basketball star Darius Lee killed, 8 others shot at Harlem gathering","description":"Darius Lee, a 21-year-old senior who starred for Houston Baptist, was killed at a gathering in Harlem. An All-Southland Conference pick, Lee led the Huskies in scoring and rebounding and was sixth in the nation in steals per game.","url":"http://espn.go.com/mens-college-basketball/story/_/id/34121440/houston-baptist-men-basketball-star-darius-lee-killed-8-other-shot-harlem-gathering","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0620%2Fr1027192_1296x729_16%2D9.jpg","publishedAt":"2022-06-20T17:08:00Z","content":"NEW YORK -- A college basketball player was killed and eight other people were wounded Monday in an early-morning shooting at a gathering in Harlem, New York City police said.\r\nOfficers responded aro… [+2484 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Orlando Magic still evaluating all options with No. 1 pick in NBA draft","description":"The Magic haven't decided yet what they'll do on Thursday night when the NBA draft rolls around and they have the No. 1 pick.","url":"http://espn.go.com/nba/story/_/id/34121446/orlando-magic-evaluating-all-options-no-1-pick-nba-draft","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0604%2Fr705124_1296x729_16%2D9.jpg","publishedAt":"2022-06-20T17:04:37Z","content":"ORLANDO, Fla. -- College basketball season ended almost three months ago, the NBA draft lottery was more than a month ago and the draft itself is later this week.\r\nSeems like the process should be wi… [+2714 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"David SchoenfieldESPN Senior Writer ","title":"Still-too-early 2022 MLB All-Stars: AL and NL roster predictions","description":"There's one month until the Midsummer Classic. Here's our first look at who will make it to L.A.","url":"http://espn.go.com/mlb/insider/story/_/id/34117905/still-too-early-2022-mlb-all-stars-al-nl-roster-predictions","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0619%2Fr1026928_1296x729_16%2D9.jpg","publishedAt":"2022-06-20T11:00:00Z","content":"We always call this piece the Way Too Early All-Star Selections, but we're a little later in the season, so let's call this the A Little Late But Still Early All-Star Selections.\r\nAs always, know you… [+25285 chars]"}]}