{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Dave WilsonESPN Staff Writer ","title":"Georgia Bulldogs coach Kirby Smart worried about college football players getting too much, too fast from NIL","description":"Georgia coach Kirby Smart said he's all for starters and upperclassmen earning NIL money, but he's concerned about players -- especially incoming players -- getting too much, too fast. Said Smart: \"It's a reverse system right now ... and that's tough.\"","url":"http://espn.go.com/college-football/story/_/id/34267988/georgia-bulldogs-coach-kirby-smart-worried-college-football-players-getting-too-much-too-fast-nil","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1201%2Fr945048_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T17:38:00Z","content":"Georgia coach Kirby Smart on Tuesday raised concerns about the \"reverse system\" of name, image and likeness deals and his frustrations with the recruiting calendar.\r\nIn a question-and-answer session … [+4038 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Alabama Crimson Tide's Nick Saban says megaconferences will create college football 'caste system'","description":"With college football megaconferences perhaps becoming something \"we all have to deal with in the future,\" Alabama coach Nick Saban said a possible result could be a \"caste system\" of haves and have-nots.","url":"http://espn.go.com/college-football/story/_/id/34267456/alabama-crimson-tide-nick-saban-says-megaconferences-create-college-football-caste-system","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1038065_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T15:40:00Z","content":"ATLANTA -- Alabama coach Nick Saban on Tuesday said that megaconferences \"may be something that we all have to deal with in the future.\"\r\nLast month, USC and UCLA agreed to leave the Pac-12 for the B… [+3772 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"President Joe Biden signs executive order that aims to punish captors of Americans held abroad","description":"President Joe Biden signed an executive order aimed at increasing the flow of information to families of Americans detained abroad. It is unclear if the new order will result in an expedited release of Brittney Griner or any other Americans jailed abroad.","url":"http://espn.go.com/wnba/story/_/id/34266928/president-joe-biden-signs-executive-order-aims-punish-captors-americans-held-abroad","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1038054_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T14:09:00Z","content":"WASHINGTON -- President Joe Biden signed an executive order Tuesday aimed at increasing the flow of information to families of Americans detained abroad and at imposing sanctions on the criminals, te… [+2599 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"A year later, NFL free agent Carl Nassib says he 'agonized' over decision to come out publicly","description":"Though Carl Nassib said he \"agonized\" over this decision to come out publicly, he ultimately did it \"for the kids,\" and to show that sexual orientation \"really doesn't matter.\"","url":"http://espn.go.com/nfl/story/_/id/34266930/a-year-later-carl-nassib-says-agonized-decision-come-publicly","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1038030_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T14:04:00Z","content":"When defensive end Carl Nassib announced he was gay in June 2021, he said he \"agonized\" over the decision.\r\nNassib, now a free agent after being released by the Las Vegas Raiders earlier this year, t… [+1745 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"David PurdumESPN Staff Writer ","title":"New-look USC Trojans emerge as most popular bet to win College Football Playoff at Las Vegas sportsbook","description":"Alabama and Ohio State are attracting the bulk of the betting action around the nation, but the story is a little different at one Las Vegas sportsbook, where more money has bet on USC to win the College Football Playoff than any other team.","url":"http://espn.go.com/chalk/story/_/id/34266663/new-look-usc-trojans-emerge-most-popular-bet-win-college-football-playoff-las-vegas-sportsbook","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1038022_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T12:45:00Z","content":"A pair of perennial powerhouses in Alabama and Ohio State are attracting the bulk of the betting action around the nation, but the story is a little different at one Las Vegas sportsbook, where more … [+2411 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Matt Miller","title":"NFL draft 2023 sleepers - Scouts pick under-the-radar prospects who could rise","description":"\"He could be this year's Zach Wilson.\" We asked NFL scouts to give us names of prospects who could make the leap into Round 1 next year.","url":"http://espn.go.com/nfl/draft2023/insider/story/_/id/34255659/nfl-draft-2023-sleepers-scouts-pick-radar-prospects-rise","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0717%2Fr1037175_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T10:25:00Z","content":"As human beings, we all love to be first to like something that becomes popular, from new bands and songs to gadgets. NFL scouts are no different when it comes to discovering prospects.\r\nI'll never f… [+14868 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"Washington Nationals' Juan Soto tops Seattle Mariners' Julio Rodriguez in final round to win 2022 Home Run Derby","description":"Juan Soto, whose All-Star week was upended by questions about his future with the Nationals after he turned down a $440 million extension, pounded 19 home runs in the final round to edge Mariners star rookie Julio Rodriguez for the Home Run Derby title.","url":"http://espn.go.com/mlb/story/_/id/34265038/washington-nationals-juan-soto-tops-seattle-mariners-julio-rodriguez-final-round-win-2022-home-run-derby","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1037948_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T02:52:00Z","content":"LOS ANGELES -- If Juan Soto gets traded, the team that acquires him won't just be getting one of the best hitters in baseball. It will get the reigning Home Run Derby champion, too.\r\nSoto, the phenom… [+1639 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Marc J. Spears","title":"Deandre Ayton 'happy' with resolution after signing extension; Phoenix Suns tout 'vital' piece","description":"Deandre Ayton called his new 4-year deal with the Suns a \"blessing\" and said he is happy to put his extended restricted free agency behind him.","url":"http://espn.go.com/nba/story/_/id/34264981/deandre-ayton-happy-resolution-signing-extension-phoenix-suns-tout-vital-piece","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0719%2Fr1037937_1296x729_16%2D9.jpg","publishedAt":"2022-07-19T02:48:00Z","content":"Deandre Ayton says he gained generational wealth that can help his family and many others after signing a four-year, $133 million maximum contract extension to return to the Phoenix Suns on Monday.\r\n… [+9395 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Report -- Golf voice David Feherty leaving NBC, expected to join LIV series","description":"David Feherty is leaving NBC and is expected to join the breakaway tour as an analyst for 8-to-10 tournaments annually, the New York Post reported Monday, citing sources.","url":"http://espn.go.com/golf/story/_/id/34264263/report-golf-voice-david-feherty-leaving-nbc-expected-join-liv-series","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F0915%2Fap_802956493612_r9011_1296x729_16%2D9.jpg","publishedAt":"2022-07-18T21:52:00Z","content":"The Saudi-funded LIV Golf series is set to another big name -- this one outside the playing ropes.\r\nDavid Feherty is leaving NBC and is expected to join the breakaway tour as an analyst for 8-to-10 t… [+872 chars]"}]}