{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Alden GonzalezESPN Staff Writer ","title":"Dodger Stadium concession workers, pleased with progress in negotiations, won't strike around All-Star Game","description":"The concession stands will be staffed when Dodger Stadium hosts its first All-Star Game in 42 years, as the workers' union has agreed not to strike around the event amid progress in negotiations.","url":"http://espn.go.com/mlb/story/_/id/34248463/dodger-stadium-concession-workers-pleased-progress-negotiations-strike-all-star-game","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F1119%2Fr777791_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T18:10:00Z","content":"Dodger Stadium concession workers have relinquished plans for a strike during next week's All-Star Game after threatening to do so in an effort to secure higher wages.\r\nIn a joint statement Friday by… [+1336 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Houston Texans settle claims vs. team in relation to sexual misconduct allegations involving Deshaun Watson","description":"The Texans have settled all claims and intended claims against the organization in relation to sexual misconduct allegations against former quarterback Deshaun Watson, it was announced Friday.","url":"http://espn.go.com/nfl/story/_/id/34248377/houston-texans-settle-claims-vs-team-relation-sexual-misconduct-allegations-involving-deshaun-watson","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0222%2Fr977878_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T17:41:20Z","content":"The Houston Texans have settled all claims and intended claims against the organization in relation to the team's role regarding allegations of sexual misconduct involving former Texans quarterback D… [+1096 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mark SchlabachESPN Senior Writer ","title":"Tiger Woods misses cut after finishing the second round of the Open Championship 3-over","description":"In what is likely his final Open Championship at St. Andrews, Tiger Woods misses the cut after shooting 9-over through the first two rounds of the tournament.","url":"http://espn.go.com/golf/story/_/id/34247696/tiger-woods-misses-cut-finishing-second-round-open-championship-3-over","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0715%2Fr1036565_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T14:22:41Z","content":"ST. ANDREWS, Scotland -- Tiger Woods walked across the Swilcan Bridge on the 18th fairway of the Old Course on Friday, possibly wondering whether he had played the final round of his storied career i… [+4160 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Tom HamiltonSenior Writer ","title":"LIV Golf players, led by Dustin Johnson, finding success at The Open amid backlash for breaking away","description":"As the criticism continues for the breakaway LIV Golf series and its players, a number of them, including Dustin Johnson at 9 under, are finding success at The Open. Talor Gooch says the backlash has served to galvanize the new series' players.","url":"http://espn.go.com/golf/story/_/id/34247462/liv-golf-players-led-dustin-johnson-finding-success-open-amid-backlash-breaking-away","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0715%2Fr1036554_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T13:20:00Z","content":"ST. ANDREWS, Scotland -- The criticism leveled at the LIV Golf players by their peers and the sport's stakeholders has galvanized them at the 150th Open, according to Talor Gooch.\r\nGooch carded a 3-u… [+2617 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"ESPN","title":"USSF president Parlow-Cone Equal pay breakthrough lifts 'dark cloud' over U.S. soccer","description":"USSF president Cindy Parlow-Cone has told ESPN \"a dark cloud has moved along\" as equal pay was agreed with the men and women's national teams.","url":"http://espn.go.com/soccer/united-states-usaw/story/4701197/ussf-president-parlow-cone-equal-pay-breakthrough-lifts-dark-cloud-over-us-soccer","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0715%2Fr1036546_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T12:41:00Z","content":"United States Soccer Federation (USSF) president Cindy Parlow-Cone has told ESPN that achieving equal pay for the men's and women's national teams has made \"a dark cloud that was hanging over all of … [+5236 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"WNBA star Brittney Griner back in Russian court as trial resumes","description":"Brittney Griner appeared in a Russian court as her trial resumed Friday. Her attorneys gave evidence that Griner had a medical exemption for cannabis use in the United States.","url":"http://espn.go.com/wnba/story/_/id/34246519/wnba-star-brittney-griner-back-russian-court-trial-resumes","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0715%2Fr1036511_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T10:25:00Z","content":"KHIMKI, Russia -- A lawyer for WNBA star Brittney Griner, who is jailed in Russia on drug charges, on Friday presented a court with a doctor's letter recommending she use cannabis to treat pain.\r\nGri… [+3774 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adrian WojnarowskiSenior NBA Insider ","title":"Phoenix Suns match Indiana Pacers' 4-year, $133 million offer sheet to Deandre Ayton, agents say","description":"The Suns matched the Pacers' 4-year, $133 million offer sheet for restricted free agent center Deandre Ayton, clearing the way for him to return to the franchise, his agents, Bill Duffy and Nima Namakian, told ESPN.","url":"http://espn.go.com/nba/story/_/id/34245243/phoenix-suns-match-indiana-pacers-4-year-133-million-offer-sheet-deandre-ayton","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0711%2Fr1035282_1296x729_16%2D9.jpg","publishedAt":"2022-07-15T00:31:00Z","content":"The Phoenix Suns matched the Indiana Pacers' four-year, $133 million offer sheet for restricted free agent center Deandre Ayton, clearing the way for him to return to the franchise, his agents, Bill … [+3277 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"Agent Casey Close sues Fox Sports radio host Doug Gottlieb for libel over tweet about contract offer to Los Angeles Dodgers' Freddie Freeman","description":"Agent Casey Close sued Fox Sports radio host Doug Gottlieb for libel, alleging Gottlieb \"falsely and recklessly\" defamed Close with a tweet that claimed Close and his agency hadn't presented a contract offer to Freddie Freeman during free agency.","url":"http://espn.go.com/mlb/story/_/id/34244218/agent-casey-close-sues-fox-sports-radio-host-doug-gottlieb-libel-tweet-contract-offer-los-angeles-dodgers-freddie-freeman","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0430%2Fr694410_1296x729_16%2D9.jpg","publishedAt":"2022-07-14T20:29:00Z","content":"Agent Casey Close sued Fox Sports radio host Doug Gottlieb for libel Thursday, alleging that Gottlieb \"falsely and recklessly\" defamed Close and Excel Sports Management in a tweet that claimed they h… [+3553 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"NBA insiders","title":"Donovan Mitchell trades we want to see - including a chance to get Kevin Durant and Ben Simmons out of Brooklyn","description":"The Jazz are open to Donovan Mitchell trade possibilities after receiving a haul for Rudy Gobert. Here are a few blockbuster scenarios we'd like to see.","url":"http://espn.go.com/nba/insider/story/_/id/34237021/donovan-mitchell-trades-want-see-including-chance-get-kevin-durant-ben-simmons-brooklyn","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1035847_1296x729_16%2D9.jpg","publishedAt":"2022-07-14T12:00:00Z","content":"After previously shutting down any chance of trading 25-year-old superstar Donovan Mitchell,Utah has had a change of heart, as rival teams across the league say the Jazz are now open to trading their… [+11051 chars]"}]}