{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Oklahoma little league batter consoles tearful opposing pitcher after being hit in head during LLWS qualifier","description":"In a dramatic scene at a Little League regional tournament game Tuesday in Texas, batter Isaiah Jarvis walked to the mound to comfort opposing pitcher Kaiden Shelton after the right-hander's pitch slammed into Jarvis' helmet, sending him to the ground.","url":"http://espn.go.com/espn/story/_/id/34375953/oklahoma-little-league-batter-consoles-tearful-opposing-pitcher-being-hit-head-llws-qualifier","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F0821%2Fespn_a_llws_logo_1296x729.jpg","publishedAt":"2022-08-10T00:39:00Z","content":"WACO, Texas -- A little league batter rose after being hit in the head to console the upset pitcher who threw the pitch during a Little League regional tournament game Tuesday in Waco, Texas.\r\nThe dr… [+912 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mark SchlabachESPN Senior Writer ","title":"Federal judge rejects bid by three LIV golfers to compete in FedEx Cup playoffs","description":"A federal judge on Tuesday denied a temporary restraining order to three golfers who were seeking to participate in the FedEx Cup Playoffs after leaving the PGA Tour for the upstart LIV Golf Invitational Series.","url":"http://espn.go.com/golf/story/_/id/34375643/federal-judge-rejects-bid-three-liv-golfers-compete-fedex-cup-playoffs","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0803%2Fr1044104_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T22:46:00Z","content":"MEMPHIS, Tenn. - A federal judge on Tuesday denied a temporary restraining order to three golfers who were seeking to participate in the FedEx Cup Playoffs after leaving the PGA Tour for the upstart … [+2445 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Sarah BarshopESPN Staff Writer ","title":"Rams coach Sean McVay announces he signed extension with team during offseason, says GM Les Snead's deal still in works","description":"Los Angeles Rams head coach Sean McVay said he signed a contract extension during the offseason, but the team was waiting to announce it until general manager Les Snead signed an extension as well.","url":"http://espn.go.com/nfl/story/_/id/34375556/rams-coach-sean-mcvay-announces-signed-extension-team-offseason-says-gm-les-snead-deal-works","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0203%2Fr969495_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T22:18:00Z","content":"IRVINE, Calif. -- Los Angeles Rams head coach Sean McVay said he signed a contract extension during the offseason, but the team was waiting to announce it until general manager Les Snead signed an ex… [+2117 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff LegwoldESPN Senior Writer ","title":"NFL commissioner Roger Goodell says evidence calls for at least full-year suspension for Cleveland Browns QB Deshaun Watson","description":"Commissioner Roger Goodell said the NFL seeks a tougher penalty for Deshaun Watson than his initial six-game suspension because the quarterback's actions were \"egregious'' and \"predatory behavior.''","url":"http://espn.go.com/nfl/story/_/id/34375432/roger-goodell-says-evidence-calls-least-full-year-suspension-cleveland-browns-qb-deshaun-watson","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0809%2Fr1046438_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T21:27:00Z","content":"BLOOMINGTON, Minn. -- NFL commissioner Roger Goodell said Tuesday the league seeks a tougher penalty for Deshaun Watson because the quarterback's actions were \"egregious'' and \"predatory behavior.''\r… [+3882 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jake TrotterESPN Staff Writer ","title":"Source - Cleveland Browns fear torn Achilles for WR/KR Jakeem Grant","description":"The Browns fear that receiver and returner Jakeem Grant suffered a torn Achilles in Tuesday's practice, a source told ESPN.","url":"http://espn.go.com/nfl/story/_/id/34375177/source-cleveland-browns-fear-torn-achilles-wr-kr-jakeem-grant","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0809%2Fr1046427_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T20:15:00Z","content":"BEREA, Ohio -- Cleveland Browns wide receiver and kick returner Jakeem Grant Sr. suffered what the team fears is a torn Achilles, a league source told ESPN.\r\nGrant had to be carted off the field duri… [+747 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Rob DemovskyESPN Staff Writer ","title":"Aaron Rodgers doesn't see 'any benefit to playing one series' in a preseason game","description":"Green Bay Packers quarterback Aaron Rodgers said Tuesday he doesn't see \"any benefit\" to playing one series in a preseason game, but he's willing to play if coach Matt LaFleur deems it necessary.","url":"http://espn.go.com/nfl/story/_/id/34374906/aaron-rodgers-see-benefit-playing-one-series-preseason-game","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0806%2Fr1045211_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T19:22:00Z","content":"GREEN BAY, Wis. - Aaron Rodgers doesn't feel the need to play in the preseason but if the Green Bay Packers quarterback does play, then he really wants to play.\r\nRodgers hasn't played a preseason sna… [+3233 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"John KeimESPN Staff Writer ","title":"Washington Commanders fire DL coach Sam Mills after 'difference of philosophy'","description":"Commanders coach Ron Rivera cited a \"difference in philosophy,\" as the reason for firing defensive line coach Sam Mills on Tuesday. Mills had been with Rivera since 2011 and is being replaced by his assistant, Jeff Zgonina.","url":"http://espn.go.com/nfl/story/_/id/34374338/washington-commanders-fire-dl-coach-sam-mills-difference-philosophy","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0617%2Fr1026221_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T17:05:00Z","content":"ASHBURN, Va. -- The Washington Commanders fired defensive line coach Sam Mills on Tuesday, with coach Ron Rivera calling it a \"difference of philosophy.\"\r\nJeff Zgonina, who played one season with Mil… [+3027 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Courtney CroninESPN Staff Writer ","title":"Roquan Smith requests trade from Chicago Bears","description":"All-Pro linebacker Roquan Smith said the Bears have \"refused to negotiate in good faith\" and that the team has left him \"no choice\" but to request to be traded.","url":"http://espn.go.com/nfl/story/_/id/34373632/roquan-smith-requests-trade-chicago-bears","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0809%2Fr1046274_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T13:42:02Z","content":"CHICAGO -- Bears linebacker Roquan Smith said in a written statement that he has requested a trade after contract negotiations between himself and the organization reached an impasse.\r\nSmith penned a… [+2728 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Jeff PassanESPN ","title":"How Juan Soto became a San Diego Padre -- inside the biggest deal in baseball history","description":"It took weeks of maneuvering and hours of discussion -- and still hit an Eric Hosmer-related hiccup at the end. But by the afternoon of Aug. 2, baseball history was made.","url":"http://espn.go.com/mlb/insider/story/_/id/34371428/how-juan-soto-became-san-diego-padre-biggest-deal-baseball-history","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0804%2Fr1044246_1296x729_16%2D9.jpg","publishedAt":"2022-08-09T11:00:00Z","content":"BLEARY-EYED AND SLEEP-DEPRIVED, their five-o'clock shadows looking more like 10, A.J. Preller and Mike Rizzo lurched into their offices on opposite coasts early Tuesday morning ready to do the unthin… [+28516 chars]"}]}