{"status":"ok","totalResults":9,"articles":[{"source":{"id":"espn","name":"ESPN"},"author":"Brady Henderson","title":"Seattle Seahawks' Drew Lock to miss start Thursday after testing positive for COVID-19","description":"Seattle Seahawks quarterback Drew Lock will miss his start in Thursday's preseason game after testing positive for COVID-19.","url":"http://espn.go.com/nfl/story/_/id/34410168/seattle-seahawks-drew-lock-miss-start-thursday-testing-positive-covid-19","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0713%2Fr1035955_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T01:36:00Z","content":"RENTON, Wash. -- Seattle Seahawks quarterback Drew Lock has tested positive for COVID-19 and will miss Thursday's second preseason game, the team announced Tuesday.\r\nThe news came roughly 90 minutes … [+4592 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"D'Arcy Maine","title":"Serena Williams' run in Cincinnati short-lived, as Emma Raducanu posts Round 1 win in straight sets","description":"In what proved to be her final tune-up match before the U.S. Open, Serena Williams lost in straight sets on Tuesday night to Emma Raducanu in the first round of the Western & Southern Open in Ohio.","url":"http://espn.go.com/tennis/story/_/id/34410074/serena-williams-run-cincinnati-short-lived-emma-raducanu-posts-round-1-win-straight-sets","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0817%2Fr1049266_1296x729_16%2D9.jpg","publishedAt":"2022-08-17T00:37:00Z","content":"MASON, Ohio -- Serena Williams lost in the opening-round match of the penultimate tournament of her career Tuesday, but was still given a hero's sendoff following the 6-4, 6-0 defeat to Emma Raducanu… [+2744 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mark SchlabachESPN Senior Writer ","title":"Tiger Woods, Rickie Fowler among PGA Tour players conferring amid LIV Golf strife","description":"Tiger Woods arrived in Wilmington, Delaware, the site of this week's BMW Championship, on Tuesday to meet with a select number of PGA Tour players amid the ongoing battle with LIV Golf for the best players in the world.","url":"http://espn.go.com/golf/story/_/id/34409794/tiger-woods-rickie-fowler-pga-tour-players-conferring-amid-liv-golf-strife","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0714%2Fr1036421_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T23:18:00Z","content":"Tiger Woods arrived in Wilmington, Delaware, the site of this week's BMW Championship, on Tuesday to meet with a select number of players to discuss the future of the PGA Tour and how it might be str… [+3116 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mike ReissESPN Staff Writer ","title":"New England Patriots put Malcolm Butler on injured reserve","description":"The Pats placed Malcolm Butler on injured reserve Tuesday, ending his season as he attempted a comeback with the franchise where he became a Super Bowl hero seven years ago. Butler sustained a hip injury, a source said.","url":"http://espn.go.com/nfl/story/_/id/34409673/new-england-patriots-put-malcolm-butler-injured-reserve","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1049220_1296x1296_1%2D1.jpg","publishedAt":"2022-08-16T22:37:00Z","content":"FOXBOROUGH, Mass. -- The New England Patriots placed veteran cornerback Malcolm Butler on injured reserve Tuesday, ending his season and comeback attempt with the franchise where he became a Super Bo… [+1322 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Rob DemovskyESPN Staff Writer ","title":"Green Bay Packers' Aaron Rodgers frustrated with drops, inconsistency by young receivers","description":"Quarterback Aaron Rodgers expressed frustration with the Packers' young receivers, referencing \"a lot of drops, a lot of bad decisions, running the wrong route.\"","url":"http://espn.go.com/nfl/story/_/id/34409278/green-bay-packers-aaron-rodgers-frustrated-drops-inconsistency-young-receivers","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0110%2Fr960001_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T20:39:00Z","content":"GREEN BAY, Wis. -- The expiration date on Aaron Rodgers' patience with the Green Bay Packers' young pass catchers must have read Aug. 16.\r\nFor the first time since losing Davante Adams in free agency… [+4257 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Rich CiminiESPN Staff Writer ","title":"New York Jets quarterback Zach Wilson's right knee surgery deemed a success, sources say","description":"New York quarterback Zach Wilson underwent arthroscopic knee surgery Tuesday in Los Angeles, and a source told ESPN the procedure was deemed a success, but the Jets are still expecting Joe Flacco will start the regular-season opener, another source said.","url":"http://espn.go.com/nfl/story/_/id/34409078/new-york-jets-quarterback-zach-wilson-right-knee-surgery-deemed-success-sources-say","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1049143_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T19:25:00Z","content":"FLORHAM PARK, N.J. -- New York quarterback Zach Wilson underwent arthroscopic knee surgery Tuesday in Los Angeles, and a source told ESPN that the procedure was deemed a success.\r\nThere were no surpr… [+1628 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":null,"title":"Pittsburgh Pirates' Rololfo Castro suspended one game for having cellphone in pocket","description":"Pirates infielder Rodolfo Castro was suspended one game and fined an undisclosed amount Tuesday for having a cellphone in his back pocket during an Aug. 9 game against the Diamondbacks.","url":"http://espn.go.com/mlb/story/_/id/34409004/pittsburgh-pirates-rodolfo-castro-suspended-one-game-having-cell-phone-pocket","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1049141_1296x729_16%2D9.jpg","publishedAt":"2022-08-16T19:16:00Z","content":"Pittsburgh Pirates infielder Rodolfo Castro was suspended one game and fined an undisclosed amount Tuesday for having a cellphone in his back pocket during an Aug. 9 game against the Arizona Diamondb… [+970 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Adam RittenbergESPN Senior Writer ","title":"Ohio State football loses running back Evan Pryor to season-ending knee injury, sources confirm","description":"Ohio State's Evan Pryor, who rushed for 98 yards and a TD on 21 carries as a true freshman, suffered a season-ending knee injury during Monday's practice, sources confirmed to ESPN.","url":"http://espn.go.com/college-football/story/_/id/34408517/ohio-state-football-loses-running-back-evan-pryor-season-ending-knee-injury-sources-confirm","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1049108_1296x1296_1%2D1.jpg","publishedAt":"2022-08-16T17:33:00Z","content":"Ohio State running back Evan Pryor will miss the season after suffering a knee injury in practice Monday, sources confirmed to ESPN.\r\nPryor rushed for 98 yards and a touchdown on 21 carries as a true… [+978 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Mike ClayESPN Writer ","title":"Fantasy Football Ultimate Draft Board - Perfect picks for every round","description":"Things rarely go exactly as planned in fantasy football drafts, but Mike Clay provides a realistic blueprint to follow, including his ideal selections in each round and overall draft strategy for 2022.","url":"http://espn.go.com/fantasy/football/insider/story/_/id/34351965/fantasy-football-ultimate-draft-board-perfect-picks-every-round","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1214%2Fr951104_1296x729_16%2D9.jpg","publishedAt":"2022-08-15T11:30:00Z","content":"Fantasy football drafts are all about collecting the best possible values, but we all know those special players exist whom we badly want on our squad.\r\nWhether it's the young, up-and-coming wide rec… [+19071 chars]"}]}