{"status":"ok","totalResults":7,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":"https://www.facebook.com/bbcnews","title":"Uyghurs: China may have committed crimes against humanity in Xinjiang - UN","description":"China urged the UN not to release the report - Beijing called it a \"farce\" arranged by the West.","url":"https://www.bbc.com/news/world-asia-62744522","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/671A/production/_126549362_5a0c60b2d29380b8bcd538000c9a94549a60946d.jpg","publishedAt":"2022-09-01T10:27:11+00:00","content":"By Matt Murphy &amp; Flora Drury &amp; Tessa WongBBC News\r\nThe UN has accused China of \"serious human rights violations\" in a long-awaited report into allegations of abuse in Xinjiang province.\r\nChin… [+6903 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Travis Caldwell, Andy Rose and Omar Jimenez, CNN","title":"The first bus carrying migrants from the US-Mexico border in Texas arrives in Chicago, officials say","description":"The state of Texas, which for several months has bussed thousands of newly arrived migrants at the US-Mexico border to New York City and Washington, DC, has set a new metropolitan area as a destination: Chicago.","url":"https://www.cnn.com/2022/09/01/us/texas-buses-migrants-chicago/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220901021931-02-texas-chicago-migrants-busing-super-tease.jpg","publishedAt":"2022-09-01T07:58:00+00:00","content":"(CNN)The state of Texas, which for several months has bussed thousands of newly arrived migrants at the US-Mexico border to New York City and Washington, DC, has set a new metropolitan area as a dest… [+3541 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Democrat Mary Peltola beats Sarah Palin in Alaska special election","description":"Mary Peltola, a Democratic former state lawmaker, won a special election to fill Alaska's sole U.S. House of Representatives seat, becoming the first Alaska Native to represent the state in Congress, the Alaska Division of Elections announced on Wednesday.","url":"https://www.reuters.com/world/us/palin-or-peltola-alaska-announce-results-us-house-special-election-2022-08-31/","urlToImage":"https://www.reuters.com/resizer/FoO_AxEAYP9ojnQtF5CWXlMpYnA=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/XOBUONFDBZLXHE2AKAKJHIYDLY.jpg","publishedAt":"2022-09-01T05:37:00+00:00","content":"Aug 31 (Reuters) - Mary Peltola, a Democratic former state lawmaker, won a special election to fill Alaska's sole U.S. House of Representatives seat, becoming the first Alaska Native to represent the… [+2035 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Jeremy Herb, Tierney Sneed, Kara Scannell, Holmes Lybrand and Marshall Cohen, CNN","title":"Trump tells court that classified material should have been expected in presidential records found at Mar-a-Lago","description":"Former President Donald Trump argued in a court filing Wednesday that the National Archives should have expected to find classified material among the 15 boxes Trump turned over in January from Mar-a-Lago because they were presidential records.","url":"https://www.cnn.com/2022/08/31/politics/trump-response-mar-a-lago-search-special-master/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220831165442-01-donald-trump-court-filing-super-tease.jpg","publishedAt":"2022-09-01T02:30:00+00:00","content":"Former President Donald Trump argued in a court filing Wednesday that the National Archives should have expected to find classified material among the 15 boxes Trump turned over in January from Mar-a… [+44 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Brady Dennis, Sarah Kaplan","title":"Jackson, Miss., shows how extreme weather can trigger a clean-water crisis","description":"This week's water crisis in Jackson, Miss., portends what could happen in other U.S. communities, as climate change pushes under-resourced and overburdened water systems to the brink.","url":"https://www.washingtonpost.com/climate-environment/2022/08/31/jackson-water-crisis-mississippi-floods/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RJX5GVBJK4I63KIK7TSACXP4R4.jpg&w=1440","publishedAt":"2022-09-01T00:29:00+00:00","content":"Comment on this story\r\nThe water crisis unfolding in Mississippis capital this week has forced schools to shift to virtual learning, led to widespread distribution of bottled water and left Jacksons … [+9255 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"\"A truckers worst nightmare\": Castaic fire causes huge traffic issues on the 5 freeway - CBS Los Angeles","description":"<ol><li>\"A truckers worst nightmare\": Castaic fire causes huge traffic issues on the 5 freeway  CBS Los Angeles\r\n</li><li>Emergency Alert TV Interruption Leaves Los Angeles Viewers Guessing  Deadline\r\n</li><li>Brush fire near Castaic grows to 4,600 acres; eva…","url":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9VGVlU0NJTGQtQkXSAQA?oc=5","urlToImage":null,"publishedAt":"2022-08-31T23:57:10+00:00","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"google-news","name":"Google News"},"author":"Mark Lungariello","title":"Airport baggage handler Jermani Thompson killed in freak conveyor belt accident","description":"The freak accident happened as Jermani Thompson, 26, was unloading a Frontier Airlines plane parked at Louis Armstrong New Orleans International Airport Tuesday at around 10 p.m.","url":"https://nypost.com/2022/08/31/airport-baggage-handler-jermani-thompson-killed-in-freak-conveyor-belt-accident/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2022/08/baggage-scalped-comp-1.jpg?quality=75&strip=all&w=1024","publishedAt":"2022-08-31T23:08:00+00:00","content":"A baggage handler at a New Orleans airport was killed when her hair got tangled in the machinery of a belt loader, officials said Wednesday.\r\nThe freak accident happened as Jermani Thompson, 26, was … [+1372 chars]"}]}