{"status":"ok","totalResults":9,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express Web Desk","title":"Mumbai News Live Today: Dahi Handi celebrations in full swing in Mumbai","description":"Mumbai Live, Latest Mumbai News Today, August 19, 2022: The 11 convicts were freed from jail Monday after a Gujarat government panel approved their application for remission of sentence.","url":"https://indianexpress.com/article/cities/mumbai/maharashtra-mumbai-news-live-updates-today-traffic-rains-political-8098757/","urlToImage":"https://images.indianexpress.com/2022/08/dahi_handi_featured.jpeg","publishedAt":"2022-08-19T16:53:19+00:00","content":"An abandoned yacht was Thursday found adrift off Maharashtra, carrying three AK-74 rifles and ammunition, briefly setting off a security scare before officials ruled out a terror angle. The yachts sa… [+1152 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"CBI Raids On Manish Sisodia Over Delhi Liquor Policy End After 14 Hours","description":"Manish Sisodia, Delhi's Deputy Chief Minister who also handles the Excise department, was raided by the CBI today over allegations of corruption in the liquor policy. The Aam Aadmi Party government has denied the allegations.","url":"https://www.ndtv.com/india-news/cbi-raids-residence-of-delhi-deputy-chief-minister-manish-sisodia-3267382","urlToImage":"https://c.ndtvimg.com/2022-08/s71bh0q_cbi-raids_625x300_19_August_22.jpg","publishedAt":"2022-08-19T14:55:00+00:00","content":"<li>The CBI carried out searches at Manish Sisodia's home in Delhi and 31 other locations across seven states. The mandatory sanction for registering a corruption case was given by Lieutenant Governo… [+2631 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express News Service","title":"The Brothers Yadav start with a tumble, over aides at official meetings","description":"Photographs have appeared of the two holding official meetings with aides in attendance, drawing charges of “outsourcing governance” to “furthering family interests”.","url":"https://indianexpress.com/article/political-pulse/brothers-yadav-start-with-tumble-over-aides-at-official-meetings-8100285/","urlToImage":"https://images.indianexpress.com/2022/08/tej-pratap-tejashwi.jpg","publishedAt":"2022-08-19T14:52:12+00:00","content":"Photographs have appeared of the two holding official meetings with aides in attendance, drawing charges of outsourcing governance to furthering family interests. If Deputy Chief Minister Tejashwi ha… [+2768 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"3,500 kg Explosives, 7 am Evacuation: How Noida Towers Will Be Demolished","description":"It's all set. The date is locked. The gunpowder is ready. Residents have been asked to stay away as the Supertech's 40-storey Noida twin towers will be demolished at 2.30 pm on August 28.","url":"https://www.ndtv.com/india-news/3-500-kg-explosives-7-am-evacuation-how-noida-towers-will-be-demolished-3268743","urlToImage":"https://c.ndtvimg.com/2022-07/0om7ohec_supertech-twin-towers-noida-twin-towers-ndtv-photo_625x300_26_July_22.jpg","publishedAt":"2022-08-19T11:41:16+00:00","content":"Early this week, several trucks carrying explosives were seen arriving at the demolition site.\r\nNew Delhi: It's all set. The date is locked. The gunpowder is ready. Residents have been asked to stay … [+1976 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Partha Chatterjee was cancer, had to be removed: Trinamool leader","description":"Partha Chatterjee was arrested by the Enforcement Directorate in July for his alleged involvement in Bengal’s teacher recruitment scam. Following his arrest, Mamata Banerjee sacked him from all posts and ousted him from the party.","url":"https://www.indiatoday.in/india/story/partha-chatterjee-was-cancer-had-to-be-removed-trinamool-congress-leader-prabir-saha-1990057-2022-08-19","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Partha_Chatterjee_0-647x363.jpeg?6.n0eVBlMBuyw03fXWCNBGWn0tfENJ2F","publishedAt":"2022-08-19T11:10:47+00:00","content":"Bengals ex-minister Partha Chatterjee, jailed after a massive pile of cash was found at the home of his aide Arpita Mukherjee, was cancer for the party, Trinamool Congress leader and the chairman of … [+964 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Hindustantimes","title":"Two pilots flying at 37,000 feet fall asleep, miss runway to land","description":"Flight ET-343 continued following the route planned by the Flight Management Computer, without, however, descending. Air traffic controllers tried to contact the pilots several times but did not receive a response. | World News","url":"https://www.hindustantimes.com/world-news/two-pilots-flying-at-35-000-feet-fall-asleep-miss-runway-to-land-101660899685348.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/19/1600x900/ethiopian_airlines_pilots_miss_landing_fall_asleep_1660904485900_1660904486118_1660904486118.jpg","publishedAt":"2022-08-19T10:27:18+00:00","content":"Two pilots flying a plane from Sudan to Ethiopia fell asleep when the aircraft was 37,000 feet above sea level, and missed their landing. The incident happened on Monday (August 15), and the pilots s… [+2338 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Respite for Parched North India: Heavy Rains to Lash J&K, Himachal, Uttarakhand, Rajasthan, Punjab, UP from August 19-22 | The Weather Channel","description":"The IMD has placed East Rajasthan on an orange alert from Saturday to Monday, with Uttarakhand sharing the alert on Monday. - Articles from The Weather Channel | weather.com","url":"https://weather.com/en-IN/india/monsoon/news/2022-08-19-heavy-rains-to-lash-jk-himachal-uttarakhand-from-august-19-to-22","urlToImage":"https://s.w-x.co/in-delhi%20rain_2.jpg","publishedAt":"2022-08-19T08:40:26+00:00","content":"Friday, August 19:\r\n As the well-marked low-pressure area continues to develop off the south Pakistan coast, widespread rains that have been lashing many parts of the northern and northwestern Indian… [+3022 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Don’t blame judiciary for release of rapists, says judge who upheld Bilkis Bano case conviction","description":"Justice Mridula Bhatkar, who had upheld the conviction of 11 convicts in the Bilkis Bano gang-rape case, urged people not to blame the judiciary for the release of the convicts.","url":"https://www.indiatoday.in/india/story/dont-blame-judiciary-for-release-convicts-says-judge-in-bilkis-bano-case-1989871-2022-08-19","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Court_gavel-647x363.png?3ckidjC4mEP58AzKc1mwATOW_hdtc6IW","publishedAt":"2022-08-19T07:06:51+00:00","content":"Justice Mridula Bhatkar, who had upheld the conviction of 11 convicts in the Bilkis Bano gang-rape case, urged people not to blame the judiciary for the release of the convicts, saying it was the gov… [+2885 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Anybody can go vote in Jammu & Kashmir? Here’s what election rules say","description":"Jammu and Kashmir's Chief Electoral Officer Hirdesh Kumar’s announcement about non-locals being able to vote in the union territory has led to several assumptions. Read on to find out the facts based on poll rules.","url":"https://www.indiatoday.in/india/story/anybody-can-vote-jammu-kashmir-what-election-rules-say-1989773-2022-08-19","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Vote-647x363.png?4zBeXbT_KsYYOfixuKqEceTbAPRKabxf","publishedAt":"2022-08-19T02:14:59+00:00","content":"Jammu and Kashmir's Chief Electoral Officer (CEO) Hirdesh Kumars announcement about non-locals, including employees, students, labourers, or anyone from outside who is living ordinarily in Jammu and … [+5549 chars]"}]}