{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Influential Karnataka Seer, Charged With Raping Schoolgirls, Arrested","description":"Karnataka Seer Shivamurthy Sharanaru, Charged With Sex Abuse, Arrested","url":"https://www.ndtv.com/india-news/karnataka-seer-shivamurthy-sharanaru-charged-with-sex-abuse-arrested-3307977","urlToImage":"https://c.ndtvimg.com/2022-08/dehk5p3s_karnataka-seer-650_625x300_29_August_22.jpg","publishedAt":"2022-09-01T17:50:00+00:00","content":"Shivamurthy Murugha Sharanaru, the chief of Murugha Math -- one of the key seminaries of Karnataka's politically powerful Lingayat community -- has been arrested after allegations of rape from two sc… [+1513 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Manoj C G","title":"Rahul’s 117 Bharat Jodo Yatris: The usual and not-so-unusual suspects","description":"Whoever showed interest… we interviewed them…. basically asked them whether they can walk 3,500 km… Are they free for five months: Digivijaya.","url":"https://indianexpress.com/article/political-pulse/rahuls-117-bharat-jodo-yatris-the-usual-and-not-so-unusual-suspects-8125777/","urlToImage":"https://images.indianexpress.com/2022/09/Congress-Rahul-Gandhi-Bharat-jodo-yatra.jpg","publishedAt":"2022-09-01T16:29:55+00:00","content":"To walk 3,570 kilometres all the way from Kanyakumari to Kashmir over a period of five months may be an arduous task. But the 56-year-old Congress leader Vijay Kumar Shastri is excited that he would … [+3558 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Aman Sharma","title":"'Earlier The State, Now The Nation': Changing Posters at JD(U) Office Tell The Tale of Nitish’s Ambitions","description":"A day after Kumar in the presence of Telangana chief minister KCR in Patna skirted media questions over him being the PM face of the opposition in 2024, his party put up new posters at its office in the city that seem to take on Prime Minister Modi and make a…","url":"https://www.news18.com/news/politics/earlier-the-state-now-the-nation-changing-posters-at-jdu-office-tell-the-tale-of-nitishs-ambitions-5870803.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-70-165993444116x9.jpg","publishedAt":"2022-09-01T14:54:28+00:00","content":"From Nitish Sabke Hain (Nitish is of all) in 2020, Nyay Ke Saath Vikas, Kanoon Ka Raaj (Justice and development, with law and order) till a few days ago, to now Pradesh Mein Dikha, Desh Mein Dikhega … [+3016 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Abraham Thomas","title":"Not murder where bail is denied, says SC on Teesta plea. Guj govt says it’s worse","description":"The Supreme Court asked if it was standard practice in the Gujarat high court to post a bail petition after 6 weeks. “Give us a case where a lady has been charged with offences like these and notice has been made returnable after 6 weeks,” the bench said | La…","url":"https://www.hindustantimes.com/india-news/not-murder-where-bail-is-denied-says-sc-on-teesta-plea-guj-govt-says-it-s-worse-101662042699877.html","urlToImage":"https://images.hindustantimes.com/img/2022/09/01/1600x900/e4dc2190-2a00-11ed-84e0-35079b96d787_1662042749929.jpg","publishedAt":"2022-09-01T14:31:39+00:00","content":"NEW DELHI: The Supreme Court on Thursday told the Gujarat government to produce the material against social activist Teesta Setalvad to back up the charge of fabricating false evidence in the 2002 Gu… [+6336 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Jharkhand Alliance Leaders Say Leaks From Governor's Office Creating Chaos","description":"Leaders of Jharkhand's ruling JMM-Congress coalition met Governor Ramesh Bais today amid uncertainty over Hemant Soren's continuation as the Chief Minister and alleged attempts by the BJP to \"detstabilise\" the government.","url":"https://www.ndtv.com/india-news/jharkhand-crisis-governor-turns-down-ruling-jmm-leaders-request-to-meet-him-3305968","urlToImage":"https://c.ndtvimg.com/2022-09/qccvr0j4_jharkhand-governor_625x300_01_September_22.jpg","publishedAt":"2022-09-01T13:28:00+00:00","content":"The Governor has said that he is seeking legal opinion, the Congress said.\r\nRanchi: Leaders of Jharkhand's ruling JMM-Congress coalition met Governor Ramesh Bais today amid uncertainty over Hemant So… [+2321 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Actor Shabana Azmi Breaks Down: Bilkis Bano's Rapists' Release \"Shameful\"","description":"Shabana Azmi today broke down as she expressed her shame and horror at the Bilkis Bano case convicts being freed by the Gujarat government last month, 15 years after they were jailed.","url":"https://www.ndtv.com/india-news/actor-shabana-azmi-breaks-down-bilkis-banos-rapists-release-shameful-3307086","urlToImage":"https://c.ndtvimg.com/2022-09/ddhpl91g_shabana-azmi_625x300_01_September_22.jpg","publishedAt":"2022-09-01T13:27:00+00:00","content":"Shabana Azmi said in an interview to NDTV: \"I have no words except that I am deeply ashamed\".\r\nNew Delhi: Shabana Azmi today broke down as she expressed her shame and horror at the Bilkis Bano case c… [+3744 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Manoj Gupta","title":"Exclusive | 'Sinking' Pak Pondering Paradigm Shift in Ties with India, Wants to Restore Trade: Sources","description":"The flood-ravaged nation is desperately looking for relief. Sources also said that a big development on Pakistan-India trade is likely before the SCO heads of state conference on September 15-16 in Uzbekistan as Pakistan PM Shehbaz Sharif may meet-greet with …","url":"https://www.news18.com/news/india/exclusive-sinking-pak-pondering-paradigm-shift-in-ties-with-india-wants-to-restore-trade-sources-5869183.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-13t150529.351-166038334716x9.jpg","publishedAt":"2022-09-01T12:06:00+00:00","content":"The Pakistani establishment is seriously thinking about a paradigm shift in its policy towards India, sources have told CNN-News18.\r\nBattered by devastating floods, the country is forced to strive fo… [+1822 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"No Ganesh Festival At Bengaluru's Eidgah Maidan After Supreme Court Hearing","description":"Karnataka government said allow temple \"at least for next two days\" and \"no permanent structure will be built\"; but waqf board cited 200-year history","url":"https://www.ndtv.com/india-news/ganesh-chaturthi-celebrations-at-bengaluru-idgah-maidan-supreme-court-forms-3-judge-bench-hearing-shortly-3299920","urlToImage":"https://c.ndtvimg.com/2022-08/2qvm25eg_idgah-bengaluru_625x300_30_August_22.jpg","publishedAt":"2022-09-01T10:51:00+00:00","content":"Heavy police deployment at Eidgah Maidan in Bengaluru.\r\nNew Delhi/Bengaluru: Ganesh Chaturthi celebrations at Bengaluru's Eidgah Maidan will not be held, after an order of \"status quo\" by the Supreme… [+3383 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"HT News Desk","title":"AAP 4% up in Gujarat after Manish Sisodia raid, claims Arvind Kejriwal; ‘If he’s arrested…'","description":"Arvind Kejriwal claimed AAP's vote up by 4% in Gujarat since CBI raided Manish Sisodia in the liquor case. If Manish Siodia is arrested, then the percentage will be 6%, the CM said. “...And if he is arrested twice...” Arvind Kejriwal laughed at the assembly. …","url":"https://www.hindustantimes.com/india-news/if-manish-sisodia-gets-arrested-twice-kejriwal-on-gujarat-election-101662018314887.html","urlToImage":"https://images.hindustantimes.com/img/2022/09/01/1600x900/kejriwal_1662018383772_1662018391781_1662018391781.JPG","publishedAt":"2022-09-01T07:49:53+00:00","content":"Delhi chief minister Arvind Kejriwal on Thursday said AAP's support has grown in Gujarat after the CBI raided Manish Sisodia in the 'fake' liquor case. \"There has been a 4% increase in vote share. If… [+2238 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"PTI","title":"Rishi Sunak closes campaign on personal note with parents, wife Akshata","description":"Addressing a teeming concert venue at Wembley in London on Wednesday night, the Indian-origin former Chancellor could have been mistaken for a rockstar amid the loud cheers and screams of Rishi, Rishi.","url":"https://www.moneycontrol.com/news/world/rishi-sunak-closes-campaign-on-personal-note-with-parents-wife-akshata-9114701.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/08/rishi-sunak-temple-ImResizer-770x433.jpg","publishedAt":"2022-09-01T04:09:08+00:00","content":"Rishi Sunak struck a personal note in the final hustings event before the election for a new Conservative Party leader and British Prime Minister concludes, as he thanked his parents and wife Akshata… [+4137 chars]"}]}