{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Convoy Meant For Nitish Kumar's Gaya Visit, Attacked On Way","description":"Bihar chief minister Nitish Kumar's convoy came under attack today while on way to Gaya. The Chief Minister, who is expected to visit Gaya tomorrow, was not in any of the cars, which were stopped and attacked, sources said.","url":"https://www.ndtv.com/india-news/convoy-meant-for-nitish-kumars-gaya-visit-attacked-on-way-3273896","urlToImage":"https://c.ndtvimg.com/2022-08/h576qjn4_convoy-meant-for-nitish-kumar_625x300_21_August_22.jpg","publishedAt":"2022-08-21T16:21:19+00:00","content":"The videos of the attack were widely circulated on the social media.\r\nPatna: Bihar Chief Minister Nitish Kumar's convoy came under attack today while on way to Gaya. The Chief Minister, who is expect… [+1621 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Shishir Gupta","title":"Ousted Pakistan PM Imran Niazi booked under terror act, arrest likely","description":"A case under Anti Terrorism Act section 7 has been registered against Former PM Imran Khan by Islamabad police on the alleged threats that he gave to the IG Police Islamabad and a Female magistrate during a public rally in Islamabad on 20th August. | World Ne…","url":"https://www.hindustantimes.com/world-news/ousted-pakistan-pm-imran-niazi-booked-under-terror-act-arrest-likely-101661096309313.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/21/1600x900/pak_1661097304138_1661097327675_1661097327675.jpg","publishedAt":"2022-08-21T15:56:42+00:00","content":"Former Pakistan prime minister Imran Khan Niazi on Sunday was booked for threatening a judge and two top police officials at a public meeting that took place in Islamabad on Saturday. The Pakistan Te… [+2303 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"PTI","title":"India in advanced stage of talks with US for procuring MQ-9B drones","description":"The MQ-9B drone is a variant of the MQ-9 \"Reaper\" which was used to launch a modified version of the Hellfire missile that eliminated al-Qaeda leader Ayman al-Zawahiri in the heart of Kabul last month. | Latest News India","url":"https://www.hindustantimes.com/india-news/india-in-advanced-stage-of-talks-with-us-for-procuring-mq-9b-drones-101661091889594.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/21/1600x900/drnne_1661095593097_1661095600933_1661095600933.jpg","publishedAt":"2022-08-21T15:29:54+00:00","content":"India is in an \"advanced stage\" of negotiations with the US to procure 30 MQ-9B Predator armed drones for over USD 3 billion to crank up its surveillance apparatus along the frontier with China as we… [+5782 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"The Tribune India","title":"'Self-respect non-negotiable': Anand Sharma quits as Himachal Congress Steering Committee Chairman","description":"Days after veteran Ghulam Nabi Azad declined to accept the role of Jammu and Kashmir Congress Campaign Committee Chairman, senior leader Anand Sharma on Sunday resigned as Chairman of the Himachal Congress Steering Committee, formed on April 26 ahead of state…","url":"https://www.tribuneindia.com/news/nation/former-union-minister-anand-sharma-quits-as-himachal-congress-steering-committee-chairman-423879","urlToImage":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_282620292.jpg","publishedAt":"2022-08-21T14:44:00+00:00","content":"Tribune News Service\r\nAditi Tandon\r\nNew Delhi, August 21\r\nDays after veteran Ghulam Nabi Azad declined to accept the role of Jammu and Kashmir Congress Campaign Committee Chairman, senior leader Anan… [+3664 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Abhishek Dey","title":"Opposition divided on CBI raid on Delhi Deputy CM Sisodia, blame AAP’s ‘eerie silence’ in the past","description":"AAP's silence on central agencies targeting opposition, differences among allies on Sisodia reflects conflict over ambition of leaders wanting to be the face challenging Modi in 2024.","url":"https://theprint.in/politics/opposition-divided-on-cbi-raid-on-delhi-deputy-cm-sisodia-blame-aaps-eerie-silence-in-the-past/1092920/","urlToImage":"https://static.theprint.in/wp-content/uploads/2022/08/Untitled-design-23.jpg","publishedAt":"2022-08-21T14:07:55+00:00","content":"New Delhi: The opposition camp seems to be divided on the issue of the Central Bureau of Investigation (CBI) raiding Aam Aadmi Partys (AAP) senior leader and Delhis Deputy Chief Minister Manish Sisod… [+7140 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Amit Shah Slams KCR At Mega Rally In Telangana","description":"Union minister Amit Shah is likely to meet Chandrababu Naidu, former Chief Minister and the chief of Telugu Desam Party, during his visit to Hyderabad today.  Local media reported that Mr Shah is likely to visit him at Ramoji Film City.","url":"https://www.ndtv.com/india-news/amit-shah-in-hyderabad-to-meet-media-boss-at-ramoji-movie-star-jr-ntr-3273321","urlToImage":"https://c.ndtvimg.com/2022-08/5ebir8gs_amit-shah-hyderabad-_625x300_21_August_22.jpg","publishedAt":"2022-08-21T13:37:00+00:00","content":"Hyderabad: Union minister Amit Shah slammed the K Chandrashekar Rao government in Telangana today, declaring that its \"countdown has begun\". \"We will uproot the KCR government. After the next electio… [+1575 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"On Camera, Man Slaps Woman Toll Booth Employee When Asked To Pay Tax","description":"A man slapped a woman employee of a toll both in Madhya Pradesh on Saturday after she refused to let him go without paying the tax. The man is seen angrily walking towards the employee and then slapping her across the face.","url":"https://www.ndtv.com/india-news/on-camera-man-slaps-woman-toll-booth-employee-when-asked-to-pay-tax-3273414","urlToImage":"https://c.ndtvimg.com/2022-08/ajvad2bs_madhya-pradesh-toll-booth-employee-beaten_625x300_21_August_22.jpg","publishedAt":"2022-08-21T13:12:16+00:00","content":"A case has been lodged but the accused is yet to be arrested.\r\nBhopal: A man slapped a woman employee of a toll both in Madhya Pradesh on Saturday after she refused to let him go without paying the t… [+1984 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"ABP News Bureau","title":"Delhi Police Steps Up Security Ahead Of Farmers' Protest At Jantar Mantar Tomorrow","description":"According to a Delhi Police official, Tikait was stopped at Ghazipur while he was on his way to Jantar Mantar.","url":"https://news.abplive.com/news/india/delhi-police-steps-up-security-ahead-of-farmers-protest-at-jantar-mantar-tomorrow-1549225","urlToImage":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/08/21/2a82823b018772d58e3cfff3ed03a72b1661077787169296_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628","publishedAt":"2022-08-21T10:46:39+00:00","content":"New Delhi: Delhi Police stepped up security, put up cemented barricades and deployed more personnel at the Delhi-Haryana border ahead of the farmers’ call to stage a protest at Jantar Mantar in the n… [+2618 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"PTI","title":"Mahapanchayat held in support of jailed politician Shrikant Tyagi in UP’s Noida","description":"The congregation started around 10 am at the Ramlila ground in Gejha village on the call of locals even as hundreds of community members from parts of western Uttar Pradesh like Ghaziabad, Muzaffarnagar, Bulandshahr, Baghpat and Hapur reached here for the pro…","url":"https://indianexpress.com/article/delhi/mahapanchayat-held-in-support-of-jailed-politician-shrikant-tyagi-tyagi-community-noida-8102916/","urlToImage":"https://images.indianexpress.com/2022/08/tyagi-2.jpg","publishedAt":"2022-08-21T08:06:08+00:00","content":"A major congregation of the Tyagi community started in Uttar Pradesh’s Noida on Sunday in support of jailed politician Shrikant Tyagi who has been booked for assaulting a woman and misusing state gov… [+1934 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"'Ab tak to 5 humne maare hain': Rajasthan BJP leader in soup after 'provocative' video goes viral","description":"Rajasthan BJP leader Gyan Dev Ahuja was booked by the police after a video of him allegedly instigating a crowd to kill Muslims went viral.","url":"https://www.indiatoday.in/india/story/rajasthan-bjp-gyan-dev-ahuja-provocative-video-viral-jnu-muslims-cow-slaughter-1990579-2022-08-21","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/image_2022-08-21_104732939-647x363.png?K0vLmmPnXnHvXVpkJI4PO6PhmdFSOM2I","publishedAt":"2022-08-21T05:22:41+00:00","content":"Senior BJP leader Gyan Dev Ahuja has been booked by the Rajasthan Police under the charge of promoting communal hatred. An FIR was registered against him after a video of him emerged where he is hear… [+2592 chars]"}]}