{"status":"ok","totalResults":9,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"HT Education Desk","title":"CA Foundation Result 2022 LIVE: ICAI Foundation results out at icai.nic.in","description":"CA Foundation Result 2022 Live Updates: ICAI Foundation result have been announced today, August 10, 2022. Follow live updates here.","url":"https://www.hindustantimes.com/education/competitive-exams/ca-foundation-result-2022-live-updates-icai-foundation-result-at-icaiorg-101660038234786.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/10/1600x900/icai-ca-foundation-result_1660105463588_1660105463962_1660105463962.png","publishedAt":"2022-08-10T05:47:04+00:00","content":"CA Foundation Result 2022, ICAI Live Updates: Institute of Chartered Accountants of India will likely release CA Foundation Result 2022 today, August 10, 2022. The result will be announced for Founda… [+6086 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Ankur Sharma","title":"EXCLUSIVE | ‘Not Against Any Community’: Noida Woman Speaks Up About Confronting Shrikant Tyagi","description":"The Noida woman has dismissed insinuations that she is against the Tyagi community and said she stood up for the residents of her society as the ‘self-proclaimed’ politician, Shrikant Tyagi, had created an atmosphere of fear on the premises. It has been alleg…","url":"https://www.news18.com/news/india/exclusive-not-against-any-community-noida-woman-speaks-up-about-confronting-shrikant-tyagi-5722831.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/collage-maker-09-aug-2022-08.58-am-166001590616x9.jpg","publishedAt":"2022-08-10T04:44:33+00:00","content":"I didnt do anything for me, it wasnt my personal matter. Why would I be against any community? W was not even talking to Tyagi, I stood up for the residents, this was the first reaction of the woman … [+4169 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Shishir Gupta","title":"BRI loses steam, no fresh Chinese investment post-Covid pandemic","description":"After Sri Lanka went bankrupt due to economic profligacy on count of white elephant Chinese funded projects, Bangladesh has joined Nepal by saying a big NO to any further loans from China. The two countries are now only interested in grants.  | World News","url":"https://www.hindustantimes.com/world-news/bri-loses-steam-no-fresh-chinese-investment-post-covid-pandemic-101660102248286.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/10/1600x900/Sri_Lankan_airport_1660102558755_1660102559040_1660102559040.png","publishedAt":"2022-08-10T03:41:20+00:00","content":"Nine years after it was launched by President Xi Jinping, the Belt Road Initiative (BRI) appears to have lost steam with virtually no new Chinese investment in third countries post-Covid pandemic.\r\nW… [+3109 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Bengali actor Saibal Bhattacharya attempts suicide at his residence in Kolkata over family dispute; shares video on Facebook | Hindi Movie News - Bollywood - Times of India","description":"Bengali actor Saibal Bhattacharya's recent Facebook video has left his fans shocked. Reportedly, the actor tried to commit suicide by hitting himself with a sharp object and posted the said video on his social media handle, which shows Saibal in a hurt state …","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/bengali-actor-saibal-bhattacharya-attempts-suicide-at-his-residence-in-kolkata-over-family-dispute-shares-video-on-facebook/videoshow/93467733.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/93467733/size-41398/93467733.jpg","publishedAt":"2022-08-10T03:36:06+00:00","content":"Bengali actor Saibal Bhattacharya\r\n's recent Facebook video has left his fans shocked. Reportedly, the actor tried to commit suicide by hitting himself with a sharp object and posted the said video o… [+359 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Nitish Kumar's Oath Today For Record 8th Time: 10 Points","description":"Nitish Kumar will take oath as Chief Minister of Bihar today at 2 pm, after he ditched the BJP on Tuesday and announced a new \"Grand Alliance\" which includes Tejashwi Yadav and other Opposition parties.","url":"https://www.ndtv.com/india-news/nitish-kumars-oath-today-tejashwi-yadav-to-be-deputy-10-facts-3241269","urlToImage":"https://c.ndtvimg.com/2022-08/5n2igaro_nitish-kumar_625x300_10_August_22.jpg","publishedAt":"2022-08-10T01:52:17+00:00","content":"<li>Nitish Kumar will take the oath as Chief Minister -- for the eighth time -- and Tejashwi Yadav will be sworn in as Deputy Chief Minister. No other MLA would be sworn in as minister today, it is l… [+3831 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Mihir Mishra","title":"Explained: Electricity Bill – promise, problems","description":"Electricity (Amendment) Bill, explained: The government wants to give consumers a choice of multiple power suppliers as is the case with mobile and internet services, apart from making provisions for timely and adequate tariff revisions.","url":"https://indianexpress.com/article/explained/electricity-amendment-bill-promise-problems-8081142/","urlToImage":"https://images.indianexpress.com/2022/08/Singh.jpg","publishedAt":"2022-08-09T22:50:44+00:00","content":"The government Monday tabled the Electricity (Amendment) Bill 2022 in the Lok Sabha, soon after which it was referred to the parliamentary standing committee on energy for wider consultation with sta… [+5481 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Aditi Raja","title":"Explained: The PESA Act, and the reason behind parties trying to woo tribals in Gujarat","description":"Speaking in Gujarat, Arvind Kejriwal declared a six-point \"guarantee\" for tribals, including the \"strict implementation\" of the Panchayats (Extension to the Scheduled Areas) Act. What is the PESA Act? Why have there been implementation gaps?","url":"https://indianexpress.com/article/explained/the-pesa-act-and-the-reason-behind-parties-trying-to-woo-tribals-in-gujarat-8081141/","urlToImage":"https://images.indianexpress.com/2022/08/Gujarat.jpg","publishedAt":"2022-08-09T22:49:30+00:00","content":"The PESA Act was enacted in 1996 to provide for the extension of the provisions of Part IX of the Constitution relating to the Panchayats to the Scheduled Areas. Other than Panchayats, Part IX, compr… [+3899 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Aanchal Magazine","title":"Customs to airlines: Give details of foreign travellers for ‘risk analysis’","description":"Airline officials said the move creates a standardised process of passenger data sharing with the Customs department, given that non-standard requests for passenger data could potentially lead to privacy infringements.","url":"https://indianexpress.com/article/business/aviation/customs-to-airlines-give-details-of-foreign-travellers-for-risk-analysis-8081215/","urlToImage":"https://images.indianexpress.com/2022/08/airport-7.jpg","publishedAt":"2022-08-09T22:46:56+00:00","content":"THE CENTRAL Board of Indirect Taxes and Customs (CBIC) has asked airlines to mandatorily share PNR (passenger name record) details of all international passengers with the National Customs Targeting … [+3960 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Vijay Swaroop","title":"‘A parasite’: Bihar BJP leaders fume after Nitish Kumar pole vaults to RJD","description":"Union minister Giriraj Singh dared Nitish Kumar to hold fresh elections and contest independently. “We followed the coalition dharma. I dare him to fight independently. He is a parasite. At times, he sticks to BJP, at times to RJD” | Latest News India","url":"https://www.hindustantimes.com/india-news/nonsense-bihar-bjp-leaders-fume-after-nitish-kumar-pole-vaults-to-rjd-101660060205669.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/09/1600x900/e9e34e02-17f9-11ed-bfe2-b24397176b5f_1660061339996.jpg","publishedAt":"2022-08-09T15:50:05+00:00","content":"PATNA: Leaders of the Bharatiya Janata Party (BJP) in Bihar, angry with Bihar chief minister Nitish Kumar for teaming up with the Rashtriya Janata Dal (RJD), on Tuesday accused the Kumar-led Janata D… [+3137 chars]"}]}