{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express Web Desk","title":"Sri Lanka Crisis Live Updates: Protesters set PM Ranil’s house on fire; President Gotabaya Rajapaksa to resign on July 13","description":"Sri Lanka Crisis Live Updates: Thousands of protesters in Sri Lanka's commercial capital Colombo broke through police barricades and stormed President Gotabaya Rajapaksa’s official residence in one of the largest anti-government marches in the crisis-hit coun…","url":"https://indianexpress.com/article/world/sri-lanka-protests-live-updates-president-gotabaya-rajapaksa-8018936/","urlToImage":"https://images.indianexpress.com/2022/07/sri-lanka-ranil-fire1.jpg","publishedAt":"2022-07-09T17:23:55+00:00","content":"Students shout anti-government slogans during a protest march in Colombo on Friday. (AP)\r\nThe island of 22 million people is struggling under a severe foreign exchange shortage that has limited essen… [+1541 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"President Volodymyr Zelenskyy sacks Ukraine's envoys to India, 4 other countries","description":"Ukrainian President Volodymyr Zelenskyy has sacked Ukraine's envoy to India and 4 other countries.","url":"https://www.indiatoday.in/world/story/president-zelenskyy-sacks-ukraine-s-envoy-to-india-4-other-countries-1973839-2022-07-09","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/ukr_1200x768-647x363.jpeg?66GFx0UAATpQ_i6R16UJNtAn4Akaj4Uu","publishedAt":"2022-07-09T17:10:02+00:00","content":"Ukrainian President Volodymyr Zelenskyy dismissed Kyiv's ambassador to Germany on Saturday as well as several other top foreign envoys, the presidential website said.\r\nIn a decree that gave no reason… [+830 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Exclusive: How A Canada-Based Gangster Orchestrated Sidhu Moose Wala's Killing","description":"A day after Moose Wala was murdered, Goldy Brar had admitted in a Facebook post that he planned it to avenge another gangster. The police had also initially called it the outcome of an inter-gang rivalry, but the family has strongly denied it.","url":"https://www.ndtv.com/india-news/sidhu-moose-walas-killing-how-canada-based-gangster-goldy-brar-orchestrated-the-murder-3143550","urlToImage":"https://c.ndtvimg.com/2022-05/pmi8l8ko_sidhu-moose-wala-insta-650_650x400_30_May_22.jpg","publishedAt":"2022-07-09T17:06:01+00:00","content":"Popular Punjabi singer Sidhu Moose Wala was shot dead on May 29.\r\nNew Delhi: 40 days after the killing of Punjabi singer Sidhu Moose Wala, the Special Cell of Delhi Police, based on its own investiga… [+2335 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Abhimanyu Mathur","title":"YouTuber Gaurav Taneja arrested by Noida police, trends on Twitter","description":"Noida police arrested YouTuber Gaurav Taneja for organising a birthday party at Noida's metro station. He started trending on Twitter after that.","url":"https://www.hindustantimes.com/entertainment/others/youtuber-gaurav-taneja-arrested-by-noida-police-trends-on-twitter-101657384542285.html","urlToImage":"https://images.hindustantimes.com/img/2022/07/09/1600x900/YouTuber_Gaurav_Taneja_1657385061225_1657385067784.jpg","publishedAt":"2022-07-09T16:51:40+00:00","content":"YouTuber-pilot Gaurav Taneja was arrested by the Noida police on Saturday for organising his birthday party at Sector 51 Metro station of the Aqua Line in Noida, Uttar Pradesh. There is, however, no … [+2248 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"At Big 3-Day Meeting, RSS's Message For Muslims On Udaipur Killing","description":"A big three-day meeting of Prant Pracharaks, or local campaigners, concluded today in Rajasthan's Jhunjhunu.","url":"https://www.ndtv.com/india-news/at-big-3-day-meeting-rsss-message-for-muslims-on-udaipur-killing-3143017","urlToImage":"https://c.ndtvimg.com/2021-07/gnjpfqbs_rss-chief-mohan-bhagwat-pti-photo_625x300_21_July_21.jpg","publishedAt":"2022-07-09T16:18:00+00:00","content":"The three-day 'Akhil Bharatiya Prant Pracharak' meeting cncluded today. (file)\r\nNew Delhi: The Rashtriya Swayamsevak Sangh (RSS), the ideological mentor of the ruling BJP, today condemned the horrifi… [+1817 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Liz Mathew","title":"Shinde, Fadnavis hold talks on Maharashtra govt with Amit Shah, call on PM Modi in Delhi","description":"Terming his move to rebel against Thackeray as a “revolution”, CM Shinde told reporters, “The existence of our MLAs came under threat under the MVA government... It is only the natural alliance of the BJP and the Shiv Sena that can take Maharashtra ahead.”","url":"https://indianexpress.com/article/india/shinde-fadnavis-hold-talks-on-maharashtra-government-with-amit-shah-8019383/","urlToImage":"https://images.indianexpress.com/2022/07/Modi-1-2.jpg","publishedAt":"2022-07-09T15:51:30+00:00","content":"With Chief Minister Eknath Shinde and Deputy Chief Minister Devendra Fadnavis holding marathon discussions, both the BJP and the Shiv Sena rebels appear to have finalised the size and members of thei… [+3172 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"PTI","title":"DHFL scam: Money trail takes CBI to underworld's doors | Mint","description":"The CBI acted on a complaint from the Union Bank of India (UBI), the leader of a 17-member lender consortium that had extended credit facilities to DHFL to the tune of  ₹42,871 crore between 2010 and 2018","url":"https://www.livemint.com/companies/news/dhfl-scam-money-trail-takes-cbi-to-underworld-s-doors-11657372334903.html","urlToImage":"https://images.livemint.com/img/2022/07/09/600x338/ab4206d0-b8a9-11eb-831c-f568451bcdfb_1621612629315_1657375164236.jpg","publishedAt":"2022-07-09T14:03:01+00:00","content":"NEW DELHI : A CBI probe into the country's biggest banking fraud scam allegedly committed by DHFL is looking into the links of certain suspects with the underworld, especially Pakistan-based gangster… [+2682 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Organisation Shinzo Abe Linked To Caused Mother's Bankruptcy: Shooter To Cops","description":"The man who killed Shinzo Abe believed the former Japanese leader was linked to a religious group he blamed for his mother's financial ruin and spent months planning the attack with a homemade gun, police told local media on Saturday.","url":"https://www.ndtv.com/world-news/abe-killer-wielded-homemade-gun-grudge-over-mothers-bankruptcy-police-say-3142836","urlToImage":"https://c.ndtvimg.com/2022-07/tvtre3u8_shinzo-abe-shooter-650_650x400_08_July_22.jpg","publishedAt":"2022-07-09T13:41:00+00:00","content":"Media have not named the religious group that Tetsuya Yamagami was reportedly upset with. (File)\r\nJapan: The man who killed Shinzo Abe believed the former Japanese leader was linked to a religious gr… [+4315 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Hindustantimes","title":"Amarnath flash floods not because of cloudburst? Here's what IMD said","description":"IMD director general Mrutyunjay Mohapatra said that flash floods near Amarnath cave in Jammu and Kashmir could have been triggered due to rainfall in the higher reaches of the mountains. | Latest News India","url":"https://www.hindustantimes.com/india-news/amarnath-flash-floods-not-because-of-cloudburst-here-s-what-imd-says-101657357692123.html","urlToImage":"https://images.hindustantimes.com/img/2022/07/09/1600x900/amarnath_cloudburst_imd_localised_rain_event_news_1657361920108_1657361920228.jpg","publishedAt":"2022-07-09T10:31:39+00:00","content":"In one of the deadliest monsoon-related incidents this year, at least 16 people lost their lives and several were injured in a cloudburst near the Amarnath cave in Jammu and Kashmir on Friday. Howeve… [+2381 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Pati, patni aur passport: How Mumbai man’s ploy to hide Maldives trip from wife landed him in jail","description":"A man in Mumbai ripped out the pages from his passport to keep his Maldives trip a secret from his wife, but got arrested when immigration authorities noticed the missing pages.","url":"https://www.indiatoday.in/cities/mumbai/story/mumbai-man-maldives-trip-secret-from-wife-passport-pages-ripped-arrested-1973706-2022-07-09","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/passport-647-x-404_12091511510-647x363.jpeg?6eN55EF4Ts7Ippd9DtaezpFHrp7mhEPM","publishedAt":"2022-07-09T08:33:37+00:00","content":"A man in Mumbai took a trip to the Maldives, frolicked with his lover in the island paradise, then ripped out the pages from his passport to keep his wife in the dark about the tryst. Little did he k… [+1563 chars]"}]}