{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Education Desk","title":"CUET PG Admit Card 2022 LIVE Updates: Hall tickets released at cuet.nta.nic.in","description":"CUET PG Admit Card 2022 Updates: Download CUET UG Hall Ticket @www.cuet.nta.nic.in. Registered candidates can download their admit cards from the official website — cuet.nta.nic.in — by logging in through their registered credentials.","url":"https://indianexpress.com/article/education/cuet-pg-admit-card-2022-download-link-live-updates-hall-tickets-released-for-postgraduate-students-exams-to-begin-on-september-1-cuet-nta-nic-in-8105045/","urlToImage":"https://images.indianexpress.com/2022/08/CUET-PG-2022-Admit-Card.jpg","publishedAt":"2022-08-29T06:04:20+00:00","content":"This year, the CUET PG 2022 exams are scheduled to be conducted between September 1 and 11. “We want to ensure that students do not face any problems in reaching their exam centre, so according to th… [+834 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express Web Desk","title":"Hijab row: Supreme Court issues notice to Karnataka govt over plea challenging HC’s order","description":"Several petitions have been filed in the Supreme Court against the Karnataka High Court verdict holding that wearing of hijab is not a part of the essential religious practice.","url":"https://indianexpress.com/article/india/hijab-ban-order-supreme-court-notice-karnataka-govt-8118208/","urlToImage":"https://images.indianexpress.com/2022/08/Hijab-5-2.jpg","publishedAt":"2022-08-29T05:50:10+00:00","content":"The Supreme Court on Monday issued notice to the Karnataka government over a plea challenging the High Court’s order upholding a ban on hijab in educational institutions of the state."},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Watch: Nitin Gadkari Was Once Told He Should Join Congress. He Said This","description":"Union Minister Nitin Gadkari has revealed that he was once advised to join the Congress, but that he replied he would \"rather jump into a well\".","url":"https://www.ndtv.com/india-news/union-minister-nitin-gadkari-news-union-minister-nitin-gadkari-on-congress-watch-nitin-gadkari-was-once-told-he-should-join-congress-he-said-this-3295542","urlToImage":"https://c.ndtvimg.com/2022-08/a0hk9bl_union-minister-nitin-gadkari-_625x300_29_August_22.jpg","publishedAt":"2022-08-29T05:06:36+00:00","content":"Nitin Gadkari News: Union Minister Nitin Gadkari revealed that he was once advised to join Congress.\r\nNew Delhi: Union Minister Nitin Gadkari has revealed that he was once advised to join the Congres… [+1978 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"On Karnataka Seer Charged With Sex Abuse, Chief Minister Said This","description":"Karnataka Chief Minister Basavaraj Bommai on Sunday said investigation is on in a case involving the chief pontiff of a prominent mutt based in Chitradurga, who has been charged under the POCSO Act, and the truth will come out from the probe.","url":"https://www.ndtv.com/india-news/on-karnataka-seer-charged-for-sex-abuse-chief-minister-basavaraj-bommai-says-this-3293723","urlToImage":"https://c.ndtvimg.com/2021-09/mbojk3gc_basavaraj-bommai_625x300_15_September_21.jpg","publishedAt":"2022-08-29T03:48:00+00:00","content":"Karnataka seer charged for sex abuse: B Bommai says the truth will come out from the probe. (File)\r\nBengaluru: Karnataka Chief Minister Basavaraj Bommai on Sunday said investigation is on in a case i… [+2033 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Ishadrita Lahiri","title":"MBAs, ex-SPG personnel, ex-Leftists, bankers — Meet Rahul Gandhi’s Congress ‘coterie’","description":"Congress' 'coterie of inexperienced sycophants', that former party leader Ghulam Nabi Azad mentioned in his exit letter, includes professionals from largely non-political backgrounds.","url":"https://theprint.in/india/mbas-ex-spg-personnel-ex-leftists-bankers-meet-rahul-gandhis-congress-coterie/1105015/","urlToImage":"https://static.theprint.in/wp-content/uploads/2022/08/Rahul.jpg","publishedAt":"2022-08-29T03:03:45+00:00","content":"New Delhi: Senior Congress leader Ghulam Nabi Azad, who quit the party Friday, blamed what he called a coterie of inexperienced sycophants, referring to those close to the Gandhis. Azad alleged that … [+7533 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Supertech Says It Lost Rs 500 Crore In Demolition Of Noida Twin Towers","description":"Realty firm Supertech Ltd has incurred a loss of about Rs 500 crore, including construction and interest costs, because of the demolition of its twin towers in Noida, the company's chairman RK Arora said on Sunday.","url":"https://www.ndtv.com/india-news/supertech-says-it-lost-rs-500-crore-in-demolition-of-noida-twin-towers-3294079","urlToImage":"https://c.ndtvimg.com/2022-08/pq1h8idg_noida-twin-towers-supertech-pti_625x300_28_August_22.jpg","publishedAt":"2022-08-29T02:32:00+00:00","content":"The nearly 100-metre-tall Supertech twin towers were demolished today.\r\nNoida: Realty firm Supertech Ltd has incurred a loss of about Rs 500 crore, including construction and interest costs, because … [+2582 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"CWC approves Congress president poll schedule, clamour for Rahul Gandhi as party chief grows","description":"Congress Working Committee (CWC) meeting was held on Sunday afternoon to discuss and approve the final schedule for the election of Congress president. Party leaders voiced their support for Rahul Gandhi as the next chief.","url":"https://www.indiatoday.in/india/story/congress-working-committee-meeting-election-party-president-rahul-gandhi-sonia-gandhi-1993730-2022-08-29","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/congress_0-647x363.png?imcYzcc5We3eNxSvQtf0zse8FsysxUoZ","publishedAt":"2022-08-29T02:29:41+00:00","content":"A crucial Congress Working Committee (CWC) meeting took place on August 28th evening wherein the schedule for the election of the next Congress President got the Green signal.\r\nThe stamp on the sched… [+6592 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Arvind Kejriwal On Majority Test Today: \"To Prove Op Lotus Failed\"","description":"Delhi Chief Minister Arvind Kejriwal is taking a confidence vote in the house today to prove all Aam Aadmi Party (AAP) MLAs are with him despite what he claims are the BJP's attempts to break his party and dislodge his government.","url":"https://www.ndtv.com/india-news/aaps-trust-vote-bjp-arvind-kejriwal-to-take-majority-test-today-to-prove-all-aap-mlas-with-him-3295276","urlToImage":"https://c.ndtvimg.com/2022-08/vjiiufco_arvind-kejriwal-pti_625x300_27_August_22.jpg","publishedAt":"2022-08-29T02:23:05+00:00","content":"<li>The day started with a noisy showdown as BJP legislators raised slogans against the ruling AAP and demanded discussions on other issues. Just before the trust vote, Deputy Assembly Speaker BJP ML… [+2727 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express News Service","title":"Anurag Thakur at Idea Exchange: Despite corruption charges, AAP is not willing to answer questions. They’re drunk on power","description":"Former president of the Board of Control for Cricket in India, Thakur is a voice of the government and has been at the forefront of the BJP’s political attack on Aam Aadmi Party on the excise policy, which has now been withdrawn.","url":"https://indianexpress.com/article/idea-exchange/anurag-thakur-idea-exchange-aap-unwilling-to-answer-questions-8117636/","urlToImage":"https://images.indianexpress.com/2022/08/thankur.jpg","publishedAt":"2022-08-28T23:08:43+00:00","content":"Union Minister for Information and Broadcasting, Youth Affairs and Sports, Anurag Thakur, on AAP and its contentious excise policy, consolidation of corporate power in the media, and dynasty politics… [+16514 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Harikishan Sharma","title":"Mann Ki Baat: PM Modi urges people to join fight against malnutrition","description":"In the 92nd episode of his monthly radio programme ‘Mann Ki Baat’, the Prime Minister said, “The month of September is dedicated to festivals as well as a big campaign related to nutrition. We celebrate the Poshan Maah every year from the 1st to the 30th of S…","url":"https://indianexpress.com/article/india/narendra-modi-mann-ki-baat-live-updates-8116140/","urlToImage":"https://images.indianexpress.com/2022/08/modi-19-1.jpg","publishedAt":"2022-08-28T03:45:59+00:00","content":"PRIME MINISTER Narendra Modi on Sunday urged people to take part in the efforts to eradicate malnutrition in September, which is observed as a Poshan Maah every year.In the 92nd episode of his monthl… [+2792 chars]"}]}