{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":"Michael D. Shear, Jim Tankersley, Zolan Kanno-Youngs","title":"Biden Gave In to Pressure on Student Debt Relief After Months of Doubt","description":"At the White House and aboard Air Force One, advocates of debt cancellation made a sustained push to win over the president, who feared the plan would be seen as a giveaway to the privileged.","url":"https://www.nytimes.com/2022/08/26/us/politics/biden-student-loans.html","urlToImage":"https://static01.nyt.com/images/2022/08/26/us/politics/26dc-biden-loans1/26dc-biden-loans1-facebookJumbo.jpg","publishedAt":"2022-08-27T16:53:00+00:00","content":"Some think its too much, Mr. Biden said when he announced his decision, noting the outrage from Republicans and some Democrats. Some think its too little. But I believe my plan is responsible and fai… [+3655 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Adam Shaw","title":"Border Patrol rescue 4-month-old, 18-month-old abandoned by smugglers in desert: 'This is cruelty'","description":"Border Patrol agents rescued two children who had been abandoned in the Sonoran Desert in Arizona, with a four-month-old found unresponsive by the agents.","url":"https://www.foxnews.com/politics/border-patrol-rescue-4-month-old-18-month-old-abandoned-smugglers-desert-cruelty","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2022/08/desert3.jpg","publishedAt":"2022-08-27T15:59:38+00:00","content":"Border Patrol agents on Thursday rescued a four-month-old and 18-month-old who had been abandoned in the sweltering heat of the Arizona desert an incident that officials used to highlight the cruelty… [+2882 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Patricia Mazzei","title":"As DeSantis Campaigns on Education, Crist Picks Teacher as Running Mate","description":"Karla Hernández-Mats, head of the largest teachers union in the region, criticized the Republican governor for attacking educators. “This is what dictators do,” she said.","url":"https://www.nytimes.com/2022/08/27/us/charlie-crist-karla-hernandez-mats-florida-gov.html","urlToImage":"https://static01.nyt.com/images/2022/08/27/multimedia/27CRIST-01/27CRIST-01-facebookJumbo.jpg","publishedAt":"2022-08-27T15:52:59+00:00","content":"It confirms how out of touch Crist is with Florida families, the party said in a statement on Friday.\r\nMr. Crist dismissed the notion that voters would agree with the criticism that sharing the ticke… [+887 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Oren Liebermann, CNN","title":"How Ukraine is using resistance warfare developed by the US to fight back against Russia","description":"As the war in Ukraine has passed the six-month mark, US and European officials say Ukraine has successfully used a method of resistance warfare developed by US special operations forces to fight back against Russia and bog down its vastly superior military.","url":"https://www.cnn.com/2022/08/27/politics/russia-ukraine-resistance-warfare/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220826110936-03-resistance-operating-concept-liebermann-super-tease.jpg","publishedAt":"2022-08-27T14:36:00+00:00","content":"(CNN)As the war in Ukraine has passed the six-month mark, US and European officials say Ukraine has successfully used a method of resistance warfare developed by US special operations forces to fight… [+9174 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Drew Harwell","title":"Truth Social faces financial peril as worry about Trump’s future grows","description":"Former president Donald Trump’s company Truth Social is facing financial doubts, puny traffic and fears of further trouble if his popularity falls.","url":"https://www.washingtonpost.com/technology/2022/08/27/trump-truth-social-mar-a-lago-fbi/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NQFGQ7BGDQI63JZPDZYUSBZPXQ.jpg&w=1440","publishedAt":"2022-08-27T13:00:00+00:00","content":"Comment on this story\r\nFormer president Donald Trumps Truth Social website is facing financial challenges as its traffic remains puny and the company that is scheduled to acquire it expresses fear th… [+6003 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Tassanee Vejpongsa","title":"Sick dolphin calf improves with tube-fed milk, helping hands","description":"RAYONG, Thailand (AP) — The Irrawaddy dolphin calf — sick and too weak to swim — was drowning in a tidal pool on Thailand’s shore when fishermen found him.  The fishermen quickly alerted marine conservationists, who advised them how to provide emergency care …","url":"https://apnews.com/article/thailand-dolphin-calf-rescue-b6562a44bca5d621b429395d5902f1dc","urlToImage":"https://storage.googleapis.com/afs-prod/media/fd7f9fcba5434a55afececd2fa0dfa3e/3000.jpeg","publishedAt":"2022-08-27T11:50:21+00:00","content":"RAYONG, Thailand (AP) The Irrawaddy dolphin calf sick and too weak to swim was drowning in a tidal pool on Thailands shore when fishermen found him. \r\nThe fishermen quickly alerted marine conservatio… [+3796 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Danny Hakim, Neil Vigdor, Richard Fausset","title":"Election Data Breach Attracts Georgia Investigators","description":"The district attorney in Atlanta is seeking to build a broad conspiracy case that encompasses multifaceted efforts by Trump allies to disrupt and overturn the 2020 election.","url":"https://www.nytimes.com/2022/08/27/us/georgia-trump-coffee-county-election.html","urlToImage":"https://static01.nyt.com/images/2022/08/26/multimedia/26COFFEE-COUNTY-1/26COFFEE-COUNTY-1-facebookJumbo.jpg","publishedAt":"2022-08-27T07:00:15+00:00","content":"Ms. Williss office cited the Coffee County data breach in its filing on Thursday seeking Ms. Powells testimony, which was the first time the matter had surfaced in connection with her investigation. … [+1704 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Associated Press","title":"Father, son clinging to cooler rescued from Boston Harbor","description":"The men said their boat’s 28-foot engine got tangled in lobster lines and failed. The current pushed the boat onto the rocks and punctured the hull, police said.","url":"https://nypost.com/2022/08/27/boston-police-rescue-father-son-clinging-to-cooler-from-boston-harbor/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2022/08/newspress-collage-23635794-1661575670261.jpg?quality=75&strip=all&1661561560&w=1024","publishedAt":"2022-08-27T05:08:00+00:00","content":"BOSTON In the nick of time, the Boston Police Departments harbor patrol unit rescued a father and son who were desperately clinging to a drinks cooler at the outermost edge of Boston Harbor after the… [+1526 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Tierney Sneed and Marshall Cohen, CNN","title":"Takeaways from the Mar-a-Lago search warrant affidavit","description":"The release of a redacted affidavit that the Justice Department used to obtain a search warrant for former President Donald Trump's Mar-a-Lago home shed new light on the federal investigation into the handling of documents from his White House.","url":"https://www.cnn.com/2022/08/26/politics/takeaways-fbi-affidavit/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210321131219-donald-trump-social-media-network-super-tease.jpg","publishedAt":"2022-08-27T01:18:00+00:00","content":"(CNN)The release of a redacted affidavit that the Justice Department used to obtain a search warrant for former President Donald Trump's Mar-a-Lago home shed new light on the federal investigation in… [+10268 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Alta Spells, CNN","title":"Ron DeSantis suspends 4 Broward County School Board members after a grand jury investigation prompted by Parkland massacre","description":"Florida Gov. Ron DeSantis on Friday suspended four Broward County School Board members based on recommendations from a statewide grand jury looking into events surrounding the deadly shooting at Marjory Stoneman Douglas High School four years ago.","url":"https://www.cnn.com/2022/08/26/us/florida-desantis-broward-school-board-suspensions/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220819215720-02-ron-desantis-pittsburgh-rally-0819-super-tease.jpg","publishedAt":"2022-08-26T23:20:00+00:00","content":"(CNN)Florida Gov. Ron DeSantis on Friday suspended four Broward County School Board members based on recommendations from a statewide grand jury looking into events surrounding the deadly shooting at… [+3119 chars]"}]}