{"status":"ok","totalResults":9,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Trump pressed, threatened Pence to overturn election, panel hears","description":"Former President Donald Trump pressured his vice president, Mike Pence, to overturn his 2020 election defeat despite being told repeatedly it was illegal to do so, aides to Pence told the congressional committee investigating the Jan. 6, 2021, attack on the U…","url":"https://www.reuters.com/world/us/us-capitol-jan-6-panel-turns-attention-pence-thursdays-hearing-2022-06-16/","urlToImage":"https://www.reuters.com/resizer/Zf_PxhWkTa1x33lwreHBbqWYIbs=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/HRDIDQP7QNL7XMJTHPMELDQ6RM.jpg","publishedAt":"2022-06-17T00:26:00+00:00","content":"WASHINGTON, June 16 (Reuters) - Former President Donald Trump pressured his vice president, Mike Pence, to overturn his 2020 election defeat despite being told repeatedly it was illegal to do so, aid… [+4916 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Paul Best","title":"Justice Department ups pressure on Jan. 6 committee to release transcripts of witness interviews","description":"Federal prosecutors requested transcripts of witness interviews from the House Jan. 6 Select Committee as the panel holds hearings on the Capitol riot.","url":"https://www.foxnews.com/politics/justice-department-ups-pressure-jan-6-committee-release-witness-interviews","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2022/06/jan-6-committee-2.jpg","publishedAt":"2022-06-16T22:41:10+00:00","content":"The Justice Department renewed its request for transcripts of witness interviews from the House Jan. 6 Select Committee this week, arguing that the committee's \"failure\" to release the transcripts is… [+2675 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Fredreka Schouten, CNN","title":"New Mexico county official convicted of January 6 trespassing refuses to certify 2022 primary results based on debunked conspiracy","description":"A New Mexico county commissioner, awaiting sentencing for his January 6 conviction, said Thursday that he plans to defy a state Supreme Court order and will not vote to certify the results of a recent primary election in a flareup over vote-tallying machines …","url":"https://www.cnn.com/2022/06/16/politics/new-mexico-otero-county-election/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616125304-couy-griffin-file-super-tease.jpg","publishedAt":"2022-06-16T22:35:00+00:00","content":"(CNN)A New Mexico county commissioner, awaiting sentencing for his January 6 conviction, said Thursday that he plans to defy a state Supreme Court order and will not vote to certify the results of a … [+4320 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Benjamin Brown and Jorge Engels","title":"Alleged Russian spy attempted to infiltrate the International Criminal Court as an intern, say Dutch authorities","description":"Dutch authorities say they have thwarted an attempt by a Russian spy to gain access to the International Criminal Court (ICC) by posing as an intern.","url":"https://www.cnn.com/2022/06/16/europe/dutch-catch-russian-spy-icc-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616145332-international-criminal-court-hague-file-2021-super-tease.jpg","publishedAt":"2022-06-16T21:32:00+00:00","content":"Dutch authorities say they have thwarted an attempt by a Russian spy to gain access to the International Criminal Court (ICC) by posing as an intern."},{"source":{"id":"google-news","name":"Google News"},"author":"Kara Scannell","title":"Michael Avenatti pleads guilty to stealing millions of dollars from clients","description":"Disgraced attorney Michael Avenatti pleaded guilty Thursday to embezzling millions of dollars from four of his clients, taking another step closer toward resolving a flurry of federal charges against him.","url":"https://www.cnn.com/2022/06/16/politics/michael-avenatti-guilty-plea/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220612215954-01-michael-avenatti-file-super-tease.jpg","publishedAt":"2022-06-16T20:49:00+00:00","content":"(CNN)Disgraced attorney Michael Avenatti pleaded guilty Thursday to embezzling millions of dollars from four of his clients, taking another step closer toward resolving a flurry of federal charges ag… [+2756 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Bradford Betz","title":"ExxonMobil hits back after Biden threatens energy producers","description":"ExxonMobil fired back at President Joe Biden after he sent a letter to oil companies threatening to use \"emergency powers\" if they don't boost supply.","url":"https://www.foxbusiness.com/politics/exxonmobil-statement-biden-threatens-energy-producers","urlToImage":"https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2022/06/0/0/ExxonMobil.jpg?ve=1&tl=1","publishedAt":"2022-06-16T20:33:25+00:00","content":"ExxonMobil fired back at President Biden after he threatened them with \"emergency powers\" if they don’t boost supply to temper surging gas prices. \r\nIn a statement released Wednesday from the company… [+3540 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Melissa Korn","title":"Final Parent in College-Admissions Cheating Case Found Not Guilty","description":"Amin Khoury, a Florida investor, was found not guilty of bribing a Georgetown University tennis coach to get his daughter admitted to the prestigious school, delivering prosecutors a rare defeat in the sprawling Varsity Blues college-admissions cheating case.","url":"https://www.wsj.com/articles/final-parent-in-college-admissions-cheating-case-found-not-guilty-11655411562","urlToImage":"https://images.wsj.net/im-565987/social","publishedAt":"2022-06-16T20:32:00+00:00","content":"A federal jury found a Florida investor not guilty of bribing a Georgetown University tennis coach to get his daughter admitted to the prestigious school, delivering prosecutors a rare defeat in the … [+361 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Judson Jones and Paul Murphy, CNN","title":"New satellite imagery shows flooding in Yellowstone altered the river's course","description":"A vital bridge and road along the Yellowstone River and its tributary, the Gardner River, were destroyed by recent historic flooding. New satellite images from Maxar Technologies show the extent of the damage the torrent of water wrought.","url":"https://www.cnn.com/2022/06/16/weather/yellowstone-flood-satellite-before-and-after/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220616115347-yellowstone-flood-before-and-after-card-image-super-tease.jpg","publishedAt":"2022-06-16T17:25:00+00:00","content":"(CNN)A vital bridge and road along the Yellowstone River and its tributary, the Gardner River, were destroyed by recent historic flooding. New satellite images from Maxar Technologies show the extent… [+1462 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Lee Brown, Joshua Rhett Miller","title":"Woke Los Angeles DA George Gascon blamed for shooting deaths of two cops","description":"The woke prosecutor — already facing recall efforts — was blamed for cop-killer Justin Flores being free when he gunned down two officers.","url":"https://nypost.com/2022/06/16/woke-la-da-george-gascon-blamed-for-shooting-deaths-of-two-cops/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2022/06/gascon-california-officers-killed-comp-1.jpg?quality=75&strip=all&w=1024","publishedAt":"2022-06-16T12:37:00+00:00","content":"Progressive Los Angeles District Attorney George Gascon is facing mounting efforts to oust him amid outrage that his reckless policies left a violent gangbanger free to gun down two cops.\r\nThe woke p… [+4836 chars]"}]}