{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":"Anton Troianovski, Ivan Nechepurenko, Jeffrey Gettleman","title":"Russia Opens Murder Investigation After Blast Kills Daughter of Putin Ally","description":"Daria Dugina was the daughter of an ultranationalist who has urged the Kremlin to escalate its assault on Ukraine. The rare attack on a member of the pro-Kremlin elite could upend President Putin’s efforts to maintain a sense of normalcy.","url":"https://www.nytimes.com/live/2022/08/21/world/ukraine-russia-news-war","urlToImage":"https://static01.nyt.com/images/2022/08/21/world/21ukraine-briefing-promo-430pm/merlin_211745736_b49294c9-7b7e-4e56-bc4c-887aef8d2ad9-facebookJumbo.jpg","publishedAt":"2022-08-22T01:01:57+00:00","content":"KYIV, Ukraine As Russia constructs cages in the home of the Mariupol Chamber Philharmonic and local proxy leaders suggest that captured Ukrainian soldiers could soon be put on trial with verdicts tha… [+3260 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Heather Hollingsworth","title":"Kansas recount confirms results in favor of abortion rights","description":"OLATHE, Kan. (AP) — A decisive statewide vote  in favor of abortion rights in traditionally conservative Kansas was confirmed with a partial hand recount, with fewer than 100 votes changing after the last county reported results Sunday.","url":"https://apnews.com/article/abortion-voting-rights-health-election-recounts-elections-e874f56806a9d63b473b24580ad7ea0c","urlToImage":"https://storage.googleapis.com/afs-prod/media/7347a72e26c74a0d8252c71980f77cb6/3000.jpeg","publishedAt":"2022-08-22T01:01:16+00:00","content":"OLATHE, Kan. (AP) A decisive statewide vote in favor of abortion rights in traditionally conservative Kansas was confirmed with a partial hand recount, with fewer than 100 votes changing after the la… [+4634 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Associated Press","title":"Massachusetts student receives uniform violation for hijab","description":"A Massachusetts charter school where an eighth grade student was written up for a uniform infraction for wearing a hijab says it understands it’s “handling of the situation came across as insensitive.”","url":"https://www.washingtonpost.com/national/massachusetts-student-receives-uniform-violation-for-hijab/2022/08/21/85f18f8a-2177-11ed-a72f-1e7149072fbc_story.html","urlToImage":"https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png","publishedAt":"2022-08-22T00:50:00+00:00","content":"Comment on this story\r\nMALDEN, Mass. A Massachusetts charter school where an eighth grade student was written up for a uniform infraction for wearing a hijab says it understands its handling of the s… [+2605 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Hannah Knowles","title":"2024 meets 2022: Trump, Pence, others ramp up for allies in midterms","description":"All across the country, potential GOP candidates for president in 2024 are fanning out and stepping up their involvement in the midterms, boosting Republican candidates as they pitch themselves.","url":"https://www.washingtonpost.com/elections/2022/08/21/trump-pence-desantis-midterms/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6WEJWQBAJMI63HHGNASTXUYYMQ.jpg&w=1440","publishedAt":"2022-08-21T23:57:00+00:00","content":"Comment on this story\r\nDES MOINES Mike Pence smiled through rain and hail at the Iowa State Fair as he campaigned for a traditional conservative senator on the ballot this fall and teased his own pot… [+14227 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Kimberly Leonard","title":"DeSantis pores into school board races to transform them in his image","description":"The governor is working to reshape school boards that will support his policies and oppose \"critical race theory,\" mask mandates, and COVID lockdowns.","url":"https://www.businessinsider.com/desantis-pores-into-school-board-races-transform-in-his-image-2022-8","urlToImage":"https://i.insider.com/6302639bc2794d00197ee9ca?width=1200&format=jpeg","publishedAt":"2022-08-21T23:38:05+00:00","content":"DORAL, Florida Republican Gov. Ron DeSantis is working to line up a slew of loyalists on school boards across Florida as he seeks a second term in the nation's third-largest state. \r\n\"We need help at… [+7755 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Andy Rose, CNN","title":"3 dead, 2 seriously injured in vehicle crash involving Indiana State University football players","description":"Three Indiana State University students died and two were seriously injured after their vehicle ran into a tree in western Indiana early Sunday morning, according to the school and local law enforcement.","url":"https://www.cnn.com/2022/08/21/us/vehicle-crash-indiana-state-university/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220821161623-indiana-state-university-football-crash-super-tease.jpg","publishedAt":"2022-08-21T21:23:00+00:00","content":"(CNN)Three Indiana State University students died and two were seriously injured after their vehicle ran into a tree in western Indiana early Sunday morning, according to the school and local law enf… [+985 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Amy B Wang, Tom Hamburger","title":"Sen. Graham gets temporary reprieve in testifying before Ga. grand jury","description":"Graham had been scheduled to testify Tuesday before Georgia grand jury investigating Republican efforts to reverse the 2020 presidential election results in the state.","url":"https://www.washingtonpost.com/national-security/2022/08/21/lindsey-graham-trump-grand-jury-georgia/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YLP4T2BBMMI63JZPDZYUSBZPXQ.jpg&w=1440","publishedAt":"2022-08-21T20:24:00+00:00","content":"A federal appeals court has temporarily paused an order that would have required Sen. Lindsey O. Graham (R-S.C.) to testify before a Georgia grand jury investigating Republican efforts to reverse the… [+3367 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Katie Dowd","title":"Woman dies on hike at Oregon's popular Multnomah Falls","description":"The woman had been hiking with friends when she slipped and fell about 100 feet.","url":"https://www.sfgate.com/news/article/Woman-dies-on-hike-at-Multnomah-Falls-17388068.php","urlToImage":"https://s.hdnux.com/photos/01/27/06/07/22831570/3/rawImage.jpg","publishedAt":"2022-08-21T18:24:45+00:00","content":"A view of Multnomah Falls in Oregon's Columbia River Gorge.\r\nPatrick Morris/Getty Images\r\nA woman died on a hike at Oregons popular Multnomah Falls after falling 100 feet, officials said.\r\nFirst resp… [+859 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Al Jazeera","title":"Frantic rescue effort under way at Iraq shrine hit by landslide","description":"Operation continues to save people trapped under the rubble at the Qattarat al-Imam Ali shrine in Karbala province.","url":"https://www.aljazeera.com/news/2022/8/21/four-dead-in-iraq-shrine-hit-by-landslide","urlToImage":"https://www.aljazeera.com/wp-content/uploads/2022/08/000_32GV8F6.jpg?resize=1920%2C1440","publishedAt":"2022-08-21T17:47:28+00:00","content":"Iraqi rescue workers desperately searched for survivors buried under rubble after a landslide hit a Shia shrine, killing at least four people.\r\nThe official Iraqi news agency INA, citing the civil de… [+1743 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Alex Leary, Vivian Salama and Aruna Viswanatha","title":"Ex-White House Aide Kash Patel Presses View Trump Broadly Declassified Documents","description":"Since the FBI searched Trump’s Florida home, Kash Patel has become a leading proponent of the view that documents stored at Mar-a-Lago marked as classified had in fact been declassified by Trump as he left office.","url":"https://www.wsj.com/articles/ex-white-house-aide-kash-patel-presses-view-trump-broadly-declassified-documents-11661083201","urlToImage":"https://images.wsj.net/im-607317/social","publishedAt":"2022-08-21T12:00:00+00:00","content":"WASHINGTONIn May, former Trump administration official Kash Patel, as part of a lengthy scuffle with the National Archives, asserted that documents stored at Mar-a-Lago marked as classified had in fa… [+326 chars]"}]}