{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Amid global alarm, Ukraine, Russia trade blame for nuclear plant attacks","description":"International alarm over the weekend shelling of Ukraine's Zaporizhzhia nuclear complex grew on Monday, as Kyiv and Moscow traded blame for the attacks while seeking to address fears that their battle for control of the plant might trigger catastrophe.","url":"https://www.reuters.com/world/europe/un-chief-demands-international-access-ukraine-nuclear-plant-after-new-attack-2022-08-08/","urlToImage":"https://www.reuters.com/resizer/IhEeDvDraukrUv_J8GA5aWrTPAA=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/JX5RIREEQ5INTNWHV4TC7QQKOA.jpg","publishedAt":"2022-08-08T18:03:00+00:00","content":"KYIV, Aug 8 (Reuters) - International alarm over the weekend shelling of Ukraine's Zaporizhzhia nuclear complex grew on Monday, as Kyiv and Moscow traded blame for the attacks while seeking to addres… [+5593 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Dakin Andone, Alta Spells","title":"Gregory and Travis McMichael get second life sentences for federal hate crime convictions in Ahmaud Arbery's killing","description":"Gregory and Travis McMichael, the White father and son convicted in the killing of Ahmaud Arbery, were sentenced Monday to life in prison after their federal convictions this year on interference with rights -- a hate crime -- along with attempted kidnapping …","url":"https://www.cnn.com/2022/08/08/us/ahmaud-arbery-hate-crime-federal-sentencing/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/200507042812-ahmaud-arbery.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-08-08T17:52:00+00:00","content":"Gregory and Travis McMichael, the White father and son convicted in the killing of Ahmaud Arbery, were sentenced Monday to life in prison after their federal convictions this year on interference wit… [+4323 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Michael D. Shear","title":"Trump Asked Aide Why His Generals Couldn’t Be Like Hitler’s, Book Says","description":"The former president once asked his chief of staff why his military leadership couldn’t be more like the German generals who had reported to Adolf Hitler, according to an excerpt.","url":"https://www.nytimes.com/2022/08/08/us/politics/trump-book-mark-milley.html","urlToImage":"https://static01.nyt.com/images/2022/08/08/multimedia/08dc-trump-milley-1/08dc-trump-milley-1-facebookJumbo-v2.jpg","publishedAt":"2022-08-08T17:32:32+00:00","content":"No, no, no, they were totally loyal to him, the president replied, according to the books authors. In his version of history, the generals of the Third Reich had been completely subservient to Hitler… [+1343 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Oliver Darcy, CNN Business","title":"First on CNN: Alex Jones' texts have been turned over to the January 6 committee, source says","description":"Approximately two years' worth of text messages sent and received by Jones have been turned over to the House panel investigating the January 6 insurrection","url":"https://www.cnn.com/2022/08/08/politics/alex-jones-january-6/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220804182656-abogado-sandy-hook-alex-jones-juicio-contradiccion-original-pkg-00025610-super-tease.jpeg","publishedAt":"2022-08-08T17:29:00+00:00","content":"(CNN)Approximately two years' worth of text messages sent and received by right-wing conspiracy theorist Alex Jones have been turned over to the House select committee investigating the January 6 ins… [+2358 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Emily Crane","title":"California girl, 16, feared abducted after disappearing following campground party","description":"Kiely Rodni was last seen at the party near the Prosser Family Campground in Truckee, just north of Lake Tahoe, at about 12:30 a.m. on Saturday, the Placer County Sheriff’s Office said.","url":"https://nypost.com/2022/08/08/california-16-year-old-kiely-rodni-missing-after-party/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2022/08/kiely-rodni-missing-comp.jpg?quality=75&strip=all&w=1024","publishedAt":"2022-08-08T16:40:00+00:00","content":"A frantic search is underway for a missing 16-year-old California girl who authorities fear was abducted from an end-of-school party over the weekend. \r\nKiely Rodni was last seen at the party near th… [+1481 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"ISABEL DEBRE Associated Press","title":"Talks to revive Iran nuclear deal end, produce 'final text'","description":"Diplomats say talks to revive Tehran’s tattered nuclear accord with world powers in Vienna have ended as the parties closed a final text and key negotiators prepared to consult with their capitals","url":"https://abcnews.go.com/International/wireStory/talks-revive-iran-nuclear-deal-end-produce-final-88100272","urlToImage":"https://s.abcnews.com/images/International/WireAP_146f8070451044648cbbb4e41e54d574_16x9_992.jpg","publishedAt":"2022-08-08T16:30:03+00:00","content":"DUBAI, United Arab Emirates -- Talks to revive Tehran's tattered nuclear accord with world powers in Vienna ended Monday as the parties closed a final text and key negotiators prepared to consult wit… [+2654 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Michael Ruiz","title":"Gabby Petito’s parents announce wrongful death lawsuit against Moab police over Brian Laundrie 911 call","description":"Lawyers for Gabby Petito’s parents filed a notice of claim for a $50M wrongful death lawsuit against Moab police for their handling of a domestic violence call.","url":"https://www.foxnews.com/us/gabby-petitos-parents-announce-wrongful-death-lawsuit-moab-police-brian-laundrie-911-call","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2021/09/AP21259600933784.jpg","publishedAt":"2022-08-08T16:29:51+00:00","content":"If you or someone you know is the victim of domestic abuse, please call the National Domestic Violence Hotline at 800-799-7233.\r\nFIRST ON FOX: Lawyers for Gabby Petitos parents announced Monday that … [+9486 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Jacob Knutson","title":"What's inside Democrats' $740 billion tax, climate and health care bill","description":"The bill has cleared its tallest hurdle and is expected to pass the House before heading to Biden.","url":"https://www.axios.com/2022/08/08/inflation-reduction-act-biden","urlToImage":"https://images.axios.com/5F9hyDT0kbDrD5zn9T-YLlf08kc=/0x869:8342x5561/1366x768/2022/08/08/1659965452893.jpg","publishedAt":"2022-08-08T16:12:48+00:00","content":"Senate Democrats passed a $740 billion reconciliation package on Sunday that includes previsions that increase taxes on large corporations, address climate change and lower prescription drug costs.\r\n… [+2468 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Albuquerque police seek car in killings of 4 Muslim men","description":"ALBUQUERQUE, N.M. (AP) — Authorities investigating the killings of four Muslim men said they are looking for help finding a vehicle believed to be connected to the deaths in New Mexico's largest city.","url":"https://apnews.com/article/muslims-killed-albuquerque-17ef26ffff92cc05ff4ca77765066d33","urlToImage":"https://storage.googleapis.com/afs-prod/media/8baa09fcc0ab4e49bd3935a4753e7acd/3000.jpeg","publishedAt":"2022-08-08T15:53:25+00:00","content":"ALBUQUERQUE, N.M. (AP) Authorities investigating the killings of four Muslim men said they are looking for help finding a vehicle believed to be connected to the deaths in New Mexicos largest city.\r\n… [+2337 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"John Wagner, Mariana Alfaro","title":"Post Politics Now: Biden visits flood-stricken Kentucky ahead of bill signings this week","description":"After returning to Washington, Biden plans this week to sign bills benefiting the U.S. semiconductor industry and military veterans exposed to toxins.","url":"https://www.washingtonpost.com/politics/2022/08/08/biden-kentucky-flooding-bills-semiconductors-veterans/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/08-08-2022/t_543a7523746040f0b01d00b39143fddd_name_Sequence_03_01_10_46_16_Still025.jpg&w=1440","publishedAt":"2022-08-08T14:08:00+00:00","content":"Blake Masters, the GOP nominee for Senate in Arizona, is backing off one of his most polarizing ideas from the primary as he seeks to oust Sen. Mark Kelly (D) in a purple state. In an interview with … [+1433 chars]"}]}