{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":"Payton Major, Judson Jones and Amir Vera, CNN","title":"More than 100 million in the US face excessive warning or heat advisories as a dangerous heat wave continues","description":"Heat alerts cover more than 20 states today and tomorrow across the Southern Plains and parts of the Northeast, and temperatures will soar above the century mark for 60 million people over the next week.","url":"https://www.cnn.com/2022/07/19/weather/us-heat-extreme-warning-forecast/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220719093120-weather-us-heat-wednesday-card-super-tease.jpg","publishedAt":"2022-07-20T01:29:00+00:00","content":"Heat alerts cover more than 20 states today and tomorrow across the Southern Plains and parts of the Northeast, and temperatures will soar above the century mark for 60 million people over the next w… [+3 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Stephanie Lai","title":"House Moves to Protect Same-Sex Marriage From Supreme Court Reversal","description":"The legislation, which garnered some Republican support, would recognize same-sex marriages at the federal level. It faces an uncertain path in the Senate.","url":"https://www.nytimes.com/2022/07/19/us/politics/house-gay-marriage-bill.html","urlToImage":"https://static01.nyt.com/images/2022/07/19/us/politics/19dc-gaymarriage/19dc-gaymarriage-facebookJumbo.jpg","publishedAt":"2022-07-20T00:49:56+00:00","content":"Lets face it: This is a MAGA Supreme Court a MAGA, right-wing extremist Supreme Court very, very far away from not only where the average American is, but even the average Republican, Mr. Schumer sai… [+1790 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Matthew Brown","title":"GOP fake electors ‘targets’ in Georgia election fraud inquiry","description":"At least a dozen of the GOP electors who falsely certified Donald Trump as the victor of the 2020 election in Georgia are now targets of a criminal investigation.","url":"https://www.washingtonpost.com/national-security/2022/07/19/georgia-fake-electors/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XCL5VMAGYUI63AFWIPZL7TDGMI.jpg&w=1440","publishedAt":"2022-07-20T00:39:43+00:00","content":"ATLANTA Georgia prosecutors investigating potential criminal interference in the 2020 presidential election by Donald Trump and his allies have notified several Republicans who were part of a fake el… [+4724 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Seung Min Kim, Chris Megerian","title":"Biden holds off — for now — on climate emergency declaration","description":"WASHINGTON (AP) — President Joe Biden will travel to Massachusetts on Wednesday to promote new efforts to combat climate change, although he will not declare an emergency that would unlock federal resources to deal with the issue despite increasing pressure f…","url":"https://apnews.com/article/climate-biden-joe-manchin-and-environment-bed0159741405159639f800aec3b079b","urlToImage":"https://storage.googleapis.com/afs-prod/media/ad4cafea55af45df9a4e54851e134334/3000.jpeg","publishedAt":"2022-07-19T23:34:03+00:00","content":"WASHINGTON (AP) President Joe Biden will travel to Massachusetts on Wednesday to promote new efforts to combat climate change, although he will not declare an emergency that would unlock federal reso… [+5439 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Tierney Sneed, Katelyn Polantz","title":"Takeaways from Day 2 of the Steve Bannon contempt of Congress trial","description":"The contempt of Congress trial against Steve Bannon got underway in earnest on Tuesday with opening statements and the first witness testimony after a failed last-minute effort from the Trump ally's team to delay the trial.","url":"https://www.cnn.com/2022/07/19/politics/bannon-takeaways-day-2/index.html","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/220719172637-03-steve-bannon-0719.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2022-07-19T23:14:00+00:00","content":"The contempt of Congress trial against Steve Bannon got underway in earnest on Tuesday with opening statements and the first witness testimony after a failed last-minute effort from the Trump allys t… [+6251 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"National Archives demands answers on deleted Jan. 6 Secret Service texts","description":"NARA told the agency Tuesday that it had 30 days under federal law to explain why the text messages surrounding the Capitol attack were deleted.","url":"https://www.politico.com/news/2022/07/19/national-archives-deleted-jan-6-secret-service-texts-00046552","urlToImage":"https://static.politico.com/8e/64/ff27c2494f658e89d0d8ec843e15/https-delivery.gettyimages.com/downloads/1186173068","publishedAt":"2022-07-19T22:08:44+00:00","content":"The United States Secret Service respects and supports the important role of the National Archives and Records Administration in ensuring preservation of government records, Secret Service spokespers… [+2315 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Record UK temperatures fuel climate change fears - BBC News - BBC News","description":"<ol><li>Record UK temperatures fuel climate change fears - BBC News  BBC News\r\n</li><li>Extreme heat breaks temperature records across Europe | DW News  DW News\r\n</li><li>Scotland's papers: 'Earth sends a warning' and Goram's final farewell  BBC\r\n</li><li>Vie…","url":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9QWxSMzNvT2ppTlXSAQA?oc=5","urlToImage":null,"publishedAt":"2022-07-19T21:54:32+00:00","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Senate's season of Manchin starts winding down","description":"A few Democrats still want to keep cajoling their elusive centrist on climate and taxes. But his downsized party-line vision is coming to the floor.","url":"https://www.politico.com/news/2022/07/19/manchin-senate-agenda-00046623","urlToImage":"https://static.politico.com/8f/e4/5e4dc39d414884bab51c3e58bee5/main.Burgess.Manchin.jpg","publishedAt":"2022-07-19T21:00:38+00:00","content":"After giving a few more terse answers throughout the morning to a crowd of mostly TV reporters outside the committee room, Manchin dipped into his office and came back out, saying hed take no more qu… [+5510 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Susie Blann","title":"Russia pounds Ukraine as Putin gets Iran's backing","description":"KYIV, Ukraine (AP) — Russian missiles struck cities and villages in eastern and southern Ukraine, hitting homes, a school and a community center on Tuesday as Russian President Vladimir Putin  won strong support support from Iran for his country's military op…","url":"https://apnews.com/article/russia-ukraine-putin-iran-550e22a03995f63ff9e75144e64dd53a","urlToImage":"https://storage.googleapis.com/afs-prod/media/363af92d2fb04f089ac661368eef3d5f/3000.jpeg","publishedAt":"2022-07-19T20:37:30+00:00","content":"KYIV, Ukraine (AP) Russian missiles struck cities and villages in eastern and southern Ukraine, hitting homes, a school and a community center on Tuesday as Russian President Vladimir Putin won stron… [+8841 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Ronn Blitzer, Louis Casiano","title":"Reps. Omar, Adams among 16 members of Congress arrested during abortion protest near Supreme Court","description":"Multiple members of Congress including Reps. Ilhan Omar, D-Minn., and Alma Adams, D-N.C., were arrested by Capitol Police Tuesday afternoon outside the Supreme Court building during an abortion rights protest.","url":"https://www.foxnews.com/politics/reps-omar-adams-arrested-abortion-protest-supreme-court","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2022/04/ilhan-omar-4.18.22.jpg","publishedAt":"2022-07-19T18:15:53+00:00","content":"Multiple members of Congress including Reps. Ilhan Omar, D-Minn., and Alma Adams, D-N.C., were arrested by Capitol Police Tuesday afternoon outside the Supreme Court building during an abortion right… [+2907 chars]"}]}