{"status":"ok","totalResults":9,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"\"Give Me Back My Right To Live Without Fear And In Peace\": Bilkis Bano","description":"Bilkis Bano said the release of the men convicted of raping her and killing her family \"has taken from me my peace and shaken my faith in justice.\"","url":"https://www.ndtv.com/india-news/give-me-back-my-right-to-live-without-fear-and-in-peace-bilkis-bano-3263474","urlToImage":"https://c.ndtvimg.com/2019-04/p4j0aiao_bilkis-bano-pti-_625x300_23_April_19.jpg","publishedAt":"2022-08-18T01:32:00+00:00","content":"Bilkis Bano requested the Gujarat government to revoke the move.\r\nNew Delhi: Bilkis Bano, the survivor of one of the most horrific rape cases during the 2002 Gujarat riots, has said the release of th… [+2802 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Richa Banka","title":"Don’t mislead public on allopathy: Delhi HC to Ramdev","description":"The court directed the yoga guru to refrain from making unsubstantiated claims while speaking in favour of Patanjali product Coronil. | Latest News India","url":"https://www.hindustantimes.com/india-news/dont-mislead-public-on-allopathy-delhi-hc-to-ramdev-101660778092597.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/17/1600x900/92e9bc4e-b066-11ec-9250-903121267259_1648672425439_1660778214964_1660778214964.jpg","publishedAt":"2022-08-17T23:17:16+00:00","content":"New Delhi: The Delhi high court on Wednesday pulled up yoga guru Ramdev for misleading the public with his claims over Covid-19 vaccines and allopathic medicines, directing him to refrain from making… [+1946 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"News Desk","title":"Afghanistan: At Least 21 Killed, Many Wounded As Huge Blast Rips Through Mosque in Kabul","description":"The blast took place during the evening prayers at the mosque located in a northern Kabul neighbourhood. The explosion was so powerful that it shattered windows in nearby buildings","url":"https://www.news18.com/news/world/afghanistan-huge-blast-rips-through-kabul-mosque-many-casualties-feared-5771017.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-17t233216.329-166075935216x9.jpg","publishedAt":"2022-08-17T18:40:00+00:00","content":"A massive explosion ripped through a mosque in Afghanistans Kabul on Wednesday evening, leaving at least 21 dead. The blast took place during the evening prayers at the mosque located in a northern K… [+1352 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Delhi kept in dark: Manish Sisodia accuses Centre of 'conspiring' to settle Rohingyas","description":"Delhi Deputy Chief Minister Manish Sisodia alleged the Centre made a U-turn on providing flats to Rohingya refugees and then blamed it on the city government.","url":"https://www.indiatoday.in/india/story/delhi-manish-sisodia-allegations-centre-rohingya-refugees-housing-row-1989223-2022-08-17","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/PTI08_06_2022_000117A_2-647x363.jpeg?VLUqrnhLbeWCqmx2LN26Oc95Qv2eBW6P","publishedAt":"2022-08-17T17:15:32+00:00","content":"Deputy Chief Minister Manish Sisodia on Wednesday claimed the Central government has prepared a blueprint to permanently settle Rohingyas in EWS flats in Bakkarwala, Delhi. Manish Sisodia accused the… [+4529 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Manoj Gupta","title":"Can India Broker Ceasefire Between Russia and Ukraine? Is NSA Doval in Moscow as Peacemaker? Exclusive Deta","description":"European powers such as France and Germany, as well as the United States, are counting on New Delhi to coax Moscow into a ceasefire, sources say, indicating that India has allowed itself to be drawn into the role of a facilitator","url":"https://www.news18.com/news/india/can-india-broker-ceasefire-between-russia-and-ukraine-exclusive-details-of-nsa-dovals-moscow-visit-5770597.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-17t204758.939-166074953416x9.jpg","publishedAt":"2022-08-17T16:03:00+00:00","content":"National Security Adviser Ajit Doval, who is now in Moscow, is expected to try and persuade Russia to accept a détente in its attritional war with Ukraine, top sources familiar with the development t… [+2371 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"PTI","title":"Yediyurappa vows to strengthen BJP in rest of south India after being part of Parliamentary board","description":"Former chief minister B S Yediyurappa on Wednesday vowed to bring the BJP back to power in Karnataka and to strengthen it in the rest of south India, following his appointment to the highest decision-making body of the party ahead of the 2023 state assembly p…","url":"https://www.deccanherald.com/state/karnataka-politics/yediyurappa-vows-to-strengthen-bjp-in-rest-of-south-india-after-being-part-of-parliamentary-board-1136964.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/17/b-s-yediyurappa-1136964-1660752769.jpg","publishedAt":"2022-08-17T15:45:11+00:00","content":"Former chief minister B S Yediyurappa on Wednesday vowed to bring the BJP back to power in Karnataka and to strengthen it in the rest of south India, following his appointment to the highest decision… [+6266 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Shanker Arnimesh","title":"Shivraj Singh Chouhan to Yediyurappa, here's the message from BJP parliamentary board reshuffle","description":"11-member BJP parliamentary board saw 2 big names being dropped Wednesday, with 6 inductions, including veteran BJP leader B.S. Yediyurappa and Union Minister Sarbananda Sonowal.","url":"https://theprint.in/politics/shivraj-singh-chouhan-to-yediyurappa-heres-the-message-from-bjp-parliamentary-board-reshuffle/1086839/","urlToImage":"https://static.theprint.in/wp-content/uploads/2022/08/ShahNadda.jpg","publishedAt":"2022-08-17T15:22:10+00:00","content":"New Delhi: The BJPs reconstitution of its high-profile parliamentary board Wednesday is an exercise in diversity and aimed at sending a message to the public and party workers, according to senior pa… [+7012 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Near-Catastrophe At Madhya Pradesh's Karam Dam Brings Tender Scam In Focus Again","description":"The under-construction, much-delayed Karam Dam in Dhar district is one of many being probed, BJP government has said; scam pegged at Rs 3,000 crore; minister says won't spare guilty \"even if from our party\"","url":"https://www.ndtv.com/india-news/near-catastrophe-at-madhya-pradeshs-karam-dam-brings-scam-shadow-in-focus-again-3262804","urlToImage":"https://c.ndtvimg.com/2022-08/0af23258_karam-dam-_625x300_14_August_22.jpg","publishedAt":"2022-08-17T13:08:02+00:00","content":"Emergency channels had to be dug to release water from Karam Dam reservoir after heavy rain.\r\nBhopal: Madhya Pradesh's Karam Dam, at the centre of a near-catastrophe after cracks earlier this week, h… [+4046 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Reported by Nitish Chandra, Edited by Paras Bisht","title":"Bihar: Asked to surrender in kidnapping case, Kartikeya Singh instead took oath as law minister | Exclusive","description":"A day after Chief Minister Nitish Kumar expanded his new cabinet on Tuesday by inducting 31 new ministers, including a huge contingent of 16 from key ally RJD, controversy has erupted over the induction of RJD MLC Kartikeya Singh as the law minister of the st…","url":"https://www.indiatvnews.com/news/india/bihar-minister-kartikeya-singh-was-asked-by-court-to-surrender-in-kidnapping-case-he-took-oath-as-law-minister-2022-08-17-800645","urlToImage":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/edied-99a-1660714893.jpg","publishedAt":"2022-08-17T06:05:05+00:00","content":"<ul><li>Controversy has erupted over induction of RJD MLC Kartikeya Singh </li><li>He has been divested of law ministry in the state </li><li>A case of kidnapping has been registered against Singh </… [+3992 chars]"}]}