{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Delhi Lieutenant Governor To Sue AAP Leaders For Defamation","description":"Delhi Lieutenant Governor VK Saxena today said he would take legal action against Aam Aadmi Party (AAP) leaders, including MLAs Atishi and Saurabh Bharadwaj, for \"highly defamatory and false\" corruption allegations against him.","url":"https://www.ndtv.com/delhi-news/delhi-lieutenant-governor-names-aap-leaders-for-alleged-defamation-3303131","urlToImage":"https://c.ndtvimg.com/2022-05/1825ib98_delhi-lg-vinai-kumar-saxena-oath_625x300_26_May_22.jpg","publishedAt":"2022-08-31T11:04:00+00:00","content":"The Delhi L-G refuted the AAP charge as a \"figment of their imagination\".\r\nNew Delhi: Delhi Lieutenant Governor VK Saxena today threatened to sue Aam Aadmi Party (AAP) leaders, including MLAs Atishi … [+2222 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express Web Desk","title":"Bengaluru Karnataka News Live Updates: Plea in Supreme Court challenges HC order allowing Ganesh Chaturthi celebrations at Hubballi Idgah ground","description":"Bengaluru Karnataka news today: Hindu leaders on Wednesday morning installed a Ganesh idol in Hubballi's Idgah ground, a day after Karnataka High Court allowed Ganesh Chaturthi celebrations there.","url":"https://indianexpress.com/article/cities/bangalore/bengaluru-karnataka-hubballi-ganesh-chaturthi-news-live-updates-rains-weather-traffic-8121966/","urlToImage":"https://images.indianexpress.com/2022/08/hubballi-ganesh-chaturthi.jpg","publishedAt":"2022-08-31T10:57:21+00:00","content":"The seer being investigated by the Karnataka Police over allegations of sexual assault heads one of the most prominent of the nearly 3,000 Lingayat mutts in the state. As the state gets into election… [+1674 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Telangana's KCR Meets Nitish Kumar, Now BJP Rival Again","description":"During his Bihar visit, Mr Rao, popularly known as KCR, will also distribute money to the families of soldiers who died in the Galwan valley clashes at the Indian border with China in Ladakh.","url":"https://www.ndtv.com/india-news/telanganas-kcr-meets-nitish-kumar-now-bjp-rival-again-3302802","urlToImage":"https://c.ndtvimg.com/2022-08/mbjh32rg_kcr-meeting-nitish-kumar-tejashwi-yadav_650x400_31_August_22.jpg","publishedAt":"2022-08-31T10:48:00+00:00","content":"The three leaders are expected to discuss national politics.\r\nNew Delhi: In his latest outreach move aimed at stitching together an alliance of like-minded parties against the Bharatiya Janata Party,… [+3511 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Moneycontrol News","title":"April-July fiscal deficit at Rs 3.41 lakh crore; July sees first fiscal surplus since start of pandemic","description":"The Centre is targeting a fiscal deficit of Rs 16.61 lakh crore for FY23, or 6.4 percent of GDP.","url":"https://www.moneycontrol.com/news/business/economy/centres-april-july-fiscal-deficit-at-rs-3-41-lakh-crore-20-5-of-fy23-target-9111881.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2020/12/Union-Finance-Ministry-1-770x433.jpg","publishedAt":"2022-08-31T10:31:45+00:00","content":"The central government's fiscal deficit stood at Rs 3.41 lakh crore in April-July, accounting for 20.5 percent of the full-year target, data released on August 31 by the Controller General of Account… [+2803 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"PM To Reveal New Naval Flag On Friday, \"Doing Away With Colonial Past\"","description":"India will unfurl a new naval flag that retires a British colonial symbol to mark the formal debut of the country's first locally built aircraft carrier, Prime Minister Narendra Modi's office said.","url":"https://www.ndtv.com/india-news/navy-to-replace-colonial-flag-pm-to-unveil-new-ensign-3302761","urlToImage":"https://c.ndtvimg.com/2022-08/9fptcv0o_naval-flag_625x300_31_August_22.jpg","publishedAt":"2022-08-31T09:27:00+00:00","content":"PM Modi will reveal the new design Friday in Kerala.\r\nNew Delhi: India will unfurl a new naval flag that retires a British colonial symbol to mark the formal debut of the country's first locally buil… [+1892 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Written by India TV Lifestyle Desk","title":"Siddhivinayak Temple Mumbai LIVE darshan: Where to watch 10-day Ganesha aarti, timings and more","description":"Siddhivinayak Temple Mumbai LIVE darshan: This year the 10-day long festivity of Ganesh Chaturthi begins on August 31. However, people who are away and can't visit the Shree Siddhivinayak Temple, can watch the online coverage from the temple and seek the bles…","url":"https://www.indiatvnews.com/lifestyle/news/siddhivinayak-temple-mumbai-live-darshan-where-to-watch-10-day-ganesha-aarti-timings-and-more-2022-08-31-804292","urlToImage":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/ganpati-10-1661934974.jpg","publishedAt":"2022-08-31T08:44:34+00:00","content":"Siddhivinayak Temple Mumbai LIVE darshan: One of the most auspicious and majorly celebrated festival, Ganesh Chaturthi has begun today. The ten-day-long festival dedicated to Lord Ganesha is celebrat… [+1779 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Punjab Pastor's Car Set On Fire, Bhagwant Mann Assures Strict Action","description":"The Akal Takht, backing the Nihangs, said \"fake pastors\" are misleading the Sikhs and converting them. \"A case should be registered against these fake pastors under the Black Magic Act,\" the Sikh body said.","url":"https://www.ndtv.com/india-news/pastors-car-set-on-fire-church-vandalised-in-punjab-after-forced-conversion-charge-3302374","urlToImage":"https://c.ndtvimg.com/2022-08/305lma0g_punjab-pastor-car-set-on-fire_625x300_31_August_22.jpg","publishedAt":"2022-08-31T08:14:00+00:00","content":"The incident is from the Thakarpur village of Patti assembly constituency of Tarn Taran district.\r\nChandigarh: A group of people in Punjab's Tarn Taran district allegedly forcefully entered a local c… [+3742 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Sonali Phogat's death mystery: Late actress turned politician's net worth will blow your mind. Deets inside. | Hindi Movie News - Bollywood - Times of India","description":"Sonali Phogat’s death has become a mystery. Several arrests have been made in her death case till now. But, amid all this, do you know about the assets Sonali left behind? Well, it is being said that Sonali was the owner of a property worth Rs 110 crores, whi…","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/sonali-phogats-death-mystery-late-actress-turned-politicians-net-worth-will-blow-your-mind-deets-inside-/videoshow/93899840.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/93899840/size-83566/93899840.jpg","publishedAt":"2022-08-31T08:10:03+00:00","content":"Sonali Phogats death has become a mystery. Several arrests have been made in her death case till now. But, amid all this, do you know about the assets Sonali left behind? Well, it is being said that … [+585 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Nupur Thapliyal","title":"Indian Courts Can Direct Telegram To Disclose Info Of Copyright Infringers Using Its Platform, Server...","description":"The Delhi High Court has observed that copyright infringers cannot be permitted to seek shelter...","url":"https://www.livelaw.in/news-updates/copyright-infringers-telegrams-policies-physical-server-singapore-delhi-high-court-207993","urlToImage":"https://www.livelaw.in/h-upload/2019/10/02/365172-telegram.jpg","publishedAt":"2022-08-31T08:00:05+00:00","content":"The Delhi High Court has observed that copyright infringers cannot be permitted to seek shelter under messaging platform Telegram's policies merely on the ground that its physical server is in Singap… [+7810 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"HT News Desk","title":"‘How can the polls be free &amp; fair without…’: Manish Tewari on Cong prez election","description":"The former Union minister objected to senior colleague Madhusudan Mistry's statement to a newspaper that since the list of electors is not made public, any party member who wants to contest can visit PCC offices to check the list. | Latest News India","url":"https://www.hindustantimes.com/india-news/how-can-there-be-free-and-fair-polls-manish-tewari-on-congress-president-election-101661920300348.html","urlToImage":"https://images.hindustantimes.com/img/2022/08/31/1600x900/b8a1fdd8-41ea-11ec-b1ea-9df134a746cb_1636527018017_1661920304993_1661920304993.jpg","publishedAt":"2022-08-31T05:19:19+00:00","content":"Congress MP Manish Tewari on Wednesday raised suspicion on the fairness of the upcoming polls to elect the party's new president, and also asked the party to publish the list of names of all those wh… [+3403 chars]"}]}