{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express News Service","title":"Amarnath shrine cloudburst: 12 killed, rescue operations underway; PM Modi takes stock of situation","description":"As many as 25 tents at the Ball base camp are reported to have been affected. Prime Minister Modi took stock of the situation and said assistance is being provided to the affected.","url":"https://indianexpress.com/article/india/jk-cloudburst-near-amarnath-cave-rescue-operations-underway-8017783/","urlToImage":"https://images.indianexpress.com/2022/07/Amarnath-cb.jpeg","publishedAt":"2022-07-08T16:52:53+00:00","content":"At least 12 people have lost their lives in a flash flood triggered by a cloudburst near the Amarnath cave on Friday, Divisional Commissioner Kashmir, K Pandurang Pole, said.As many as 25 tents at th… [+2788 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"HT News Desk","title":"Rishi Sunak announces bid to succeed Boris Johnson as UK prime minister","description":"Rishi Sunak, the son-in-law of Infosys co-founder Narayana Murthy, becomes the highest-profile Tory member of Parliament yet to throw his hat in the ring for the leadership race. | World News","url":"https://www.hindustantimes.com/world-news/rishi-sunak-announces-bid-to-succeed-boris-johnson-as-uk-prime-minister-101657297201449.html","urlToImage":"https://images.hindustantimes.com/img/2022/07/08/1600x900/Britain-Politics-Conservative-Contenders-0_1657297311552_1657297325143.jpg","publishedAt":"2022-07-08T16:25:15+00:00","content":"Rishi Sunak, the former UK chancellor of the exchequer, whose resignation from Prime Minister Boris Johnson's cabinet helped spark an exodus of other ministers, on Friday declared his candidacy to be… [+1579 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Video: Moment When Japan Ex PM Shinzo Abe Was Shot On Stage","description":"Japanese former Prime Minister Shinzo Abe has died. Abe, 67, was on stage, delivering a speech at Nara when he was shot in the chest.","url":"https://www.ndtv.com/world-news/video-moment-when-japan-ex-pm-shinzo-abe-collapsed-after-shooting-3138491","urlToImage":"https://c.ndtvimg.com/2022-07/rap642_shinzo-abe_625x300_08_July_22.jpg","publishedAt":"2022-07-08T15:50:00+00:00","content":"Shinzo Abe collapsed after a second shot was fired\r\nNew Delhi: Japanese former Prime Minister Shinzo Abe died after being shot while campaigning. Abe, 67, was on stage, delivering a speech at Nara wh… [+1387 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Kaali director booked in India, bringing her back will be uphill challenge","description":"Getting an accused to face the law is a challenging task when the person is abroad. Legal experts are of the view that in such cases bringing the probe to a logical conclusion becomes difficult.","url":"https://www.indiatoday.in/india/story/kaali-director-leena-manimekalai-booked-in-india-bringing-her-back-will-be-uphill-challenge-1973511-2022-07-08","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/Leena_Manimekalai-647x363.jpeg?HU4Q0ffuLWO5KQa53BDc63FsJG3mjIn2","publishedAt":"2022-07-08T14:14:33+00:00","content":"Multiple cases have been filed against filmmaker Leena Manimekalai across India, including in Madhya Pradesh, Delhi and Uttar Pradesh, for the poster of her film featuring Goddess Kali. Leena has bee… [+7138 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"News Desk","title":"'Nobody Can Take Away Sena Symbol': Down But Not Out, Promises Uddhav Thackeray in Dare to Team Shinde","description":"Thackeray --- who is struggling to keep his flock together --- said there was no pressure on his party as he called for mid-term polls","url":"https://www.news18.com/news/politics/nobody-can-take-away-sena-symbol-down-but-not-out-promises-uddhav-thackeray-in-dare-to-team-shinde-5515999.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/06/uddhav-thackeray-2-165727235516x9.jpg","publishedAt":"2022-07-08T10:53:00+00:00","content":"In a direct dare to his successor and bête noire Eknath Shinde, whose rebellion led to the fall of the MVA government, former Maharashtra chief minister Uddhav Thackeray on Friday said no one could t… [+1444 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Livemint","title":"Vivo says cannot pay salaries, asks Delhi HC to lift bank account freeze | Mint","description":"The filing, submitted by Vivo India to the Delhi High Court, said the company would not be able to pay statutory dues and salaries due to the account block","url":"https://www.livemint.com/companies/news/vivo-asks-delhi-court-to-lift-bank-account-freeze-over-salary-payouts-11657275689905.html","urlToImage":"https://images.livemint.com/img/2022/07/08/600x338/Vivo_India_1657267336873_1657275870146.jpg","publishedAt":"2022-07-08T10:26:28+00:00","content":"The Indian arm of Chinese smartphone maker Vivo has approached a Delhi court, seeking to quash the Enforcement Directorate's decision to freeze its bank accounts, arguing the move was \"bad in law\" an… [+1439 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"CBI Case Against Mumbai Ex Top Cop Over Alleged Phone-Tapping","description":"The Central Bureau of Investigation (CBI) has filed a fresh case against former Mumbai police chief Sanjay Pandey and former National Stock Exchange (NSE) Chief Executive Chitra Ramkrishna for the alleged illegal phone tapping of stock market employe","url":"https://www.ndtv.com/india-news/fresh-cbi-case-against-mumbai-ex-police-chief-sanjay-pandey-former-national-stock-exchange-bosses-over-phone-tapping-3138764","urlToImage":"https://c.ndtvimg.com/2022-02/0iqs7ld_sanjay-pandey-mumbai-police-chief_625x300_28_February_22.jpeg","publishedAt":"2022-07-08T06:15:06+00:00","content":"Sanjay Pandey set up iSec Securities Pvt. Ltd in 2001 after he resigned from service.\r\nNew Delhi: The Central Bureau of Investigation, or CBI, has filed a fresh case against former Mumbai police chie… [+1267 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"HT News Desk","title":"When there's nothing left to lose: Sanjay Raut's message as Uddhav camp moves SC","description":"Maharashtra chief minister Eknath Shinde will visit New Delhi on Friday, which will be his first tour to the Capital after taking charge as the CM. The Uddhav camp has filed a fresh petition in the Supreme Court against the Governor's decision to invite Shind…","url":"https://www.hindustantimes.com/india-news/when-there-s-nothing-left-to-lose-sanjay-raut-s-message-as-uddhav-camp-moves-sc-101657258503942.html","urlToImage":"https://images.hindustantimes.com/img/2022/07/08/1600x900/1cb77374-f916-11ec-b6f2-35645806a8b6_1657258561005_1657258581365.jpg","publishedAt":"2022-07-08T05:41:29+00:00","content":"Shiv Sena leader Sanjay Raut on Friday said when there is nothing left to lose, there is everything to gain -- in a message succinctly describing the situation of the Shiv Sena in Maharashtra as the … [+1503 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express News Service","title":"ED raids 17 locations linked to Jharkhand CM Hemant Soren’s close aide","description":"The raids were being conducted in a money laundering case registered against Pankaj Mishra and were spread across Sahibganj, Barhet and Rajmahal areas of Jharkhand, sources revealed,","url":"https://indianexpress.com/article/india/ed-raids-jharkhand-cm-hemant-soren-aide-8016371/","urlToImage":"https://images.indianexpress.com/2022/07/hemant-soren.jpg","publishedAt":"2022-07-08T05:16:28+00:00","content":"The Enforcement Directorate (ED) on Friday carried out raids at 17 locations in Jharkhand that were linked to Pankaj Mishra, a close aide of state Chief Minister Hemant Soren and MLA representative f… [+3013 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"TNN","title":"Kaali poster controversy: Errors should be rectified, says Mamata Banerjee; Mahua Moitra fires fresh salvo","description":"Trinamool Congress MP Mahua Moitra on Thursday defended her recent comments on the “meat-eating and alcohol-accepting” Goddess Kali and said she would","url":"https://timesofindia.indiatimes.com/city/kolkata/errors-should-be-rectified-says-didi-mahua-moitra-fires-fresh-salvo/articleshow/92733336.cms","urlToImage":"https://static.toiimg.com/thumb/msid-92733345,width-1070,height-580,imgsize-35844,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2022-07-07T19:33:00+00:00","content":"Mahua Moitra could face action if she ignores party line: TMC sourcesNEW DELHI: Mamata Banerjees Trinamool Congress has not taken kindly to partys Krishnanagar MP Mahua Moitras move to unfollow her o… [+160 chars]"}]}