{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"TIMESOFINDIA.COM","title":"School jobs scam: Partha Chatterjee, Arpita Mukherjee sent to ED custody till August 3","description":"India News:  The Enforcement Directorate on Monday informed a special court in Kolkata that West Bengal minister Partha Chatterjee, arrested in connection with an","url":"https://timesofindia.indiatimes.com/india/school-jobs-scam-bengal-minister-partha-chatterjee-does-not-require-hospitalisation-says-aiims/articleshow/93112906.cms","urlToImage":"https://static.toiimg.com/thumb/msid-93112885,width-1070,height-580,imgsize-98858,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2022-07-25T17:25:00+00:00","content":"ED takes Bengal minister Partha Chatterjee to AIIMS-BhubaneshwarActing on a Calcutta high court's order, which had asked the Enforcement Directorate (ED) to fly out senior Bengal minister Partha Chat… [+162 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Explained Desk","title":"Explained: Four tribal revolts President Murmu invoked in her inaugural speech","description":"Addressing the nation after being sworn-in, President Murmu spoke about her journey from a small tribal village in Odisha to the Rashtrapati Bhavan. She also invoked four tribal revolutions that she said had strengthened tribal contribution to the freedom str…","url":"https://indianexpress.com/article/explained/droupadi-murmu-tribal-revolts-president-murmu-inaugural-speech-8051090/","urlToImage":"https://images.indianexpress.com/2022/07/droupadi-murmu-1200-1.jpg","publishedAt":"2022-07-25T15:14:45+00:00","content":"Addressing the nation after being sworn-in, President Murmu spoke about her journey from a small tribal village in Odisha to the Rashtrapati Bhavan. She also invoked four tribal revolutions that she … [+3834 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"HT Correspondent","title":"‘Rashtra Pratham’: Ideologies have their place, but nation comes first, says PM","description":"The tendency of putting ideologies and personal interests before that of the country’s is gaining momentum, Prime Minister Narendra Modi said | Latest News India","url":"https://www.hindustantimes.com/india-news/rashtra-pratham-ideologies-have-their-place-but-nation-comes-first-says-pm-101658761499029.html","urlToImage":"https://images.hindustantimes.com/img/2022/07/25/1600x900/7f704ad0-fbc9-11ec-b625-5cb344631767_1657178713012_1658762411657_1658762411657.jpg","publishedAt":"2022-07-25T15:05:04+00:00","content":"Prime Minister Narendra Modi on Monday expressed concern over the increasing tendency in political organisations to put their ideologies above that of the countrys, and said that parties should be mi… [+3126 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Watch: UP Official Showers Petals On Kanwarias  From Chopper","description":"Kanwar pillgrims were showered with flower petals from a helicopter in Meerut by top administrative officials. Meerut's IG Range Praveen Kumar and DM Deepak Meena took a chopper ride all over the district and showered flower petals on kanwariyas.","url":"https://www.ndtv.com/india-news/kanwar-yatra-kanwar-yatra-uttar-pradesh-watch-up-official-showers-petals-on-kanwarias-from-chopper-3191732","urlToImage":"https://c.ndtvimg.com/2022-07/vp8esh5k_kanwar-yatra_625x300_25_July_22.jpg","publishedAt":"2022-07-25T11:34:52+00:00","content":"Kanwar Yatra: The Kanwar Yatra is an annual pilgrimage of Lord Shiva's devotees.\r\nLucknow: Kanwar pillgrims were showered with flower petals from a helicopter in Meerut by top administrative official… [+1114 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"TIMESOFINDIA.COM","title":"4 Congress MPs suspended from Lok Sabha for entire Monsoon session over 'unruly behaviour'","description":"India News: NEW DELHI: Lok Sabha Speaker Om Birla on Monday suspended four Congress members for the rest of the monsoon session for unruly behaviour and disruptin.","url":"https://timesofindia.indiatimes.com/india/lok-sabha-4-congress-mps-suspended-for-rest-of-monsoon-session/articleshow/93111003.cms","urlToImage":"https://static.toiimg.com/thumb/msid-93112488,width-1070,height-580,imgsize-1230664,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2022-07-25T10:44:00+00:00","content":"Disruption of Parliament should be done in 'extreme situation', not become norm: Manish TewariNEW DELHI: Amid repeated adjournments in Parliament, Congress MP Manish Tewari on Sunday said parliamenta… [+194 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Mehbooba Mufti's Attack On Ex President Kovind: \"Fulfilled BJP's Agenda\"","description":"Former Jammu and Kashmir Chief Minister Mehbooba Mufti said that former President Ram Nath Kovind had left behind a legacy of the country's constitution being \"trampled upon umpteen times\" and accused him of working to the BJP's political agenda.","url":"https://www.ndtv.com/india-news/mehbooba-muftis-attack-on-ex-president-ram-nath-kovind-fulfilled-bjps-agenda-3191209","urlToImage":"https://c.ndtvimg.com/2022-06/bslcue8_mehbooba-mufti_625x300_25_June_22.jpg","publishedAt":"2022-07-25T10:29:00+00:00","content":"Soon after Droupadi Murmu's oath, her predecessor Ram Nath Kovind was targeted by Mehbooba Mufti.\r\nNew Delhi: Former Jammu and Kashmir Chief Minister Mehbooba Mufti said today that former President R… [+1498 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Sushant Kulkarni","title":"Trainer aircraft crash-lands on field in Pune village, pilot sustains minor injury","description":"Union Minister for Civil Aviation, Jyotiraditya Scindia said that an investigation has been launched by the DGCA to ascertain the cause of the incident.","url":"https://indianexpress.com/article/cities/pune/small-trainer-aircraft-crashes-in-maharashtras-pune-district-8050090/","urlToImage":"https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-25-at-1.05.32-PM-2-2.jpeg","publishedAt":"2022-07-25T09:05:29+00:00","content":"A 22-year-old woman trainee pilot sustained minor injuries after a trainer aircraft from a private aviation academy, which she was flying, crash-landed on a field in Indapur taluka of Pune district o… [+5116 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":null,"title":"Watershed moment: PM Modi, Amit Shah extend wishes as Droupadi Murmu takes charge as President","description":"After Droupadi Murmu was sworn in as the 15th President of India on Monday, congratulatory messages poured in from every corner of the country.","url":"https://www.indiatoday.in/india/story/watershed-moment-for-india-pm-modi-amit-shah-congratulate-president-droupadi-murmu-1979625-2022-07-25","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/murmu_modi-647x363.jpeg?uZP4OzOvXp83vswBj7M6xU5hrBIFm1LH","publishedAt":"2022-07-25T07:16:29+00:00","content":"Wishes and greetings poured in from the political fraternity on Monday after Droupadi Murmu was sworn in as the 15th President of India. She became the second woman President of the country and the f… [+4241 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Express News Service","title":"Kuwait returnee admitted to Hyderabad hospital with monkeypox-like symptoms","description":"The 40-year-old man returned from Kuwait on July 6 and started to show symptoms on Saturday. As his test results are awaited, health officials have traced six of his contacts and kept them under observation as they do not have any symptoms yet.","url":"https://indianexpress.com/article/cities/hyderabad/kuwait-returnee-hyderabad-monkeypox-8049704/","urlToImage":"https://images.indianexpress.com/2013/01/Monkeypox.jpeg","publishedAt":"2022-07-25T04:29:53+00:00","content":"A 40-year-old man from Telangana’s Kamareddy district was admitted to the isolation ward designated for suspected cases of monkeypox at Government Fever Hospital in Hyderabad Sunday.He returned home … [+2968 chars]"},{"source":{"id":"google-news-in","name":"Google News (India)"},"author":"Chaitanya Marpakwar","title":"Maharashtra: Uddhav Thackeray attacks rebels, says they planned to finish Shiv Sena off","description":"Shiv Sena chief Uddhav Thackeray on Sunday said that those who were 'worshipped' by the Sena had set out to swallow the party with the support of the","url":"https://timesofindia.indiatimes.com/city/mumbai/maharashtra-uddhav-thackeray-attacks-rebels-says-they-planned-to-finish-shiv-sena-off/articleshow/93098716.cms","urlToImage":"https://static.toiimg.com/thumb/msid-93115770,width-1070,height-580,imgsize-951608,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2022-07-25T01:36:00+00:00","content":"Religion over region or caste five big trends in Indian politicsTo win, you need to understand India, keep your ear on the ground, and understand and evolve with these trends"}]}