{"status":"ok","totalResults":9,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":"Jim Tankersley, Zolan Kanno-Youngs, Stacy Cowley","title":"Biden to Announce Decision on Student Loan Debt Relief","description":"The decision, expected Wednesday, will cap months of deliberations over fairness and the potential to exacerbate an inflation rate that has reached a 40-year high.","url":"https://www.nytimes.com/2022/08/23/us/politics/biden-student-loan-debt.html","urlToImage":"https://static01.nyt.com/images/2022/08/23/us/politics/23dc-studentloans1/23dc-studentloans1-facebookJumbo.jpg","publishedAt":"2022-08-24T01:11:53+00:00","content":"Tragically, weve experienced this so many times before, Mr. Johnson said in a statement, noting the Senates failure to pass police reform. President Bidens decision on student debt cannot become the … [+1275 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Joey Cappelletti","title":"2 men convicted in plot to kidnap Michigan Gov. Whitmer","description":"GRAND RAPIDS, Mich. (AP) — A jury on Tuesday convicted two men of conspiring to kidnap Michigan Gov. Gretchen Whitmer in 2020, delivering swift verdicts in a plot that was broken up by the FBI and described as a rallying cry for a U.S.","url":"https://apnews.com/9ad8f100d32e7d5883b1be9d6c4cb8d5","urlToImage":"https://storage.googleapis.com/afs-prod/media/10d99e1d3dd947439c5ff1ad52c40af6/2496.jpeg","publishedAt":"2022-08-24T00:51:17+00:00","content":"GRAND RAPIDS, Mich. (AP) A jury on Tuesday convicted two men of conspiring to kidnap Michigan Gov. Gretchen Whitmer in 2020, delivering swift verdicts in a plot that was broken up by the FBI and desc… [+5967 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Amanda Musa and Michelle Watson, CNN","title":"Former Louisville detective pleads guilty to federal charges in Breonna Taylor case","description":"A former Louisville detective pleaded guilty in federal court Tuesday to conspiring to falsify an affidavit for a warrant to search Breonna Taylor's home -- which ultimately led to the woman's death -- and to cover up the false document by lying to investigat…","url":"https://www.cnn.com/2022/08/23/us/breonna-taylor-ex-officer-kelly-goodlett-guilty-plea/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/201029192002-breonna-taylor-photo-super-tease.jpg","publishedAt":"2022-08-24T00:41:00+00:00","content":"(CNN)A former Louisville detective pleaded guilty in federal court Tuesday to conspiring to falsify an affidavit for a warrant to search Breonna Taylor's home -- which ultimately led to the woman's d… [+3849 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Steven Walker, Sarasota Herald-Tribune","title":"Dawnyelle Singleton, Lauren Kurnov and Nora Cietek take early lead in Sarasota School Board race","description":"In school board races, Dawnyelle Singleton takes early lead over Bridget Ziegler for District 1; Lauren Kurnov and Nora Cietek also see leads.","url":"https://www.heraldtribune.com/story/news/politics/elections/2022/08/23/sarasota-county-school-board-election-results-2022-dawnyelle-singleton-lauren-kurnov-nora-cietek/10290743002/","urlToImage":"https://www.gannett-cdn.com/presto/2022/08/23/NSHT/4f58260e-0110-495c-962a-bbe6a0815b25-SAR_PRIMARY_ELECTION_DAY_010.jpg?auto=webp&crop=5432,3056,x0,y134&format=pjpg&width=1200","publishedAt":"2022-08-23T23:36:32+00:00","content":"Sarasota County School Board candidates Dawnyelle Singleton, Lauren Kurnov and Nora Cietek have taken an early lead as polls closed and the first wave of results were tabulated.\r\nThe early lead is no… [+4843 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Katelyn Polantz and Tierney Sneed, CNN","title":"Judge gives Trump until Friday to better explain why he wants a special master for Mar-a-Lago documents","description":"A federal judge in Florida has given former President Donald Trump until Friday to refine the legal arguments in his request for a special master to oversee the review of evidence gathered in the Mar-a-Lago search.","url":"https://www.cnn.com/2022/08/23/politics/trump-special-master-deadline/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220818144742-trump-allanamiento-super-tease.jpg","publishedAt":"2022-08-23T22:36:00+00:00","content":"A federal judge in Florida has given former President Donald Trump until Friday to refine the legal arguments in his request for a special master to oversee the review of evidence gathered in the Mar… [+14 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"‘Pulling together for a stranger’: Hikers recall rescuing woman swept away in Zion flash flood","description":"ST. GEORGE — With the chance of flash flooding putting hikers at risk on Friday, a sign was posted at a trailhead in Zion National Park: The Narrows Trail was closed. But some already had begun their trek, and inside the carved canyon walls, there was no cell…","url":"https://www.stgeorgeutah.com/news/archive/2022/08/23/agl-pulling-together-for-a-stranger-hikers-recall-rescuing-woman-swept-away-in-zion-flash-flood/","urlToImage":"https://www.stgeorgeutah.com/wp-content/uploads/2022/08/FI-Zion-Flood-plans.jpg","publishedAt":"2022-08-23T22:07:30+00:00","content":"ST. GEORGE With the chance of flash flooding putting hikers at risk on Friday, a sign was posted at a trailhead in Zion National Park: The Narrows Trail was closed. But some already had begun their t… [+6240 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Cheri Mossburg, CNN","title":"Body discovered in submerged car confirmed to be missing California teen Kiely Rodni, police say","description":"The body found inside a submerged car in Northern California Sunday has been confirmed to be missing teen Kiely Rodni, who disappeared at a campground party in the area about three weeks ago, police said.","url":"https://www.cnn.com/2022/08/23/us/kiely-rodni-california-body-autopsy/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220823170354-01-kiely-rodni-super-tease.jpg","publishedAt":"2022-08-23T21:26:00+00:00","content":"(CNN)The body found inside a submerged car in Northern California Sunday has been confirmed to be missing teen Kiely Rodni, who disappeared at a campground party in the area about three weeks ago, po… [+2308 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Jan Wolfe, Alex Leary and Sadie Gurman","title":"Mar-a-Lago Boxes Had More Than 700 Pages of Classified Papers, National Archives Letter Says","description":"Boxes recovered from Donald Trump’s Florida home in January contained more than 700 pages of classified material, including documents marked as extremely sensitive, according to correspondence between the National Archives and the former president’s legal tea…","url":"https://www.wsj.com/articles/letter-to-trump-lawyer-highlights-national-archives-concern-over-sensitive-materials-before-mar-a-lago-search-11661271403","urlToImage":"https://images.wsj.net/im-608948/social","publishedAt":"2022-08-23T20:40:00+00:00","content":"WASHINGTONBoxes recovered from \r\nDonald Trumps Florida home in January contained more than 700 pages of classified material, including documents marked as extremely sensitive, according to correspond… [+428 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Officers Won't Face Charges In Rayshard Brooks Shooting","description":"A special prosecutor announced that no charges will be filed against the Atlanta police officers involved in the death of Rayshard Brooks in 2020. Investigat...","url":"https://www.youtube.com/watch?v=TttB4nlSvww","urlToImage":"https://i.ytimg.com/vi/TttB4nlSvww/maxresdefault.jpg","publishedAt":"2022-08-23T20:22:50+00:00","content":"A special prosecutor announced that no charges will be filed against the Atlanta police officers involved in the death of Rayshard Brooks in 2020. Investigat..."}]}