{"status":"ok","totalResults":10,"articles":[{"source":{"id":"ign","name":"IGN"},"author":"Matthew Adler","title":"Daily Deals: Early Prime Day Savings on Fire TV, Luna Gaming, Alexa Speakers, and More - IGN","description":null,"url":"https://www.ign.com/articles/daily-deals-early-prime-day-savings-on-fire-tv-luna-gaming-alexa-speakers-and-more","urlToImage":"https://assets-prd.ignimgs.com/2022/07/09/blogrolldeals-1657386999695.jpg?width=1280","publishedAt":"2022-07-09T17:50:16Z","content":"We're just days away from Amazon's annual Prime Day extravaganza beginning July 12th which is sure to offer some great savings on just about anything you could need, but that doesn't mean you can't s… [+18280 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Adam Bankhurst","title":"Blizzard Officially Ending Heroes of the Storm Content Development - IGN","description":"Blizzard Entertainment is officially ending new content development for its MOBA Heroes of the Storm and instead will focus solely on keeping the game running smoothly with seasonal rolls, hero rotations, bug fixes, balance updates, and more.","url":"https://www.ign.com/articles/blizzard-officially-ending-heroes-of-the-storm-content-development","urlToImage":"https://assets-prd.ignimgs.com/2022/07/09/heroesofthestorm-blogroll-1521503788593-1657388128204.jpg?width=1280","publishedAt":"2022-07-09T17:37:41Z","content":"Blizzard Entertainment is officially ending new content development for its MOBA Heroes of the Storm and will instead focus solely on keeping the game running smoothly with seasonal rolls, hero rotat… [+1960 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Amelia Emberwing","title":"The Boys Season 3 Ending Explained and Burning Questions - IGN","description":"The Boys Season 3 ended happier than you might expect, but doom's on the horizon and we've got a lot of questions! Let's talk about that ending and the burning questions we hope to see The Boys Season 4 answer.","url":"https://www.ign.com/articles/the-boys-season-3-ending-explained-and-burning-questions","urlToImage":"https://assets-prd.ignimgs.com/2022/07/09/screen-shot-2022-07-08-at-11-09-53-pm-1657347006160.png?width=1280","publishedAt":"2022-07-09T17:30:52Z","content":"This article contains spoilers for The Boys. If you're not caught up yet, check out our spoiler free review of The Boys Season 3 finale.\r\nAnother year, another list of depraved shenanigans for Prime … [+8924 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Adam Bankhurst","title":"Kojima Productions Threatens Legal Action Against Those Who Claim Hideo Kojima Was Linked to Shinzo Abe Assassination - IGN","description":"Following a racist joke that linked Hideo Kojima to the assassination of Japan's longest-serving Prime Minister Shinzo Abe, Kojima Productions has threatened legal action against those who contribute to the \"spread of fake news and rumors that convey false in…","url":"https://www.ign.com/articles/kojima-productions-threatens-legal-action-against-those-who-claim-hideo-kojima-was-linked-to-shinzo-abe-assassination","urlToImage":"https://assets-prd.ignimgs.com/2022/07/09/kojima-1280-2-1513017517777-160w-1657386073259.jpg?width=1280","publishedAt":"2022-07-09T17:18:11Z","content":"Following a racist joke that linked Hideo Kojima to the assassination of Japan's longest-serving Prime Minister Shinzo Abe, Kojima Productions has threatened legal action against those who contribute… [+2359 chars]"},{"source":{"id":"ign","name":"IGN"},"author":null,"title":"Thor vs. Valkyrie - Accent Coach Reacts to MCU Accents - IGN","description":"<section class=\"video-page\"><section data-transform=\"mobile-ad-break\"></section>Chris Hemsworth and Tessa Thompson both play Asgardian heroes with very particular British accents, so we got a Hollywood Dialect Coach to not only break down their performances b…","url":"https://www.ign.com/videos/2022/07/04/thor-vs-valkyrie-accent-coach-reacts-to-mcu-accents","urlToImage":"https://assets1.ignimgs.com/thumbs/userUploaded/2022/7/1/tessa-vs-chris-blog-1656685773893.jpg?width=1280","publishedAt":"2022-07-09T16:22:26.0556818Z","content":"Did you enjoy this video?"},{"source":{"id":"ign","name":"IGN"},"author":"Adam Bankhurst","title":"The Boys Showrunner on Season 3's Finale and What's In Store for Season 4 - IGN","description":"The Boys Showrunner Eric Kripke sat down with IGN to discuss the explosive Season 3 finale and what Season 4 has in store for Homelander, Butcher, Ryan, Victoria Neuman, and more.","url":"https://www.ign.com/articles/the-boys-showrunner-eric-kripke-on-what-season-4-has-in-store-for-homelander-butcher-ryan-victoria-neuman-and-more","urlToImage":"https://assets-prd.ignimgs.com/2022/07/09/theboysseason3announcementandfirstlookignblogroll-1641576358786-1657339979189.jpg?width=1280","publishedAt":"2022-07-09T16:00:28Z","content":"Warning: The following contains full spoilers for The Boys' third season!\r\nThe Boys third season has come to an explosive end and the finale capped off a season we called one of the best weve seen in… [+5286 chars]"},{"source":{"id":"ign","name":"IGN"},"author":null,"title":"Thor: Love and Thunder Is More Proof Marvel Needs a Phase 4 Goal, Fast - IGN","description":"<section class=\"video-page\"><p>As of July 2022, Marvel Studios is 18 months into what it calls Phase 4 of its interconnected storytelling, which consists of six films: Black Widow, Shang-Chi and the Legend of the Ten Rings, Eternals, Spider-Man: No Way Home, …","url":"https://www.ign.com/videos/thor-love-and-thunder-is-more-proof-marvel-needs-a-phase-4-goal-fast","urlToImage":"https://assets-prd.ignimgs.com/2022/07/09/mcu-phase-4-temp-1657326682070.jpg?width=1280","publishedAt":"2022-07-09T13:22:25.8992645Z","content":"As of July 2022, Marvel Studios is 18 months into what it calls Phase 4 of its interconnected storytelling, which consists of six films: Black Widow, Shang-Chi and the Legend of the Ten Rings, Eterna… [+1210 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Adam Bankhurst","title":"Creating Gorr the God Butcher for the MCU - Thor: Love and Thunder's Faith-less Adaptation - IGN","description":"Thor: Love and Thunder's Christian Bale and Taika Waititi discuss bringing Gorr the God Butcher to life and how he differs from the comics.","url":"https://www.ign.com/articles/creating-gorr-god-butcher-marvel-bale-waititi-thor-love-thunder","urlToImage":"https://assets-prd.ignimgs.com/2022/07/08/gorr-1657252732141.png?width=1280","publishedAt":"2022-07-08T18:08:03Z","content":"In Thor: Love and Thunder, not only is Thor trying to find himself, but he also has to deal with finding closure with his ex, Jane Foster, as well as stopping Gorr the God Butcher from well, butcheri… [+5734 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Matt Purslow","title":"Skull and Bones: 7 Things You Need To Know About Ubisoft's Pirate Game - IGN","description":"The key things you need to know about Skull and Bones, including how its open world, progression, crafting, and survival mechanics work.","url":"https://www.ign.com/articles/skull-and-bones-7-things-you-need-to-know-ubisoft-pirate-game","urlToImage":"https://assets-prd.ignimgs.com/2022/07/07/sb-blogroll-1657201883931.jpg?width=1280","publishedAt":"2022-07-07T18:20:54Z","content":"Skull and Bones is back. Ubisoft Singapores pirate game that we last saw at E3 2018 has finally sailed back into view and its out this November. But what exactly is it? Despite how it looks, Skull an… [+8779 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Chris Coke","title":"Best Budget VR Headset 2022 - IGN","description":"Virtual reality doesn’t have to cost an arm and a leg. These are the best budget VR headsets.","url":"https://www.ign.com/articles/best-budget-vr-headset","urlToImage":"https://assets-prd.ignimgs.com/2022/06/24/budget-vr-headset-1656044289582.jpg?width=1280","publishedAt":"2022-06-24T14:00:07Z","content":"Virtual reality is more popular than its ever been, and as the technology continues to evolve, affordable VR experiences are more accessible than ever. For years, the common wisdom was that you neede… [+13138 chars]"}]}