{"status":"ok","totalResults":6,"articles":[{"source":{"id":"ign","name":"IGN"},"author":null,"title":"Chapter 10 - Midtown - Stray Wiki Guide - IGN","description":"Welcome to IGN&apos;s walkthrough for Stray Chapter 10 - Midtown. This page features information on finding Clementine, including locating her apartment,","url":"https://www.ign.com/wikis/stray/Chapter_10_-_Midtown","urlToImage":"https://oyster.ignimgs.com/mediawiki/apis.ign.com/stray/9/9a/Stray10-1.jpg","publishedAt":"2022-07-22T03:22:35.4784552Z","content":"Welcome to IGN's walkthrough for Stray Chapter 10 - Midtown. This page features information on finding Clementine, including locating her apartment, finding a way to sneak into Neco Corp, and reuniti… [+20659 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Jesse Schedeen","title":"Mighty Morphin Power Rangers/Teenage Mutant Ninja Turtles Sequel Coming in December - Comic-Con 2022 - IGN","description":"BOOM! Studios and IDW Publishing have announced a sequel to 2019's Mighty Morphin Power Rangers/Teenage Mutant Ninja Turtles crossover comic, and this one promises to be even zanier than the first.","url":"https://www.ign.com/articles/power-rangers-teenage-mutant-ninja-turtles-sequel-comic-sdcc","urlToImage":"https://assets-prd.ignimgs.com/2022/07/22/power-rangers-tmnt-1658458948103.jpg?width=1280","publishedAt":"2022-07-22T03:05:26Z","content":"If the original Mighty Morphin Power Rangers/Teenage Mutant Ninja Turtles crossover comic didn't quench your '90s thirst, maybe the second time will be the charm. BOOM! Studios and IDW Publishing are… [+2219 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Adam Bankhurst","title":"How to Watch the Terminator Movies in Chronological Order - IGN","description":"Here's how to watch the Terminator movies in order, both chronologically and by release date.","url":"https://www.ign.com/articles/terminator-movies-in-order","urlToImage":"https://assets-prd.ignimgs.com/2022/07/21/terminator-3-1658427603510.png?width=1280","publishedAt":"2022-07-22T03:05:00Z","content":"Ill be back is one of the most iconic lines in movie history and it's all thanks to Arnold Schwarzenegger and the team bringing it and the Terminator franchise to life in 1984. Since then, the franch… [+8008 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Adam Bankhurst","title":"Resident Evil Village: The Mercenaries Trailer Shows Playable Lady Dimitrescu in Action - IGN","description":"Alongside a new trailer, new gameplay details have been revealed for Resident Evil Village: The Mercenaries Additional Orders' upcoming playable characters Lady Dimitrescu, Chris Redfield, and Karl Heisenberg.","url":"https://www.ign.com/articles/resident-evil-village-the-mercenaries-trailer-shows-playable-lady-dimitrescu-in-action","urlToImage":"https://assets-prd.ignimgs.com/2022/07/22/re-1658457711903.png?width=1280","publishedAt":"2022-07-22T03:03:46Z","content":"Alongside a new trailer, new gameplay details have been revealed for Resident Evil Village: The Mercenaries Additional Orders' upcoming playable characters Lady Dimitrescu, Chris Redfield, and Karl H… [+2772 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Rebekah Valentine","title":"King of the Hill Creator Says Animated Sitcom 'Has a Very Good Chance of Coming Back' - IGN","description":"Rumors of a King of the Hill Reboot have ebbed and flowed for the last several months. And once again, one of the creators is teasing us with tantalizing hints about the possible return of the beloved sitcom.","url":"https://www.ign.com/articles/king-of-the-hill-creator-says-animated-sitcom-has-a-very-good-chance-of-coming-back","urlToImage":"https://assets-prd.ignimgs.com/2022/07/22/sdcc2022-news-kingofthehill-blogroll-1658454283462.jpg?width=1280","publishedAt":"2022-07-22T01:46:32Z","content":"Rumors of a King of the Hill Reboot have ebbed and flowed for the last several months. And once again, one of the creators is teasing us with tantalizing hints about the possible return of the belove… [+1581 chars]"},{"source":{"id":"ign","name":"IGN"},"author":"Brian Barnett","title":"Best Liquid CPU Coolers 2022 - IGN","description":"Given how awesome and affordable a bolt-on liquid cooler is, there's no reason you shouldn't consider running one in your gaming rig.","url":"https://www.ign.com/articles/best-liquid-cpu-coolers","urlToImage":"https://assets-prd.ignimgs.com/2022/07/22/liquid-cpu-coolers-2-1658458445797.jpg?width=1280","publishedAt":"2022-07-07T02:54:38Z","content":"Computers are some of the most flexible, powerful devices in the world, but that power can come at a cost. Running the most powerful components (or overclocking those parts) can cause them to run hot… [+7868 chars]"}]}