{"status":"ok","totalResults":10,"articles":[{"source":{"id":"polygon","name":"Polygon"},"author":"Cass Marshall","title":"Rob Zombie’s The Munsters reboot looks super campy, debuts this fall","description":"Rob Zombie is rebooting The Munsters with a new film set to be released in September 2022. The trailer showcases the romance between Lily and Herman Munster and embraces the camp.","url":"https://www.polygon.com/23207089/rob-zombie-the-munsters-trailer-release-date","urlToImage":"https://cdn.vox-cdn.com/thumbor/eZsJO4oyBfaBnQn4gggHxMIPnT0=/0x44:1879x1028/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23764581/ZE1Q2Wi.png","publishedAt":"2022-07-13T17:43:00Z","content":"The movie is set for a September release"},{"source":{"id":"polygon","name":"Polygon"},"author":"Ana Diaz","title":"Cookie Run: Kingdom and Disney announce in-game collaboration","description":"The free-to-play gacha game Cookie Run: Kingdom teased a collaboration with Disney late Thursday night. The official account posted an image with a cookie cutout in the iconic Mickey Mouse shape.","url":"https://www.polygon.com/23207123/cookie-run-kingdom-disney-mickey-mouse-collaboration","urlToImage":"https://cdn.vox-cdn.com/thumbor/ENCH9f1gB-1IWmm5BvzLzTiLtnw=/0x27:1320x718/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23764600/cookie.jpg","publishedAt":"2022-07-13T17:37:27Z","content":"Disney is sprinkling some of its magic dust on the confection-fueled world of Cookie Run: Kingdom. Devsisters, the creators of the popular free-to-play mobile game, teased an upcoming collaboration w… [+1319 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Owen S. Good","title":"Sega Genesis Mini 2 North America release date, game list announced","description":"The Sega Genesis Mini 2, announced at the beginning of June, will launch in the U.S. and Canada on Oct. 27, the same day it launches in Japan. The mini-console comes with 50 games, including Sega CD games.","url":"https://www.polygon.com/23207254/sega-genesis-mini-2-release-date-pre-order-amazon","urlToImage":"https://cdn.vox-cdn.com/thumbor/qMDp_IfLXAMHeeyWivu3vUsF0Bg=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23764617/61Q89HoyfeL._SL1280_.jpg","publishedAt":"2022-07-13T17:34:44Z","content":"Segas second miniaturized throwback console the Sega Genesis Mini 2 will launch in North America on Oct. 27, the company announced on Wednesday. \r\nThe latest mini-console will feature more than 50 ga… [+1859 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Owen S. Good","title":"Metal Gear Solid 2 and 3 going back on sale for series’ anniversary","description":"Metal Gear Solid 2 and Metal Gear Solid 3 had been de-listed at online marketplaces in November 2021 because of expired licenses for footage used in the game. Konami said on July 13, 2022 that these games would go back on sale to observe the series’ debut 35t…","url":"https://www.polygon.com/23207185/metal-gear-solid-anniversary-konami-games-back-on-sale","urlToImage":"https://cdn.vox-cdn.com/thumbor/EGKd9afCBvCr7tfUeEo3wqacxfk=/0x73:1920x1078/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23764506/MetalGearSolid2_2_min.jpg","publishedAt":"2022-07-13T16:55:36Z","content":"Metal Gear launched 35 years ago on Tuesday I remember the original back-cover advertisement on Marvel Comics of the day and with that anniversary in mind, Konami says it is preparing to resume sales… [+1009 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Nicole Carpenter","title":"Elden Ring publisher Bandai Namco investigating ransomware hack","description":"Hackers behind BlackCat claimed responsibility for the attack, which happened on July 3. Bandai Namco, the Elden Ring, Tekken, and Dragon Ball publisher, is now investigating the scope of the hack.","url":"https://www.polygon.com/23206967/bandai-namco-hack-ransomware","urlToImage":"https://cdn.vox-cdn.com/thumbor/vweNBzDXq38pdEkVlzc_4Cxl_PQ=/0x0:3840x2010/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23426618/elden_ring_dragon.jpg","publishedAt":"2022-07-13T16:25:07Z","content":"Bandai Namco says it was hacked by a ransomware group in July, the Elden Ring and Tekken publisher confirmed Wednesday. The group, called Black Cat after the ransomware it uses, claimed responsibilit… [+2508 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Owen S. Good","title":"PS Plus games for July 2022: Assassin’s Creed, Final Fantasy 7 Remake","description":"PlayStation Plus Extra and Premium tier subscribers will get access to Final Fantasy 7 Remake Intergrade, Marvel’s Avengers, the new indie game Stray, and more beginning July 19.","url":"https://www.polygon.com/23204371/playstation-plus-july-2022-extra-premium-new-games-free","urlToImage":"https://cdn.vox-cdn.com/thumbor/1pvYnOoL6Q1_iXv7lwVOOGrN2xo=/0x9:5160x2711/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23613605/Cover_1.jpg","publishedAt":"2022-07-13T15:57:26Z","content":"The first monthly update for the new PlayStation Plus Extra and Premium service tiers delivers five Assassins Creed titles, along with Marvels Avengers, Final Fantasy 7 Remakeand the previously confi… [+2325 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Toussaint Egan","title":"You’ll be able to sync your Wordle stats through your New York Times account soon","description":"The New York Times announced over Twitter that users will soon be able to sync their Wordle stats across multiple devices through their New York Times account. The update is being rolled out to all current users, and once the process has been completed, it ca…","url":"https://www.polygon.com/23206914/wordle-stats-sync-all-devices-new-york-times","urlToImage":"https://cdn.vox-cdn.com/thumbor/Kqlv0dXfNFUt1nj8hSmZSFo4OUA=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23448048/wordle_harry.jpg","publishedAt":"2022-07-13T15:07:54Z","content":"Wordle, the wildly popular word game that first launched back in 2021, has seen quite a few changes since it was acquired by the New York Times back in January. The official New York Times Games Twit… [+1251 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Michael McWhertor","title":"Bayonetta 3’s new Naive Angel Mode lets Bayonetta keep her clothes on","description":"Nintendo and PlatinumGames are offering Bayonetta 3 players the option to keep the witch’s clothes on. Naive Angel Mode will hide the cheeky nudity the Bayonetta series is famous/infamous for.","url":"https://www.polygon.com/23206846/bayonetta-3-naive-angel-mode-nudity-options","urlToImage":"https://cdn.vox-cdn.com/thumbor/tp81s9zYpe4-eDsQzdOfL7Czsco=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23764083/007.jpg","publishedAt":"2022-07-13T14:53:37Z","content":"The Bayonetta series is known equally for its white-knuckle character-based action as much as it is for its heroine getting nearly naked every time she summons a hirsute demon to theatrically feast o… [+2100 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Toussaint Egan","title":"Skate 4 devs asks fans to be patient, stop playing leaked build of game","description":"Skate developer Full Circle asked fans of the series to stop playing a leaked build of Skate 4 from September 2021, asking them instead to sign up for the insider playtesting program for the as-of-yet untitled sequel.","url":"https://www.polygon.com/23206837/skate-4-leaked-game-build-devs-respond","urlToImage":"https://cdn.vox-cdn.com/thumbor/TsJe6WG_qRS0lC-MklzBxndNklw=/0x25:1280x695/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7445197/skate_3_screenshot_1280.jpg","publishedAt":"2022-07-13T14:02:26Z","content":"Fans of Skate, the extreme skateboarding sports game series from Electronic Arts, are champing at the bit to play the upcoming sequel first announced back in 2020. So much, in fact, theyre playing an… [+1464 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Oli Welsh","title":"Spotify buys Wordle-style music guessing game Heardle","description":"Following Spotify’s acquisition for an undisclosed sum, Heardle is now only available in the U.S., U.K., Ireland, Canada, Australia and New Zealand. Some users are also complaining that scores and streaks have been reset.","url":"https://www.polygon.com/23206760/spotify-buys-heardle-music-guessing-game","urlToImage":"https://cdn.vox-cdn.com/thumbor/fslmH9KIhpxLPmmzIDsW4Bdarn4=/0x131:3543x1986/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23764003/1241856212.jpg","publishedAt":"2022-07-13T13:39:39Z","content":"In a move similar to the New York Times acquisition of Wordle back in January, audio streaming giant Spotify has bought music guessing game Heardle for an undisclosed sum.\r\nHeardle has already been r… [+1985 chars]"}]}