{"status":"ok","totalResults":10,"articles":[{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The Panasonic Lumix GH6 Lets You Film on the Fly","description":"In-body stabilization and thoughtfully designed controls make this workhorse a great choice for in-the-field photographers and filmmakers.","url":"https://www.wired.com/review/panasonic-lumix-gh6","urlToImage":"https://media.wired.com/photos/62ed6496c899551de612436a/191:100/w_1280,c_limit/Lumix-GH5-Gear.jpg","publishedAt":"2022-08-08T12:07:39.3654919Z","content":"Panasonics high-end mirrorless cameras have been the go-to for independent and documentary filmmaking for years. In 2017, Panasonic introduced the original GH5, the flagship model that took three yea… [+4528 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The Chaotic Monkeypox Vaccine Pipeline Is Leaving Everyone Short","description":"A Danish company that’s the sole producer of the only approved vaccine has sold nearly all its supplies to the US, and it won’t be making new doses until 2023.","url":"https://www.wired.com/story/monkeypox-vaccine-supply-chain/","urlToImage":"https://media.wired.com/photos/62ed99379a81878b183eb014/191:100/w_1280,c_limit/vaccine_rollout_Science_GettyImages-1242143008.jpg","publishedAt":"2022-08-08T11:00:00Z","content":"In a run-of-the-mill business park in Kvistgård, a Danish village about 25 miles north of Copenhagen encircled by forests, lies one of the most crucial solutions for controlling the global monkeypox … [+2933 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"How Clean is ‘Clean’ Hydrogen?","description":"Batteries and renewable energy alone can’t decarbonize industries, and recent proposals for a “hydrogen economy” could bridge those gaps.","url":"https://www.wired.com/story/how-clean-is-clean-hydrogen/","urlToImage":"https://media.wired.com/photos/62ed71739a81878b183eb012/191:100/w_1280,c_limit/hydrogen_bill_incentives_science_GettyImages-642338286.jpg","publishedAt":"2022-08-08T11:00:00Z","content":"The Democrats new climate bill, which was passed by the US Senate on Sunday, has been described as transformative and game-changing. But perhaps the most apt word is shockingin a good way, for once. … [+3009 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"What to Know About 988, the New Suicide and Crisis Lifeline","description":"Americans can call or text this number if they or someone they know needs a counselor to listen or point them to additional resources.","url":"https://www.wired.com/story/988-suicide-hotline-explained/","urlToImage":"https://media.wired.com/photos/62ed71d370af0aae2b39930d/191:100/w_1280,c_limit/Suicidal-Hotline-Gear-GettyImages-1286844080.jpg","publishedAt":"2022-08-08T11:00:00Z","content":"988. Thats the new number anyone in America can call or text for help if they feel suicidal or experience mental distress. Youre not alone. Millions of Americans think about suicide every year accord… [+3710 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Crypto and the US Government Are Headed for a Decisive Showdown","description":"A crop of lawsuits could finally settle the question of whether most digital assets are illegal securities offerings.","url":"https://www.wired.com/story/crypto-web3-securities-ripple-sec-lawsuits","urlToImage":"https://media.wired.com/photos/62ed97ea23d2b53441872e04/191:100/w_1280,c_limit/business-crypto.jpg","publishedAt":"2022-08-08T11:00:00Z","content":"Perhaps seeing that the law is going to come for crypto sooner or later, the industry has been rallying behind an effort to pass a new regulatory framework just for cryptoone that spares the full wra… [+3851 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"A Suspected Killer’s Fans Are Still Promoting Him Online","description":"After a local politician and two others were gunned down in the Philippines, posts supporting the suspect continue to gain traction on social media.","url":"https://www.wired.com/story/philippines-shooter-content-moderation","urlToImage":"https://media.wired.com/photos/62ed7a9970af0aae2b39930f/191:100/w_1280,c_limit/Chao-Tiao-Yumol-Fans-Are-Still-Promoting-Him-Online-Business-1242088007.jpg","publishedAt":"2022-08-08T11:00:00Z","content":"Rose Furigay, the former mayor of the city of Lamitan in the Philippines, was attending her daughters graduation when she died on July 24. A man shot and killed her and two others at the graduation c… [+3096 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Tim Wu, Biden’s Anti-Big Tech Adviser, Has Been Living the Dream","description":"Plus: The government’s plan for Microsoft, the limits of health care disruption, and a regular irregular event.","url":"https://www.wired.com/story/plaintext-tim-wu-biden-big-tech","urlToImage":"https://media.wired.com/photos/62ec511154d910713ee4f172/191:100/w_1280,c_limit/Tim-Wu-Bidens-Anti-Big-Tech%20Adviser-Business-Redux-h_15490592.jpg","publishedAt":"2022-08-05T13:00:00Z","content":"Wu even suggests that weve turned a corner in stemming Big Techs dominance. Ten years ago or whenever, they were able to get away with acquiring potential competitors, or making deals to lock out oth… [+3465 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Amazon Workers in the UK Walk Out in a Cost-of-Living Rebellion","description":"After news of a “pointless” pay increase spread, workers at three warehouses stopped work to demand higher wages as inflation and interest rates surge.","url":"https://www.wired.com/story/amazon-uk-pay-protests","urlToImage":"https://media.wired.com/photos/62ec5c676896acbb4eb3381b/191:100/w_1280,c_limit/UK-Amazon-Warehouse-Workers-Pay-Strike-Business-83077320.jpg","publishedAt":"2022-08-04T23:58:01Z","content":"Discontent started to ripple through Amazons largest UK warehouse as soon as details of a bump in hourly pay flashed onto screens around the facility on Wednesday. Rumors at the Tilbury distribution … [+3984 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"10 Best Crossplay Games for Consoles and PC (2022): Xbox, PlayStation, Switch, Mobile","description":"These titles let you play with friends on different platforms, whether it be computer, Xbox, PlayStation, Switch, or even mobile.","url":"https://www.wired.com/story/crossplay-games-console-pc-switch-mobile","urlToImage":"https://media.wired.com/photos/6189b7b812143eb34d938e09/191:100/w_1280,c_limit/Gear-Crossplay-Games-1329513424.jpg","publishedAt":"2021-11-09T13:00:00Z","content":"However, as shooter veterans know, playing with a keyboard and mouse provides a considerable advantage in terms of aiming. So if you're on a console, you can choose to turn off crossplay and stick to… [+2882 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"How to Share Your Wi-Fi Password: Android, iPhone, Mac, or Windows","description":"Help your guests connect to your network without typing a thing.","url":"https://www.wired.com/story/how-to-share-wi-fi-password","urlToImage":"https://media.wired.com/photos/60fb214376dfd2eea48937cc/191:100/w_1280,c_limit/Gear-How-to-Share-WiFi-1156012863.jpg","publishedAt":"2021-07-25T13:00:00Z","content":"A good host always shares Wi-Fi with visitors, but explaining which network to join and spelling out the password (if you can even remember it) can get tedious. Maybe you think you remember it but it… [+1711 chars]"}]}