{"status":"ok","totalResults":10,"articles":[{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"How to Use an eSIM for Dual Phone Numbers","description":"The era of removable SIM cards will come to an end. It's time to get acquainted with its next, tinier evolution.","url":"https://www.wired.com/story/what-are-esims","urlToImage":"https://media.wired.com/photos/62be38d251f58063018c35a1/191:100/w_1280,c_limit/eSIM-dual-phone-numbers-gear-2JD08TT.jpg","publishedAt":"2022-07-01T12:00:00Z","content":"An eSIM can dramatically alter how you use your smartphone. Unlike removable subscriber identity module (SIM) cards, eSIMs are a permanent part of your phone and enable you to use two different numbe… [+3580 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Is Your New Car a Threat to National Security?","description":"Putting sensor-packed Chinese cars on Western roads could be a privacy issue. Just ask Tesla.","url":"https://www.wired.com/story/china-cars-surveillance-national-security/","urlToImage":"https://media.wired.com/photos/62b64c4379907f238941ad6e/191:100/w_1280,c_limit/ChinaElectric-03.png","publishedAt":"2022-07-01T11:00:00Z","content":"I was able to see a large amount of data. Including where the Tesla has been, where it charged, current location, where it usually parks, when it was driving, the speed of the trips, the navigation r… [+3092 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Meta Was Restricting Abortion Content All Along","description":"Abortion access groups and activists say they have been dealing with algorithmic censorship for years.","url":"https://www.wired.com/story/meta-abortion-content-restriction/","urlToImage":"https://media.wired.com/photos/62be29b451f58063018c359f/191:100/w_1280,c_limit/Meta-Restricting-Abortion-Content-Business-1145262125.jpg","publishedAt":"2022-07-01T11:00:00Z","content":"Johnsens experience is common in the pro-choice activist community. Most of the people who spoke to WIRED say their content appeared to have been removed automatically by AI, rather than being report… [+3306 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The Secrets of Covid ‘Brain Fog’ Are Starting to Lift","description":"Scientists are getting closer to understanding the neurology behind the memory problems and cognitive fuzziness that an infection can trigger.","url":"https://www.wired.com/story/the-secrets-of-covid-brain-fog-are-starting-to-lift/","urlToImage":"https://media.wired.com/photos/62be03837a39cc2124cb2d6f/191:100/w_1280,c_limit/COVID-Brain-Fog-Science-ScienceSource_SS21470210.jpg","publishedAt":"2022-07-01T11:00:00Z","content":"Allison Guy was having a great start to 2021. Her health was the best it had ever been. She loved her job and the people she worked with as a communications manager for a conservation nonprofit. She … [+3498 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The Race to Build Wind Farms That Float on the Open Sea","description":"There’s huge potential to generate renewable energy far out in the ocean. But designing turbines that can survive rough waters isn’t exactly a breeze.","url":"https://www.wired.com/story/floating-wind-turbines","urlToImage":"https://media.wired.com/photos/62be107d042ab1ffde99c525/191:100/w_1280,c_limit/Ocean-Wind-Turbines-WindCatching-Science.jpg","publishedAt":"2022-07-01T11:00:00Z","content":"The makers of wind turbines have, for many decades now, labored to harness one of the mightiest forces in nature. Theyve moved from onshore to offshore sites, building ever larger rotors with huge bl… [+2641 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The Supreme Court Is Jeopardizing Federal Climate Action","description":"The court’s decision in West Virginia v. EPA doesn’t go as far as some climate activists feared it might. But it’s a road map for future challenges.","url":"https://www.wired.com/story/the-supreme-court-is-jeopardizing-federal-climate-action","urlToImage":"https://media.wired.com/photos/62b615ddd5db4b03db8b1d49/191:100/w_1280,c_limit/WVA_EPA_Science_GettyImages-1010283002.jpg","publishedAt":"2022-06-30T17:18:43Z","content":"Today, in a ruling on a nonexistent plan with nonexistent harms to the people who brought the suit, the Supreme Court took an opportunity to curb the ability of the Environmental Protection Agency to… [+3447 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The Fight Over Which Uses of Artificial Intelligence Europe Should Outlaw","description":"The European Union’s AI Act will set ground rules for what the technology can and can’t do to citizens of the bloc, like whether it’s OK to use lie detectors at borders.","url":"https://www.wired.com/story/europe-law-outlaw-ai","urlToImage":"https://media.wired.com/photos/62bcdad7042ab1ffde99c514/191:100/w_1280,c_limit/Border-Patrol-Greece-AI-Polygraphs-Business-1233365255.jpg","publishedAt":"2022-06-30T15:39:20Z","content":"In 2019, guards on the borders of Greece, Hungary, and Latvia began testing an artificial-intelligence-powered lie detector. The system, called iBorderCtrl, analyzed facial movements to attempt to sp… [+3231 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"A New, Remarkably Sophisticated Malware Is Attacking Routers","description":"Researchers say the remote-access Trojan ZuoRAT is likely the work of a nation-state and has infected at least 80 different targets.","url":"https://www.wired.com/story/zuorat-trojan-malware-hacking-routers","urlToImage":"https://media.wired.com/photos/62bcb32a9c301780cc32969d/191:100/w_1280,c_limit/Router-Hacks-Security-GettyImages-1264656210.jpg","publishedAt":"2022-06-30T13:00:00Z","content":"An unusually advanced hacking group has spent almost two years infecting a wide range of routers in North America and Europe with malware that takes full control of connected devices running Windows,… [+3544 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Worker-Owned Apps Are Redefining the Sharing Economy","description":"As Uber and its ilk face high prices, increased regulation, and labor shortages, a new cooperative model is thriving.","url":"https://www.wired.com/story/gig-economy-worker-owned-apps","urlToImage":"https://media.wired.com/photos/62bcee6e9c301780cc3296a5/191:100/w_1280,c_limit/Uber-Driver-Protest-Worker-Owned-Apps-Business-1219233871.jpg","publishedAt":"2022-06-30T11:00:00Z","content":"To compete with well-funded private platforms, active government and municipal intervention is vital for platform cooperatives. This could be through procurement policies that give platform cooperati… [+3710 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The World Can’t Wean Itself Off Chinese Lithium","description":"China dominates the global supply chain for lithium-ion batteries. Now rival countries are scrambling for more control over “white oil.”","url":"https://www.wired.com/story/china-lithium-mining-production","urlToImage":"https://media.wired.com/photos/62b64bac0fb5f25fbb4ecdfc/191:100/w_1280,c_limit/ChinaElectric-02.png","publishedAt":"2022-06-30T11:00:00Z","content":"The industrial port of Kwinana on Australias western coast is a microcosm of the global energy industry. From 1955, it was home to one of the largest oil refineries in the region, owned by British Pe… [+3003 chars]"}]}