{"status":"ok","totalResults":10,"articles":[{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"What Germany's Lack of Race Data Means During a Pandemic","description":"Due to its history with the Holocaust, calling race by its name has often been contested. Black Germans say that this policy can ignore disparate impact.","url":"https://www.wired.com/story/race-germany-covid-19","urlToImage":"https://media.wired.com/photos/62ce00453aaa436285ac29be/191:100/w_1280,c_limit/What%20Germanys%20Lack%20of%20Race%20Data%20Means%20During%20a%20Pandemic.jpg","publishedAt":"2022-07-13T12:00:00Z","content":"What do you think the rate of Covid-19 is for us? This is the question that many Black people living in Berlin asked me at the beginning of March 2020. The answer: We dont know. Unlike other countrie… [+6279 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"What Humans Can Learn From the Sea Cucumber’s Toxic Arsenal","description":"Sea cucumbers are squishy and soft. They also employ lethal strategies to protect themselves.","url":"https://www.wired.com/story/what-humans-can-learn-from-the-sea-cucumbers-toxic-arsenal/","urlToImage":"https://media.wired.com/photos/62cda3f6d0594ff2021e9aa4/191:100/w_1280,c_limit/A.japonicus_Science_F18EHT.jpg","publishedAt":"2022-07-13T11:00:00Z","content":"But this chemical defense creates a big problem for sea cucumbers: They need to avoid killing themselves with their own toxins. And that means their own cells cant contain cholesterol, the target tha… [+4717 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The First—and Last—Time We Rank the Star Wars Movies","description":"All ranked lists are lazy, lame, and lacking. Except this one.","url":"https://www.wired.com/story/star-wars-movies-ranked/","urlToImage":"https://media.wired.com/photos/62ce0a69540a1fd5ca4bd82a/191:100/w_1280,c_limit/Star-Wars-Ranking-Culture-607402182.jpg","publishedAt":"2022-07-13T11:00:00Z","content":"Or is it? George Lucas prequel trilogy did far more than tell the story of the rise of Vader. It also revised the legacy of the Jedi, and therefore the legacy of the franchise itself. The famed Jedi … [+3543 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"Turkey Probably Hasn’t Found the Rare Earth Metals It Says It Has","description":"The deposits discovered reportedly contain enough resources to meet global demand for 1,000 years—surpassing even China’s reserves. But experts are skeptical.","url":"https://www.wired.com/story/turkey-rare-earth-metals","urlToImage":"https://media.wired.com/photos/62ce0670540a1fd5ca4bd828/191:100/w_1280,c_limit/Turkey_erbium_science_GettyImages-1301585203.jpg","publishedAt":"2022-07-13T11:00:00Z","content":"The official press release about Turkeys discovery is scant on details. But Goodenough suggests that it is likely to be the well-known Kizilçaören deposit, located near the city of Eskiehir in northw… [+4285 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"When AI Makes Art, Humans Supply the Creative Spark","description":"Fears that artificial intelligence tools could displace creatives such as illustrators, designers, and photographers seem unfounded—for now.","url":"https://www.wired.com/story/when-ai-makes-art","urlToImage":"https://media.wired.com/photos/62ce1726540a1fd5ca4bd872/191:100/w_1280,c_limit/Dall-E-2-Meat-Men-Business.jpg","publishedAt":"2022-07-13T11:00:00Z","content":"New products often come with disclaimers, but in April the artificial intelligence company OpenAI issued an unusual warning when it announced a new service called DALL-E 2. The system can generate vi… [+4077 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"20 Best Prime Day Deals on Phones and Tablets (Day 2) (2022): Galaxy S22, Pixel 6, and More","description":"Samsung's Galaxy S22 Ultra is more than $350 off, and the Google Pixel 6 is just $499. It's a deals bonanza.","url":"https://www.wired.com/story/best-amazon-prime-day-phone-tablet-deals-2","urlToImage":"https://media.wired.com/photos/621980b1aaf30ea1c35e400a/191:100/w_1280,c_limit/Gear-Samsung-S22-Series.jpg","publishedAt":"2022-07-12T15:49:47Z","content":"Need to upgrade your phone? Or have you been eyeing a large-screen tablet? Amazon Prime Day is a perfect time to pick up either because there are tons of devices seeing steep discounts right now. We'… [+9307 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The 57 Best Prime Day Deals if You Work (and Play) From Home","description":"These are all the top discounts on essential home office gear, from laptops, desks, and chairs to monitors, keyboards, and mice.","url":"https://www.wired.com/story/best-amazon-prime-day-home-office-laptop-deals-2022-2","urlToImage":"https://media.wired.com/photos/62cc7244fbd0691ce2826576/191:100/w_1280,c_limit/Box-E_WFH.png","publishedAt":"2022-07-12T13:44:35Z","content":"Looking to outfit your home office? Its a good idea, even if youre still going to the office a few times a week. Our ultimate Home Office Gear guide has dozens of recommendations, from portable monit… [+24172 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"How Might Your Data Be Used to Pin Charges on You?","description":"WIRED’s editor in chief reflects on how digital surveillance infrastructure could be used to prosecute abortion, plus more thoughts on this month’s headlines.","url":"https://www.wired.com/story/how-might-your-data-be-used-against-you","urlToImage":"https://media.wired.com/photos/62cc8e2edeab469effe4d1ce/191:100/w_1280,c_limit/systemupdate-651475141.jpg","publishedAt":"2022-07-12T11:00:00Z","content":"This weeks big news in tech: Uber behaved badly. A massive document dump reveals that it knowingly broke laws to roll out its services as widely and quickly as possible. Of course, the company can bl… [+4276 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"The 85 Absolute Best Prime Day 2022 Deals We've Found (Day 2)","description":"Amazon's Prime Day sale event is here. From Alexa-powered Echo Dots to gaming laptops, here are the greatest discounts we’ve found on gear we've tested and like.","url":"https://www.wired.com/story/best-prime-day-deals-2022-4/","urlToImage":"https://media.wired.com/photos/62bf52727c12fa62407fc2dc/191:100/w_1280,c_limit/splat-A_Master.png","publishedAt":"2022-07-12T09:05:00Z","content":"Amazon Prime Day is here. The mega-retailers two-day sales event for Prime subscribers is in full swing, and there are plenty of deals on some of our favorite gear and gadgets, from Alexa-enabled spe… [+34315 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Wired","title":"As Elon Musk Walks, Twitter Workers Say No One's in Charge","description":"Days after the deal to buy Twitter fell apart, fed up employees say they are being kept in the dark.","url":"https://www.wired.com/story/as-elon-musk-walks-twitter-workers-say-no-ones-in-charge","urlToImage":"https://media.wired.com/photos/62cc820b060a9466a0b12b2b/191:100/w_1280,c_limit/Twitter_Musk_Biz_GettyImages-1240267926.jpg","publishedAt":"2022-07-11T20:08:02Z","content":"A number of executives have already left the company in the wake of Musk launching his takeover bid, impacting countless others further down the food chain. The feeling internally is that people have… [+4057 chars]"}]}